MacOSX12.3.sdk/usr/share/man/man5/emond.plist.5
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.\"See Also:
.\"man mdoc.samples for a complete listing of options
.\"man mdoc for the short list of editing options
.\"/usr/share/misc/mdoc.template
.\" test using groff -man emond.plist.5 -T ascii | more
.Dd 6/9/08               \" DATE 
.Dt emond.plist 5      \" Program name and manual section number 
.Os Darwin
.Sh NAME                 \" Section Header - required - don't modify 
.Nm emond.plist
.\" The following lines are read in generating the apropos(man -k) database. Use only key
.\" words here as the database is built based on the words here and in the .ND line. 
.\" Use .Nm macro to designate other names for the documented program.
.Nd config file for emond
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
is a 
.Ar plist
formatted file containing configuration info for the 
.Ar emond
daemon. 
.Sh DESCRIPTION          \" Section Header - required - don't modify
This document details the configuration parameters in an XML property list used by the
.Ar emond
daemon. The property list dictionary contains two sections. The
.Ar config
section contains the configuration information used by 
.Ar emond.
The 
.Ar initialVariables
section contains the initial data used when processing events.
.Pp                      \" Inserts a space
The keys in the 
.Ar config
section are:
.Bl -tag -width -indent  \" Begins a tagged list 
.It debugLevel          \" Each item preceded by .It macro
The debug level, default is 0, larger numbers increase the detail. The info is logged to
the 
.Ar errorLogPath
.It errorLogPath          \" Each item preceded by .It macro
The path to the error log
.It logEvents          \" Each item preceded by .It macro
Triggers the logging of events to the
.Ar eventLogPath
.It eventLogPath          \" Each item preceded by .It macro
The path to the event log (only present if the logEvents key is true)
.It saveState
Tells
.Ar emond
to save the accumulated state info of the event processing system to disk when shutting down 
and reload that state when restarting.   
.El
.Pp                      \" Inserts a space
The initial globals section is used to contain default site specific data for the 
rules used by
.Ar emond
is addition to the config data contained in the rules files themselves.
.Sh SEE ALSO 
.\" List links in ascending order by section, alphabetically within a section.
.\" Please do not reference files that do not exist without filing a bug report
.Xr plist 5 ,
.Xr emond 8 