MacOSX12.3.sdk/usr/share/man/man8/nearbyd.8
.Dd 10/4/17
.Dt nearbyd 8
.Os Darwin
.Sh NAME
.Nm nearbyd
.Nd The proximity daemon
.
.Sh SYNOPSIS
.Nm
takes no arguments, and users should not launch it manually.
.
.Sh DESCRIPTION          \" Section Header - required - don't modify
.Nm
powers spatial interaction experiences between devices using ultra wideband and other wireless technologies
.
.Sh FILES
.Bl -tag -width "System Container Location: proxtool diag --data-url"
.It Pa /System/Library/LaunchDaemons/com.apple.nearbyd.plist
The
.Nm
service's property list file for launchd(8)
.El
.
.Sh SEE ALSO
.Xr launchd 8
.
.Sh HISTORY
first appeared in macOS 10.14 and iOS 12.0
