MacOSX12.3.sdk/usr/share/man/man8/notification_proxy.8
.\" Copyright (c) 2003-2013 Apple Inc. All rights reserved.
.\"
.\" @APPLE_LICENSE_HEADER_START@
.\"
.\" Portions Copyright (c) 2003-2010 Apple Inc.  All Rights Reserved.
.\"
.\" This file contains Original Code and/or Modifications of Original Code
.\" as defined in and that are subject to the Apple Public Source License
.\" Version 2.0 (the 'License'). You may not use this file except in
.\" compliance with the License. Please obtain a copy of the License at
.\" http://www.opensource.apple.com/apsl/ and read it before using this
.\" file.
.\"
.\" The Original Code and all software distributed under the License are
.\" distributed on an 'AS IS' basis, WITHOUT WARRANTY OF ANY KIND, EITHER
.\" EXPRESS OR IMPLIED, AND APPLE HEREBY DISCLAIMS ALL SUCH WARRANTIES,
.\" INCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY,
.\" FITNESS FOR A PARTICULAR PURPOSE, QUIET ENJOYMENT OR NON-INFRINGEMENT.
.\" Please see the License for the specific language governing rights and
.\" limitations under the License.
.\"
.\" @APPLE_LICENSE_HEADER_END@
.\"
.\"
.Dd March 25, 2021
.Dt notification_proxy 8
.Os "Mac OS X"
.Sh NAME
.Nm notification_proxy
.Nd notification server
.Sh SYNOPSIS
.Nm
.Sh DESCRIPTION
.Nm
enables a trusted remote Mac to read/write notifications on this Mac.
Trust requires that this Mac explicitly pair with the remote Mac.
The daemon is started automatically by
.Nm launchd
upon the trusted Mac requesting a connection to this service.
.Pp
This daemon also allows an untrusted remote Mac to read/write notifications
while this Mac is still in setup. Once this Mac exits device setup,
trust is required.
.Pp
This command is not intended to be invoked directly.
.Sh SEE ALSO
.Xr notify 3 .
