MacOSX12.3.sdk/usr/share/man/man8/relatived.8
.\"
.\" Copyright 2019 Apple, Inc. All rights reserved.
.\"
.\" The following requests are required for all man pages.
.Dd 7/24/19
.Dt relatived 8
.Os Darwin
.Sh NAME
.Nm relatived
.Nd Relative Motion daemon.
.Sh SYNOPSIS
.Nm
.Sh DESCRIPTION
.Nm
provides data high-frequency data to the RelativeMotion framework.
The daemon lifecycle is managed by launchd and will be run on demand.
.Pp                      \" Inserts a space
.\" .Sh ENVIRONMENT      \" May not be needed
.\" .Bl -tag -width "ENV_VAR_1" -indent \" ENV_VAR_1 is width of the string ENV_VAR_1
.\" .It Ev ENV_VAR_1
.\" Description of ENV_VAR_1
.\" .It Ev ENV_VAR_2
.\" Description of ENV_VAR_2
.\" .El                      
.Sh FILES                \" File used or created by the topic of the man page
.Bl -tag -width "/Users/joeuser/Library/really_long_file_name" -compact
.It Pa /System/Library/LaunchDaemons/com.apple.relatived.plist
The
.Nm
service's property list file for
.Xr launchd 8 .
.El                      \" Ends the list
.Sh SEE ALSO 
.\" List links in ascending order by section, alphabetically within a section.
.\" Please do not reference files that do not exist without filing a bug report
.Xr a 1 , 
.Xr b 1 ,
.Xr c 1 ,
.Xr a 2 ,
.Xr b 2 ,
.Xr a 3 ,
.Xr b 3 
.\" .Sh BUGS              \" Document known, unremedied bugs 
.\" .Sh HISTORY           \" Document history if command behaves in a unique manner
