MacOSX12.3.sdk/usr/share/man/man8/sharedfilelistd.8
.Dd May 10, 2018
.Dt sharedfilelistd 8
.Os macOS
.
.Sh NAME
.Nm sharedfilelistd
.Nd User agent which manages lists of file system items
.
.Sh DESCRIPTION
.Nm
is a per-user agent that manages lists of recent and favorite documents, applications, and volumes. 
It stores the lists for global Apple Menu > Recent Items, the per-application File > Open Recent, and some of the content in the Finder sidebar.
.
.Sh FILES
/System/Library/CoreServices/sharedfilelistd
/System/Library/LaunchAgents/com.apple.coreservices.sharedfilelistd.plist
~/Library/Application\ Support/com.apple.sharedfilelist/*
.
.Sh SEE ALSO
.Nm sfltool
