MacOSX12.3.sdk/usr/share/man/man8/system_profiler.8
.Dd June 30, 2003
.Dt SYSTEM_PROFILER 8
.Os Darwin
.Sh NAME
.Nm system_profiler
.Nd reports system hardware and software configuration.
.Sh SYNOPSIS
.Nm
.Op Fl usage
.Nm
.Op Fl listDataTypes
.Nm
.Op Fl xml
.Ar dataType1 ... dataTypeN
.Nm
.Op Fl xml
.Op Fl detailLevel Ar level
.Nm
.Op Fl json
.Ar dataType1 ... dataTypeN
.Nm
.Op Fl json
.Op Fl detailLevel Ar level
.Sh DESCRIPTION
.Nm
reports on the hardware and software configuration of the system.
It can generate plain text reports or XML reports which can be opened with System Information.app, or JSON reports
.Pp
Progress and error messages are printed to stderr while actual report data is printed to stdout.
Redirect stderr to /dev/null to suppress progress and error messages.
.Pp
The following options are available:
.Bl -tag -width "-detailLevel level"
.It Fl xml
Generates a report in XML format.
If the XML report is redirected to a file with a ".spx" suffix that file can be opened with System Information.app.
.It Fl json
Generates a report in JSON format.
.It Fl listDataTypes
Lists the available datatypes.
.It Fl detailLevel Ar level
Specifies the level of detail for the report:
.Bl -tag -width 12n
.It mini
report with no personal information
.It basic
basic
hardware and network information
.It full
all available information
.El
.It Fl timeout
Specifies the maximum time to wait in seconds for results.
If some information is not available within the specified time limit then an incomplete or partial report will be generated.
The default timeout is 180 seconds.
Specifying a timeout of 0 means no timeout.
.It Fl usage
Prints usage info and examples.
.El
.Sh EXAMPLES
.Nm
  Generates a text report with the standard detail level.
.Pp
.Nm
-detailLevel mini
  Generates a short report containing no personal information.
.Pp
.Nm
-listDataTypes
  Shows a list of the available data types.
.Pp
.Nm
SPSoftwareDataType SPNetworkDataType
  Generates a text report containing only software and network data.
.Pp
.Nm
-xml > MyReport.spx
  Creates a XML file which can be opened by System Profiler.app
.Sh AUTHORS
.An Apple Inc.
