MacOSX11.3.sdk/usr/share/man/man1/psm.1
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.\"See Also:
.\"man mdoc.samples for a complete listing of options
.\"man mdoc for the short list of editing options
.Dd June 15, 2020        \" DATE
.Dt psm 1                \" Program name and manual section number
.Os Mac OS X
.Sh NAME                 \" Section Header - required - don't modify
.Nm psm
.\" The following lines are read in generating the apropos(man -k) database. Use only key
.\" words here as the database is built based on the words here and in the .ND line.
.\" Use .Nm macro to designate other names for the documented program.
.Nd Command line interface to Apple Silicon password slot manager
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Op Ar verb              \" [verb]
.Op Fl dsv               \" [-dsv]
.Sh DESCRIPTION          \" Section Header - required - don't modify
A simple command line interface which lets you check the status of slots,
and remove any orphaned slots. Slots are automatically allocated on a first
come first serve bases, and this tool allows you to see which users are
currently being protected by a specific slot.  To free up a slot you
may need to delete an existing user from the system that is currently
enrolled; thus allowing the next password change to enroll into
Apple Silicon password slot manager.
.Pp
By default
.Nm
will execute the
.Ar command
supplied and report if anything went wrong.
.Pp
Here is a complete list of the options available:
.Bl -tag -width -indent
.It Fl d Ar disk3s5
specify a disk to operate on <disk3s5>
.It Fl s Ar #
specify a specifc slot number
.It Fl v
will make
.Nm
more verbose.
.El                      \" Ends the list
.Pp
.Sh VERBS
.Bl -hang -width "imageinfo"
.It Sy status
Displays status for all currently enrolled slots
.It Sy remove
Allows you to remove a specific slot
.El                      \" Ends the list
.Pp
.Sh SEE ALSO
.\" List links in ascending order by section, alphabetically within a section.
.\" Please do not reference files that do not exist without filing a bug report
.Xr passwd 1
.Xr diskutil 8
.Xr fdesetup 8
.Sh HISTORY
.Nm
was first introduced in Mac OS X version 11.
