MacOSX11.0.sdk/usr/share/man/man8/apfs_condenser.8
.\" Copyright (c) 2018 Apple Inc. All rights reserved.
.\"
.\" The contents of this file constitute Original Code as defined in and
.\" are subject to the Apple Public Source License Version 1.1 (the
.\" "License").  You may not use this file except in compliance with the
.\" License.  Please obtain a copy of the License at
.\" http://www.apple.com/publicsource and read it before using this file.
.\"
.\" This Original Code and all software distributed under the License are
.\" distributed on an "AS IS" basis, WITHOUT WARRANTY OF ANY KIND, EITHER
.\" EXPRESS OR IMPLIED, AND APPLE HEREBY DISCLAIMS ALL SUCH WARRANTIES,
.\" INCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY,
.\" FITNESS FOR A PARTICULAR PURPOSE OR NON-INFRINGEMENT.  Please see the
.\" License for the specific language governing rights and limitations
.\" under the License.
.\"
.\"     @(#)apfs_condenser.8
.hlm 0
.Dd September 28, 2018
.Dt APFS_CONDENSER 8
.Os "Mac OS X"
.Sh NAME
.Nm apfs_condenser
.Nd insert the contents of an existing B-tree into a new B-tree to improve B-tree space utilization
.Sh SYNOPSIS
.Nm
.Op Fl s Ar snap_name
.Op Fl w Ar watchdog_timeout
.Op Fl v
.Fl p Ar device_path
.Fl i Ar filesystem_slice
.Sh DESCRIPTION
The
.Nm
command sequentially inserts the contents of an existing B-tree into a new B-tree to improve B-tree space utilization.
The
.Nm
requires the container to be unmounted and an encrypted volume to be unlocked.
The
.Ar filesystem_slice
parameter is 1-based and the
.Ar device_path
parameter is the path of the device representing the container.
.Pp
The options are as follows:
.Bl -tag -width 20n
.It Fl s Ar snap_name
If compaction succeeds, the snapshot will be deleted.
Usually used in the OTA environment.
.It Fl v
Increase verbosity of the output.
.It Fl w Ar timeout
Force the compaction to abort after the supplied timeout in seconds.
.El
.Sh EXIT STATUS
.Ex -std
.Sh EXAMPLES
The following condenses the first APFS volume with
.Pa /dev/disk1
as the synthesized container path :
.Dl Nm Fl p Pa /dev/disk1 Fl i Pa 1
.Sh HISTORY
The
.Nm
utility first appeared in OS X 10.14.
