MacOSX11.0.sdk/usr/share/man/man8/AssetCacheTetheratorUtil.8
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.\"See Also:
.\"man mdoc.samples for a complete listing of options
.\"man mdoc for the short list of editing options
.\"/usr/share/misc/mdoc.template
.Dd 8/1/19               \" DATE 
.Dt AssetCacheTetheratorUtil 8      \" Program name and manual section number 
.Os "macOS"
.Sh NAME                 \" Section Header - required - don't modify 
.Nm AssetCacheTetheratorUtil
.\" The following lines are read in generating the apropos(man -k) database. Use only key
.\" words here as the database is built based on the words here and in the .ND line. 
.\" .Nm Other_name_for_same_program(),
.\" .Nm Yet another name for the same program.
.\" Use .Nm macro to designate other names for the documented program.
.Nd control networking of tethered devices
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Op -j|--json
.Ar enable
.Nm
.Op -j|--json
.Ar disable
.Nm
.Op -j|--json
.Ar isEnabled
.Nm
.Op -j|--json
.Ar status
.Sh DESCRIPTION          \" Section Header - required - don't modify
iOS and tvOS devices connected to a computer with a USB cable can be "tethered,"
so that they route their Internet requests through the computer.
.Nm
enables a tethered network, disables it, or reports on its status.
Tethering requires Content Caching.
.Nm
must be run by root, except for the isEnabled and status commands.
.Sh OPTIONS
.Bl -tag
.It -j|--json
Print results in machine-parseable JSON format to stdout.
.El
.Sh "SEE ALSO"
System Preferences > Sharing > Content Caching,
.Ns Xr AssetCacheLocatorUtil 8 ,
.Ns Xr AssetCacheManagerUtil 8
