MacOSX11.0.sdk/usr/share/man/man8/dsenableroot.8
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.\"See Also:
.\"man mdoc.samples for a complete listing of options
.\"man mdoc for the short list of editing options
.\"/usr/share/misc/mdoc.template
.Dd August 08 2003               \" DATE 
.Dt dsenableroot 8      \" Program name and manual section number 
.Os Mac OS X
.Sh NAME                 \" Section Header - required - don't modify 
.Nm dsenableroot
.Nd enables or disables the root account.
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Op Fl d
.Op Fl u Ar username         \" [-a path] 
.Op Fl p Ar password         \" [-a path] 
.Op Fl r Ar rootPassword     \" [-a path] 
.Pp
.Sh DESCRIPTION          \" Section Header - required - don't modify
.Nm
sets the password for the root account if enabling the root user account.  Otherwise, if disable [-d] is chosen, the root account passwords are removed and the root user is disabled.  
.Pp                      \" Inserts a space
A list of flags and their descriptions:
.Bl -tag -width -indent  \" Differs from above in tag removed 
.It Fl u Ar username
Username of a user that has administrative privileges on this computer.
.It Fl p Ar password
Password to use in conjunction with the specified username.  If this is not specified, you will be prompted for entry.
.It Fl r Ar rootPassword
Password to be used for the root account.  If this is not specified for enabling, you will be prompted for entry.
.El                      \" Ends the list
.Pp
.Sh EXAMPLES
.Pp
.Bl -tag -width -indent  \" Differs from above in tag removed 
.It Fl "dsenableroot"
Your username will be used and you will be queried for both your password and the new root password to be set to enable the root account.
.It Fl "dsenableroot -d"
Your username will be used and you will be queried for only your password to disable the root account.
.It Fl "dsenableroot -u username -p userpassword -r rootpassword"
The supplied arguments will be used to enable the root account.
.It Fl "dsenableroot -d -u username -p userpassword"
The supplied arguments will be used to disable the root account.
.El                      \" Ends the list
.Pp
.Pp
