MacOSX11.0.sdk/usr/share/man/man8/mkbom.8
.\"Copyright (c) 1999-2006 Apple Computer, Inc.  All Rights Reserved.
.\"
.\"This file contains Original Code and/or Modifications of Original Code
.\"as defined in and that are subject to the Apple Public Source License
.\"Version 2.0 (the 'License'). You may not use this file except in
.\"compliance with the License. Please obtain a copy of the License at
.\"http://www.opensource.apple.com/apsl/ and read it before using this
.\"file.
.\"
.\"The Original Code and all software distributed under the License are
.\"distributed on an 'AS IS' basis, WITHOUT WARRANTY OF ANY KIND, EITHER
.\"EXPRESS OR IMPLIED, AND APPLE HEREBY DISCLAIMS ALL SUCH WARRANTIES,
.\"INCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY,
.\"FITNESS FOR A PARTICULAR PURPOSE, QUIET ENJOYMENT OR NON-INFRINGEMENT.
.\"Please see the License for the specific language governing rights and
.\"limitations under the License.
.Dd September 26, 2006
.Dt MKBOM 8
.Os "Mac OS X"
.Sh NAME
.Nm mkbom
.Nd create a bill-of-materials file
.Sh SYNOPSIS
.Nm
.Op Fl s 
.Ar directory
.Ar bom
.Nm
.Op Fl s
.Fl i
.Ar filelist
bom
.Nm
.Fl h |
.Fl -help
.Sh DESCRIPTION
The
.Nm
command creates a bill-of-materials
.Pf ( Xr bom 5 Ns ) . 
You must specify either a source as a directory, or a text file containing
a file listing as outputted by
.Xr lsbom 8 . 
.Nm 
will generate bill-of-materials information based on that information.
Any existing bomfile will be overwritten by the new bomfile.
.Pp
Options:
.Bl -tag -width ".It Fl i Ar filelist"
.It Fl h
print full usage
.It Fl s
create a simplified bom containing only file paths
.It Fl i Ar filelist
use the information in
.Ar filelist ,
one entry per line, to construct the bom file. The format of the file should
match
.Xr lsbom 8
output with no formatting options (the default). If
.Fl s
is given to
.Nm ,
the input filelist should contain only pathnames, as with
.Nm lsbom Fl s .
.El
.Pp
.Sh SEE ALSO 
.Xr bom 5 , 
.Xr ditto 8 , 
.Xr mkbom 8 
.Sh HISTORY 
The
.Nm 
command appeared in NeXTSTEP as a tool to create
.Nm bom
files used during installation.
