MacOSX11.0.sdk/usr/share/man/man8/mount_tmpfs.8
.\" Copyright (c) 2020 Apple Computer, Inc. All rights reserved.
.\"
.\" The contents of this file constitute Original Code as defined in and
.\" are subject to the Apple Public Source License Version 1.1 (the
.\" "License").  You may not use this file except in compliance with the
.\" License.  Please obtain a copy of the License at
.\" http://www.apple.com/publicsource and read it before using this file.
.\"
.\" This Original Code and all software distributed under the License are
.\" distributed on an "AS IS" basis, WITHOUT WARRANTY OF ANY KIND, EITHER
.\" EXPRESS OR IMPLIED, AND APPLE HEREBY DISCLAIMS ALL SUCH WARRANTIES,
.\" INCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY,
.\" FITNESS FOR A PARTICULAR PURPOSE OR NON-INFRINGEMENT.  Please see the
.\" License for the specific language governing rights and limitations
.\" under the License.
.\"
.\"     @(#)mount_tmpfs.8
.hlm 0
.Dd September 16, 2020
.Dt MOUNT_TMPFS 8
.Os "Mac OS X"
.Sh NAME
.Nm mount_tmpfs
.Nd mount a
.Tn tmpfs
volume
.Sh SYNOPSIS
.Nm
.Op Fl o Ar options
.Op Fl i | Fl e
.Op Fl n Ar max_nodes
.Op Fl s Ar max_mem_size
.Ar directory
.Sh DESCRIPTION
The
.Nm
command creates a new
.Tn tmpfs
(in-memory file system) volume and attaches it to the global file system namespace at the location indicated by
.Pa directory .
.Pp
The options are as follows:
.Bl -tag -width 16n
.It Fl o Ar options
Options passed to
.Xr mount 2
are specified with the
.Fl o
option followed by a comma separated string of options. See the
.Xr mount 8
man page for possible options and their meanings.
.It Fl i
Make the volume case-insensitive (default).
.It Fl e
Make the volume case-sensitive.
.It Fl n Ar max_nodes
Set the maximum number of nodes available to the file system to
.Pa max_nodes .
.It Fl s Ar max_mem_size
Set the maximum total file system size to
.Pa max_mem_size
bytes, unless suffixed with one of k, m, g, or t, which denote kilobyte, megabyte, gigabyte and terabyte respectively.
.El
.Sh DIAGNOSTICS
.Ex -std
.Sh SEE ALSO
.Xr mount 2 ,
.Xr unmount 2 ,
.Xr mount 8 ,
.Xr umount 8
.Sh HISTORY
The
.Nm
utility first appeared in OS X 10.16.
