MacOSX11.0.sdk/usr/share/man/man8/nlcontrol.8
.\"
.\" Copyright 2009 Apple, Inc. All rights reserved.
.\"
.\" The following requests are required for all man pages.
.Dd Wed Nov  4 17:03:55 PST 2009
.Dt nlcontrol 8
.Os Darwin
.Sh NAME
.Nm nlcontrol
.Nd NETLOGON secure channel utility
.Sh SYNOPSIS
.Nm
.Op Cm reconfigure
status
.Op Cm options
status
.Nm
.Op Cm options
verify
.Nm
.Op Cm options
change-password
.Sh DESCRIPTION
The NETLOGON channel is a secure connection to a Windows Domain Controller
that is used for non-Kerberos user authentication.
.Nm
can be used to manipulate and test the status of the NETLOGON channel.
.Sh OPTIONS
.Bl -tag -width -indent  \" Differs from above in tag removed
.It Fl domain
The service will log extensive debug information and may perform extra
diagnostic checks. This option is typically only useful for debugging.
.It Fl help
Prints a usage message and exits.
.It Fl server Ar list
The service will listen on each of the TCP ports specified in the
comma-separated list. This option is typically only used for debugging.
.El
.Pp
.Nm
supports the following commands:
.Bl -tag -width "change-password"
.It Cm reconfigure
Force the NETLOGON service to re-read its configuration information. This is
not necessary in normal operation, since the NETLOGON service will
detect relevant configuration changes and re-establish the secure
channel automatically.
.It Cm status
Print the current status of the NETLOGON channel without altering its state.
.It Cm verify
Attempt to verify that the NETLOGON channel is available and working correctly.
.It Cm change-password
Bring up the NETLOGON channel and change the password of the machine account.
The machine account is used to authenticate to the Domain Controller in order
to secure the channel.
.El
.\" The following requests should be uncommented and used where appropriate.
.\" This next request is for sections 2 and 3 function return values only.
.\" .Sh RETURN VALUES
.\" This next request is for sections 1, 6, 7 & 8 only
.\" .Sh ENVIRONMENT
.\" .Sh FILES
.\" .Bl -tag -width -indent
.\" .It Pa /Library/Preferences/SystemConfiguration/com.apple.smb.server.plist
.\" The primary configuration for the SMB stack. This file is updated by various
.\" system services and should not be edited by hand.
.\" .It Pa /System/Library/LaunchDaemons/com.apple.smbd.plist
.\" The
.\" .Nm
.\" service's property list file for
.\" .Xr launchd 8 .
.\".El
.\" .Sh EXAMPLES
.\" This next request is for sections 1, 6, 7 & 8 only
.\"     (command return values (to shell) and fprintf/stderr type diagnostics)
.Sh DIAGNOSTICS
.Nm
will exit with a non-zero error code if the command fails. It may also display a
Windows error code, which is typically self-explanatory.
.\" The next request is for sections 2 and 3 error and signal handling only.
.\" .Sh ERRORS
.\" .Sh SEE ALSO
.\" .Xr example 8
.\" Cross-references should be ordered by section (low to high), then in
.\"     alphabetical order.
.Sh HISTORY
The
.Nm
utility first appeared in Mac OS 10.7.
.\" .Sh AUTHORS
.\" .Sh BUGS
