MacOSX11.0.sdk/usr/share/man/man8/printtool.8
.Dd December 8, 2016
.Dt printtool 8
.Os Darwin
.Sh NAME
.Nm printtool
.Nd a tool to configure the printing system
.Sh SYNOPSIS
.Nm printtool
.Op Fl -reset
.Op Fl f
.Sh DESCRIPTION
A tool to perform privileged configuration operations on the printing system.
.Pp 
The options are as follows:
.Bl -tag -width indent
.It Fl -reset
Reset the printing system
.It Fl f
Do not prompt for confirmation
.El
.Sh FILES
.Bl -tag -width indent -compact
.It /System/Library/Frameworks/ApplicationServices.framework/Versions/A/Frameworks/PrintCore.framework/Versions/A/printtool
.El
.Sh HISTORY
First appeared in Mac OS 10.4. Reset command added in Mac OS 10.14
