MacOSX11.0.sdk/usr/share/man/man8/syspolicyd.8
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.\"See Also:
.\"man mdoc.samples for a complete listing of options
.\"man mdoc for the short list of editing options
.\"/usr/share/misc/mdoc.template
.Dd 10/10/11             \" DATE 
.Dt syspolicyd 8		 \" Program name and manual section number 
.Os Darwin
.Sh NAME                 \" Section Header - required - don't modify 
.Nm syspolicyd
.\" The following lines are read in generating the apropos(man -k) database. Use only key
.\" words here as the database is built based on the words here and in the .ND line. 
.Nd System Policy daemon
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Op Fl v
.Sh DESCRIPTION          \" Section Header - required - don't modify
.Nm
embodies the system policy controlling what may be installed, loaded, executed,
or otherwise used on the system. It manages the policy database file, and serves
as a general oracle that other system components may use to determine the
system policy's verdict on a proposed operation.
.Pp
.Sh FILES                \" File used or created by the topic of the man page
.Bl -tag -width "/var/db/SystemPolicy" -compact
.It Pa /var/db/SystemPolicy
The master system policy database
.El                      \" Ends the list
.Sh SEE ALSO 
.Xr securityd 8 , 
.\" .Sh BUGS              \" Document known, unremedied bugs 
.\" .Sh HISTORY           \" Document history if command behaves in a unique manner
