MacOSX11.0.sdk/usr/share/man/man8/thermald.8
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.\"See Also:
.\"man mdoc.samples for a complete listing of options
.\"man mdoc for the short list of editing options
.\"/usr/share/misc/mdoc.template
.Dd 11/12/13               \" DATE 
.Dt thermald 8             \" Program name and manual section number
.Os Darwin
.Sh NAME                  \" Section Header - required - don't modify
.Nm thermald
.Nd thermal management daemon
.Sh DESCRIPTION          \" Section Header - required - don't modify
The
.Nm
daemon should be not invoked directly.
.Sh SEE ALSO
.\" List links in ascending order by section, alphabetically within a section.
.\" Please do not reference files that do not exist without filing a bug report
.Xr powermetrics 1 ,
.Xr top 1
