MacOSX11.0.sdk/usr/share/man/man8/usbcupdater.8
.\" Copyright (c) 2015-17 Apple Inc. All rights reserved.
.\"
.\" The contents of this file constitute Original Code as defined in and
.\" are subject to the Apple Public Source License Version 1.1 (the
.\" "License").  You may not use this file except in compliance with the
.\" License.  Please obtain a copy of the License at
.\" http://www.apple.com/publicsource and read it before using this file.
.\"
.\" This Original Code and all software distributed under the License are
.\" distributed on an "AS IS" basis, WITHOUT WARRANTY OF ANY KIND, EITHER
.\" EXPRESS OR IMPLIED, AND APPLE HEREBY DISCLAIMS ALL SUCH WARRANTIES,
.\" INCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY,
.\" FITNESS FOR A PARTICULAR PURPOSE OR NON-INFRINGEMENT.  Please see the
.\" License for the specific language governing rights and limitations
.\" under the License.
.\"
.\"     @(#)usbcupdater.8
.hlm 0
.Dd May 16, 2016
.Dt USBCUPDATER 8
.Os "Mac OS X"
.Sh NAME
.Nm usbcupdater
.Nd update the
.Tn USB-C
subsystem components
.Sh SYNOPSIS
.Nm
.\" .Op Fl v
.\" .Op Fl p Ar path
.\" .Op Fl X
.\" .Op Fl s
.\" .Op Fl b
.Sh DESCRIPTION
The
.Nm
command updates components required by the
.Tn USB-C
subsystem.
.Pp
This tool is intended to be used by
.Ar FirmwareUpdateLauncher
and is not intended to be called directly by the user outside of this context.
.Pp
.\" Documented options are as follows:
.\" .Bl -tag -width 20n
.\" .It Fl v | Fl -verbose
.\" Report back current host device characteristics.
.\" .El
.\"
.\" All other options are intended for internal use only.
.Sh DIAGNOSTICS
.Ex -std
.\" .Sh EXAMPLES
.\" The following reports current host device charactistics:
.\" .Dl Nm Fl v
.\" .Pp
.Sh HISTORY
The
.Nm
utility first appeared in OS X 10.12.
