MacOSX11.0.sdk/usr/share/man/man8/xartstorageremoted.8
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.\"/usr/share/misc/mdoc.template
.Dd June 6, 2016       \" DATE
.Dt xartstorageremoted 8
.Os Darwin
.Sh NAME                 \" Section Header - required - don't modify
.Nm xartstorageremoted
.Nd xART Remote Storage Daemon
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Sh DESCRIPTION          \" Section Header - required - don't modify
The 
.Nm
executable is a daemon intended to listen for save/fetch requests from the
CoProcessor. This daemon is required for multi-partitions and multi-users support.
.Pp
.Nm
must not be unloaded and should only be run via launchd when a request
must be handled.
.Pp                      \" Inserts a space
.Sh FILES                \" File used or created by the topic of the man page
.Bl -tag -width "/System/Library/LaunchDaemons/com.apple.xartstorageremoted.plist" -compact
.It Pa /usr/libexec/xartstorageremoted
The daemon
.It Pa /System/Library/LaunchDaemons/com.apple.xartstorageremoted.plist
The launchd configuration plist
.El
