MacOSX11.0.sdk/usr/share/man/man8/xssendevent.8
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.\"See Also:
.\"man mdoc.samples for a complete listing of options
.\"man mdoc for the short list of editing options
.\"/usr/share/misc/mdoc.template
.\" test using groff -man xssendevent.8 -T ascii | more
.Dd 09/01/06               \" DATE 
.Dt xssendevent 8      \" Program name and manual section number 
.Os Darwin
.Sh NAME                 \" Section Header - required - don't modify 
.Nm xssendevent
.\" The following lines are read in generating the apropos(man -k) database. Use only key
.\" words here as the database is built based on the words here and in the .ND line. 
.Nd Event Monitor Tools
.\" Use .Nm macro to designate other names for the documented program.
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Op Fl e Ar path         \" [-e path] 
.Sh DESCRIPTION          \" Section Header - required - don't modify
.Nm
sends events to the 
.Ar Event Monitor (emond).
Accepts events in text plist format (see http://developer.apple.com/documentation/Cocoa/Conceptual/PropertyLists/index.html) 
from standard input or a text file (with the -e option)
.Pp                      \" Inserts a space
Options:
.Bl -tag -width -indent  \" Differs from above in tag removed 
.It Fl e Ar path                \"-a flag as a list item
Tells
.Nm
to load a file of events in text plist format, one "event" per line.
.El                      \" Ends the list
.Pp
.\" .Sh ENVIRONMENT      \" May not be needed
.\" .Bl -tag -width "ENV_VAR_1" -indent \" ENV_VAR_1 is width of the string ENV_VAR_1
.\" .It Ev ENV_VAR_1
.\" Description of ENV_VAR_1
.\" .It Ev ENV_VAR_2
.\" Description of ENV_VAR_2
.\" .El                      
.\".Sh FILES                \" File used or created by the topic of the man page
.\".Bl -tag -width "/Users/joeuser/Library/really_long_file_name" -compact
.\".It Pa /etc/emond.d/rules/
.\"Default directory where
.\".Nm
.\"looks for rules.
.\".It Pa /etc/emond.d/emond.plist
.\"the plist formatted config file
.\".It Pa /System/Library/LaunchDaemons/com.apple.emond.plist
.\"the launchd config file
.\".El                      \" Ends the list
.\" .Sh DIAGNOSTICS       \" May not be needed
.\" .Bl -diag
.\" .It Diagnostic Tag
.\" Diagnostic informtion here.
.\" .It Diagnostic Tag
.\" Diagnostic informtion here.
.\" .El
.Sh EXAMPLES       
.Sh SEE ALSO 
.\" List links in ascending order by section, alphabetically within a section.
.\" Please do not reference files that do not exist without filing a bug report
.Xr	emond 8
.\" .Sh BUGS              \" Document known, unremedied bugs 
.\" .Sh HISTORY           \" Document history if command behaves in a unique manner