MacOSX11.1.sdk/usr/share/man/man4/pflog.4
.\" 
.\" Copyright (c) 2009 Apple Inc. All rights reserved.
.\" 
.\" @APPLE_OSREFERENCE_LICENSE_HEADER_START@
.\" 
.\" This file contains Original Code and/or Modifications of Original Code
.\" as defined in and that are subject to the Apple Public Source License
.\" Version 2.0 (the 'License'). You may not use this file except in
.\" compliance with the License. The rights granted to you under the License
.\" may not be used to create, or enable the creation or redistribution of,
.\" unlawful or unlicensed copies of an Apple operating system, or to
.\" circumvent, violate, or enable the circumvention or violation of, any
.\" terms of an Apple operating system software license agreement.
.\" 
.\" Please obtain a copy of the License at
.\" http://www.opensource.apple.com/apsl/ and read it before using this file.
.\" 
.\" The Original Code and all software distributed under the License are
.\" distributed on an 'AS IS' basis, WITHOUT WARRANTY OF ANY KIND, EITHER
.\" EXPRESS OR IMPLIED, AND APPLE HEREBY DISCLAIMS ALL SUCH WARRANTIES,
.\" INCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY,
.\" FITNESS FOR A PARTICULAR PURPOSE, QUIET ENJOYMENT OR NON-INFRINGEMENT.
.\" Please see the License for the specific language governing rights and
.\" limitations under the License.
.\" 
.\" @APPLE_OSREFERENCE_LICENSE_HEADER_END@
.\" 
.\"	$apfw: pflog.4,v 1.3 2008/08/27 00:01:31 jhw Exp    $
.\"
.\"	$OpenBSD: pflog.4,v 1.9 2006/10/25 12:51:31 jmc Exp $
.\"
.\" Copyright (c) 2001 Tobias Weingartner
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd $Mdocdate: May 31 2007 $
.Dt PFLOG 4
.Os
.Sh NAME
.Nm pflog
.Nd packet filter logging interface
.Sh SYNOPSIS
.Cd "pseudo-device pflog"
.Sh DESCRIPTION
The
.Nm pflog
interface is a pseudo-device which makes visible all packets logged by
the packet filter.
Logged packets can easily be monitored in real
time by invoking
.Xr tcpdump 1
on the
.Nm
interface.
.\", or stored to disk using
.\".Xr pflogd 8 .
.\".Pp
.\"The pflog0 interface is created automatically at boot if both
.\"packet filter
.\"and
.\".Xr pflogd 8
.\"are enabled;
.\"further instances can be created using
.\".Xr ifconfig 8 .
.Pp
Instances of the
.Nm
interface can be created using
.Xr ifconfig 8 .
.\".Pp
.\"Each packet retrieved on this interface has a header associated
.\"with it of length
.\".Dv PFLOG_HDRLEN .
.\"This header documents the address family, interface name, rule
.\"number, reason, action, and direction of the packet that was logged.
.\"This structure, defined in
.\".Aq Pa net/if_pflog.h
.\"looks like
.\".Bd -literal -offset indent
.\"struct pfloghdr {
.\"	u_int8_t	length;
.\"	sa_family_t	af;
.\"	u_int8_t	action;
.\"	u_int8_t	reason;
.\"	char		ifname[IFNAMSIZ];
.\"	char		ruleset[PF_RULESET_NAME_SIZE];
.\"	u_int32_t	rulenr;
.\"	u_int32_t	subrulenr;
.\"	uid_t		uid;
.\"	pid_t		pid;
.\"	uid_t		rule_uid;
.\"	pid_t		rule_pid;
.\"	u_int8_t	dir;
.\"	u_int8_t	pad[3];
.\"};
.\".Ed
.Sh EXAMPLES
Create a
.Nm
interface
and monitor all packets logged on it:
.Bd -literal -offset indent
# ifconfig pflog1 create
# tcpdump -n -e -ttt -i pflog1
.Ed
.Sh SEE ALSO
.Xr inet 4 ,
.Xr inet6 4 ,
.Xr netintro 4 ,
.Xr pf 4 ,
.Xr ifconfig 8 ,
.\".Xr pflogd 8 ,
.Xr tcpdump 1
.Sh HISTORY
The
.Nm
device first appeared in
.Ox 3.0 .
.\" .Sh BUGS
.\" Anything here?
