MacOSX12.0.sdk/usr/share/man/man1/sntp.1
.Dd 8/4/10
.Dt SNTP 1 
.Os Darwin
.Sh NAME 
.Nm sntp
.Nd A very Simple Network Time Protocol client program
.Sh SYNOPSIS
.Nm
.Op Fl drSs
.Op Fl g Ar milliseconds
.Op Fl t Ar seconds
.Ar host-name-or-IP
.Sh DESCRIPTION
.Bl -tag -width -indent 
.It Fl d
Enable debug logging.
.It Fl g Ar milliseconds
Gap betwen requests in milliseconds.
.It Fl n Ar number
Number of DNS records to use for each host argument. This does not have to be less than, equal to, or greater than the number of records that any host lookup returns. Numbers smaller than the number of records will fetch only that many records. Numbers larger than the number of records will fetch some records more than once, as required, to reach the number of fetches desired.
.It Fl r
.Xr bind 2
the NTP reserved port (123) for source communications.
.It Fl S
Use
.Xr clock_settime 2
to set the system clock if the offset is greater than 50 milliseconds, or
.Fl s
is not specified.
.It Fl s
Use
.Xr adjtime 2
to slew the system clock if the offset is less than 50 milliseconds.
.It Fl t Ar seconds
Maximum number of seconds to wait for responses.
.It Fl z Ar path
Path to dump header state to. This is useful for
.Xr sntpd 8
to read from. Header data is stored on disk in big-endian (NBO) format.
.El
.Pp
.Sh USAGE
.Bl -tag -width indent
.It Li "sntp pool.ntp.org"
.El
.Sh SEE ALSO 
.Xr clock_settime 2 ,
.Xr adjtime 2 ,
.Xr timed 8 ,
.Xr sntpd 8
.Sh HISTORY
This
.Nm
should not be confused with the Network Time Foundation's
.Nm
implementation. This is a simplified client that supports a minimal subset of
features for compatibility.
.Pp
This
.Nm
first appeared in macOS 11.0.
