MacOSX10.14.sdk/usr/share/man/man1/lsvfs.1
.\" Copyright (c) 1998-2003 Apple Computer, Inc. All rights reserved.
.\"
.\" @APPLE_LICENSE_HEADER_START@
.\" 
.\" The contents of this file constitute Original Code as defined in and
.\" are subject to the Apple Public Source License Version 1.1 (the
.\" "License").  You may not use this file except in compliance with the
.\" License.  Please obtain a copy of the License at
.\" http://www.apple.com/publicsource and read it before using this file.
.\" 
.\" This Original Code and all software distributed under the License are
.\" distributed on an "AS IS" basis, WITHOUT WARRANTY OF ANY KIND, EITHER
.\" EXPRESS OR IMPLIED, AND APPLE HEREBY DISCLAIMS ALL SUCH WARRANTIES,
.\" INCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY,
.\" FITNESS FOR A PARTICULAR PURPOSE OR NON-INFRINGEMENT.  Please see the
.\" License for the specific language governing rights and limitations
.\" under the License.
.\"
.\" @APPLE_LICENSE_HEADER_END@
.\"
.Dd January 4, 2003
.Dt LSVFS 1
.Sh NAME
.Nm lsvfs
.Nd list known virtual file systems
.Sh SYNOPSIS
.Nm
.Op Ar vfsname Ar ...
.Sh DESCRIPTION
The
.Nm
command lists information about the currently loaded virtual filesystem
modules.
When
.Ar vfsname
arguments are given,
.Nm
lists information about the specified VFS modules.
Otherwise,
.Nm
lists all currently loaded modules.
The information is as follows:
.Pp
.Bl -tag -compact -width Filesystem
.It Filesystem
the name of the filesystem, as would be used in the
.Ar type
parameter to
.Xr mount 2
and the
.Fl t
option to
.Xr mount 8
.It Refs
the number of references to this VFS; i.e., the number of currently
mounted filesystems of this type
.It Flags
flag bits
.El
.Sh SEE ALSO
.Xr mount 2 ,
.Xr mount 8
.Sh HISTORY
The command from which this was derived from, as well as this manual,
originally appeared in
.Fx 2.0 .
