MacOSX10.14.sdk/usr/share/man/man1/remotemanagementd.1
.Dd October 12, 2017
.Os macOS
.Dt remotemanagementd 1
.Sh NAME
.Nm remotemanagementd
.Nd MDM Version 2 protocol daemon
.Sh SYNOPSIS
.Nm
.Sh DESCRIPTION
.Nm
handles HTTP communication with an Mobile Device Management (MDM) Version 2 server, delivering configuration information to the local Device Management daemon (dmd), and sending status messages back to the server.
.Sh FILES
.Pa /System/Library/LaunchDaemons/com.apple.remotemanagementd.plist
.Sh DIAGNOSTICS
Logging can be viewed via:
.Pp .\" blank line
log stream --predicate 'subsystem == "com.apple.remotemanagementd"'
.\" .Sh STANDARDS <-- Link to public spec when available
