MacOSX11.3.sdk/usr/share/man/man5/autofs.conf.5
.Dd March 27, 2007
.Dt AUTOFS.CONF 5
.Os Darwin
.Sh NAME
.Nm autofs.conf
.Nd
.Xr automount 8
and
.Xr automountd 8
configuration file
.Sh DESCRIPTION
The
.Nm
file specifies various configuration options for
.Xr automount 8
and
.Xr automountd 8 .
.Pp
.Nm
consists of a series of lines, each of which may contain a
line that sets a parameter, a comment, or a blank line.
.Pp
A line that sets a parameter has the format:
.D1 Va parameter Ns = Ns Va value
A
.Dq #
is the comment character, and all characters from it to the end of
line are ignored.
.Pp
The parameters that are supported are:
.Bl -tag
.It Dv AUTOMOUNT_TIMEOUT
The number of seconds after which an automounted file system will be
unmounted if it hasn't been referred to within that period of time.  The
default is 10 minutes (600 seconds).
This is equivalent to the
.Fl t
option in
.Xr automount 8 .
.It Dv AUTOMOUNT_VERBOSE
.Li TRUE
or
.Li FALSE ;
if
.Li TRUE ,
.Xr automount 8
will print more detailed information about the actions it takes.
This is equivalent to the
.Fl v
option to
.Xr automount 8 .
.It Dv AUTOMOUNTD_VERBOSE
.Li TRUE
or
.Li FALSE ;
if
.Li TRUE ,
.Xr automountd 8
will log to
.Xr syslogd 8
more detailed information about the actions it takes.
This is equivalent to the
.Fl v
option to
.Xr automountd 8 .
.It Dv AUTOMOUNTD_NOBROWSE
.Li TRUE
or
.Li FALSE ;
if
.Li TRUE ,
.Xr automountd 8
will disable browsing of all maps.
This is equivalent to the
.Fl n
option to
.Xr automountd 8 .
.It Dv AUTOMOUNTD_TRACE
The trace level for logging information about requests received by
.Xr automountd 8
from autofs, processing done for those requests, and replies sent to
autofs.
The default level of
.Li 0
causes no information to be logged; each higher value causes more
information to be logged.
This controls the same trace level that the
.Fl T
option to
.Xr automountd 8
controls.
The trace is logged to /var/log/system.log
.It Dv AUTOMOUNTD_MNTOPTS
A string containing a comma-separated list of mount options
that will be applied, by default, to all mounts done by
.Xr automountd 8 .
The options for a particular mount can override these options.
This controls the same options that the
.Fl o
option to
.Xr automountd 8
.It Dv AUTOMOUNTD_NOSUID
.Li TRUE
or
.Li FALSE ;
if
.Li TRUE ,
.Xr automountd 8
will force all mounts to have the "nosuid" mount option set.
.It Dv AUTOMOUNTD_ENV
A string of the form
.D1 Va name Ns = Ns Va value
that causes the environment variable
.Va name
to be set to the value
.Va value
in
.Xr automountd 8 .
Environment variables can be referred to in map entries; the value of
the environment variable is substituted for the reference to the
variable.
This is equivalent to the
.Fl D
option to
.Xr automountd 8 .
.El
.Sh FILES
.Bl -tag -width /etc/autofs.conf -compact
.It Pa /etc/autofs.conf
This file.
.El
.Sh SEE ALSO
.Xr auto_master 5 ,
.Xr automount 8 ,
.Xr automountd 8
