MacOSX10.9.sdk/usr/share/man/man7/hier.7
.\"	$NetBSD: hier.7,v 1.7 1994/11/30 19:07:10 jtc Exp $
.\"
.\" Copyright (c) 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)hier.7	8.1 (Berkeley) 6/5/93
.\"
.Dd July 23, 2007
.Dt HIER 7
.Os
.Sh NAME
.Nm hier
.Nd layout of filesystems
.Sh DESCRIPTION
A historical sketch of the filesystem hierarchy.
The modern OS X filesystem is documented in the
.Dq File System Programming Guide
available on Apple Developer.
.Bl -tag -width "/mach_kernel"
.It Li /
root directory of the filesystem
.It Li /bin/
user utilities fundamental to both single-user and multi-user environments
.It Li /dev/
block and character device files
.Pp
.Bl -tag -width "fd/" -compact
.It Li fd/ 
file descriptor files;
see
.Xr \&fd 4
.El
.It Li /etc/
system configuration files and scripts 
.It Li /mach_kernel
kernel executable (the operating system loaded into memory
at boot time).
.It Li /sbin/
system programs and administration utilities
fundamental to both single-user and multi-user environments
.It Li /tmp/ 
temporary files
.It Li /usr/
contains the majority of user utilities and applications 
.Pp
.Bl -tag -width "libexec/" -compact
.It Li bin/
common utilities, programming tools, and applications
.It Li include/
standard C include files
.Pp
.Bl -tag -width "protocols/" -compact
.It Li arpa/
C include files for Internet service protocols
.It Li hfs/
C include files for HFS
.It Li machine/
machine specific C include files
.It Li net/
misc network C include files
.It Li netinet/
C include files for Internet standard protocols;
see
.Xr inet 4
.It Li nfs/
C include files for NFS (Network File System)
.It Li objc/
C include files for Objective-C
.It Li protocols/
C include files for Berkeley service protocols
.It Li sys/
system C include files (kernel data structures)
.It Li ufs/
C include files for UFS
.El
.Pp
.It Li lib/
archive libraries
.It Li libexec/
system daemons & system utilities (executed by other programs)
.It Li local/
executables, libraries, etc. not included by the basic operating system
.It Li sbin/
system daemons & system utilities (executed by users)
.It Li share/
architecture-independent data files
.Pp
.Bl -tag -width "calendar/" -compact
.It Li calendar/
a variety of pre-fab calendar files;
see
.Xr calendar 1
.It Li dict/
word lists;
see
.Xr look 1
.Pp
.Bl -tag -width Fl -compact
.It Li web2
words from Webster's 2nd International
.It Li words
common words
.El
.Pp
.It Li man/
manual pages 
.It Li misc/
misc system-wide ascii text files
.It Li mk/
templates for make;
see
.Xr make 1
.It Li skel/
example . (dot) files for new accounts
.It Li tabset/
tab description files for a variety of terminals; used in 
the termcap file;
see
.Xr termcap 5
.It Li zoneinfo/
timezone configuration information;
see
.Xr tzfile 5
.El
.El
.It Li /var/
multi-purpose log, temporary, transient, and spool files
.Pp
.Bl -tag -width "preserve/" -compact
.It Li at/
timed command scheduling files;
see
.Xr \&at 1
.It Li backups/
misc. backup files
.It Li db/ 
misc. automatically generated system-specific database files
.It Li log/ 
misc. system log files
.Pp
.It Li mail/ 
user mailbox files
.It Li run/
system information files describing various info about
system since it was booted
.Pp
.Bl -tag -width Fl -compact
.It Li utmpx
database of current users;
see
.Xr utmpx 5
.El
.Pp
.It Li rwho/ 
rwho data files;
see
.Xr rwhod 8 ,
.Xr rwho 1 ,
and
.Xr ruptime 1
.It Li spool/ 
misc. printer and mail system spooling directories
.Pp
.Bl -tag -width Fl -compact
.It Li mqueue/ 
undelivered mail queue;
see
.Xr sendmail 8
.El
.Pp
.It Li tmp/ 
temporary files that are kept between system reboots
.It Li folders/
per-user temporary files and caches
.El
.El
.Sh SEE ALSO
.Xr \&ls 1 ,
.Xr apropos 1 ,
.Xr whatis 1 ,
.Xr whereis 1 ,
.Xr finger 1 ,
.Xr which 1 ,
.Xr find 1 ,
.Xr grep 1  ,
.Xr fsck 8 
.Sh HISTORY
A
.Nm hier
manual page appeared in
.At v7 .
