MacOSX10.10.sdk/usr/share/man/man5/launchd.conf.5
.Dd 25 November, 2013
.Dt launchd.conf 5
.Os Darwin
.Sh NAME
.Nm launchd.conf
.Nd launchd configuration file
.Sh SYNOPSIS
.Nm $HOME/.launchd.conf
.Nm /etc/launchd.conf
.Sh DESCRIPTION
.Nm 
contains a list of subcommands
.Ar ( load ,
.Ar unload ,
etc.) to run via
.Xr launchctl 1
when
.Xr launchd 8
starts. The
.Nm $HOME/.launchd.conf
file was never implemented and will not be implemented.
.Nm launchd.conf
is no longer respected by the system.
.Sh FILES
.Bl -tag -width "$HOME/.launchd.conf" -compact
.It Pa $HOME/.launchd.conf
The configuration file for a user.
.It Pa /etc/launchd.conf
The system's launchd configuration file.
.El
.Sh SEE ALSO 
.Xr launchctl 1 ,
.Xr launchd 8 ,
.Xr launchd.plist 5
