MacOSX11.3.sdk/usr/share/man/man8/httpd-wrapper.8
.\"" Copyright (c) 2017, 2019 Apple Inc. All Rights Reserved.
.\""
.\"" IMPORTANT NOTE: This file is licensed only for use on Apple-branded
.\"" computers and is subject to the terms and conditions of the Apple Software
.\"" License Agreement accompanying the package this file is a part of.
.\"" You may not port this file to another platform without Apple's written consent.
.\""
.Dd Sept. 20, 2016
.Dt httpd-wrapper 8
.Os "macOS"
.Sh NAME
.Nm httpd-wrapper
.Nd Wrapper script for httpd web server
.Sh DESCRIPTION
This tool extracts environment variable definitions from a specific plist file and then
execs the httpd executable, thereby allowing variables to be used in Apache's paramaterized 
config files. It also gathers minimal metrics on the usage of Apache.
.Sh FILES
.Bl -tag -width indent
.It Pa /etc/apache2/env.plist
The file where environment variables are defined
.It Pa /var/log/apache2/httpd-wrapper.log
The file where errors are logged
.El
.Sh SEE ALSO
.Xr httpd 8
