MacOSX11.3.sdk/usr/share/man/man8/mount_apfs.8
.\" Copyright (c) 2015 Apple Computer, Inc. All rights reserved.
.\" 
.\" The contents of this file constitute Original Code as defined in and
.\" are subject to the Apple Public Source License Version 1.1 (the
.\" "License").  You may not use this file except in compliance with the
.\" License.  Please obtain a copy of the License at
.\" http://www.apple.com/publicsource and read it before using this file.
.\" 
.\" This Original Code and all software distributed under the License are
.\" distributed on an "AS IS" basis, WITHOUT WARRANTY OF ANY KIND, EITHER
.\" EXPRESS OR IMPLIED, AND APPLE HEREBY DISCLAIMS ALL SUCH WARRANTIES,
.\" INCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY,
.\" FITNESS FOR A PARTICULAR PURPOSE OR NON-INFRINGEMENT.  Please see the
.\" License for the specific language governing rights and limitations
.\" under the License.
.\" 
.\"     @(#)mount_apfs.8
.hlm 0
.Dd September 16, 2015
.Dt MOUNT_APFS 8
.Os "Mac OS X"
.Sh NAME
.Nm mount_apfs
.Nd mount an
.Tn APFS
volume
.Sh SYNOPSIS
.Nm
.Op Fl o Ar options
.Op Fl u Ar user
.Op Fl g Ar group
.Ar special
.Ar directory
.Nm
.Op Fl o Ar options
.Fl s Ar snapshot
.Ar pathname
.Ar directory
.Sh DESCRIPTION
The
.Nm
command attaches the
.Tn APFS
volume indicated by the device
.Pa special
to the global file system namespace at the location indicated by
.Pa directory .
This command is normally executed by
.Xr diskarbitrationd 8
or
.Xr mount 8
at boot time.
.Pp
The
.Ar special
parameter should be the path to an
.Tn APFS
pseudo disk device node, such as
.Pa /dev/disk0s2s1
.Pq which is a volume inside the container Pa /dev/disk0s2 ,
which can also be specified as simply
.Pa disk0s2s1 .
.Pp
The options are as follows:
.Bl -tag -width 12n
.It Fl o Ar options
Options passed to 
.Xr mount 2
are specified with the 
.Fl o 
option followed by a comma separated string of options.
See the
.Xr mount 8 
man page for possible options and their meanings.
All listed options are
currently supported except for the ``force, sync and [no]async'' options.
.It Fl u Ar user
Set the owner of the files in the file system to
.Pa user .
The default owner is the owner of the directory on which
the file system is being mounted.
The
.Pa user
may be a user-name, or a numeric value.
.It Fl g Ar group
Set the group of the files in the file system to
.Pa group .
The default group is the group of the directory on which
the file system is being mounted.
The
.Pa group
may be a group-name, or a numeric value.
.It Fl s Ar snapshot
The name of the snapshot to mount.
In this usage
.Pa pathname
is the mounted root directory of the base volume containing the snapshot.
.El
.Sh EXIT STATUS
.Ex -std
.Sh SEE ALSO
.Xr mount 2 ,
.Xr unmount 2 ,
.Xr fstab 5 ,
.Xr mount 8 ,
.Xr umount 8
.Sh HISTORY
The
.Nm
utility first appeared in OS X 10.12.
