MacOSX11.3.sdk/usr/share/man/man8/netbiosd.8
.\"
.\" Copyright 2009 Apple, Inc. All rights reserved.
.\"
.\" The following requests are required for all man pages.
.Dd Wed Nov  4 20:34:39 PST 2009
.Dt netbiosd 8
.Os Darwin
.Sh NAME
.Nm netbiosd
.Nd NetBIOS protocol daemon
.Sh SYNOPSIS
.Nm
.Op Cm options
.Sh DESCRIPTION
.Nm
is responsible for interacting with NetBIOS networks.
.Nm
registers and defends one or more NetBIOS name, depending on the
set of configured services. It also browses and scavenges names
from the NetBIOS network, making them available to the system through
.Nm mDNSResponder.
.Sh OPTIONS
.Bl -tag -width -indent  \" Differs from above in tag removed
.It Fl debug
The service will log extensive debug information and may perform extra
diagnostic checks. This option is typically only useful for debugging.
.It Fl dump-packets
Pretty-print all sent and received NetBIOS packets to the output log. This
option is typically only useful for debugging.
.It Fl help
Prints a usage message and exits.
.It Fl max-refresh
Maximum time (in seconds) between searches to refresh the workgroup list.
.It Fl min-refresh
Minimum time (in seconds) between searches to refresh the workgroup list.
.It Fl stdout
Causes
.Nm
to print log messages to standard output instead of the system log.
.El
.\" The following requests should be uncommented and used where appropriate.
.\" This next request is for sections 2 and 3 function return values only.
.\" .Sh RETURN VALUES
.\" This next request is for sections 1, 6, 7 & 8 only
.\" .Sh ENVIRONMENT
.Sh FILES
.Bl -tag -width -indent
.It Pa /Library/Preferences/SystemConfiguration/com.apple.smb.server.plist
The primary configuration for the SMB stack. This file is updated by various
system services and should not be edited by hand.
.It Pa /System/Library/LaunchDaemons/com.apple.netbiosd.plist
The
.Nm
service's property list file for
.Xr launchd 8 .
.El
.Sh SIGNALS
.Bl -tag -width SIGTERM
.It Dv SIGHUP
This signal causes
.Nm
to reconfigure. It will first unregister any NetBIOS names it has registered.
Then it will determine its new set of NetBIOS names and register those.
.It Dv SIGUSR1
This signal causes
.Nm
to toggle debug logging.
.El
.\" .Sh EXAMPLES
.\" This next request is for sections 1, 6, 7 & 8 only
.\"     (command return values (to shell) and fprintf/stderr type diagnostics)
.\" .Sh DIAGNOSTICS
.\" The next request is for sections 2 and 3 error and signal handling only.
.\" .Sh ERRORS
.Sh SEE ALSO
.Xr launchd 8 ,
.Xr mDNSResponder 8
.Sh STANDARDS
The TCP/UDP embodiment of the NetBIOS protocol is documented in
.Bl -tag -width -indent  \" Differs from above in tag removed
.It Em RFC 1002
Protocol standard for a NetBIOS service on a TCP/UDP: Detailed Specifications, 1987
.It Em RFC 1001
Protocol standard for a NetBIOS service on a TCP/UDP: Concepts and Methods, 1987
.El
.Pp
The NetBIOS browsing protocol is documented as part of the Microsoft
Work Group Server Protocol Program (WSPP) technical documentation
set, specifically
.Bl -tag -width -indent  \" Differs from above in tag removed
.It Em MS-BRWS
Common Internet File System (CIFS) Browser Protocol Specification
.El
.Sh HISTORY
The
.Nm
utility first appeared in Mac OS 10.7.
.\" .Sh AUTHORS
.\" .Sh BUGS
