MacOSX11.3.sdk/usr/share/man/man8/reboot.8
.\" Copyright (c) 1990, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)reboot.8	8.1 (Berkeley) 6/9/93
.\" $FreeBSD: src/sbin/reboot/reboot.8,v 1.21 2002/12/27 12:15:33 schweikh Exp $
.\"
.Dd June 9, 1993
.Dt REBOOT 8
.Os
.Sh NAME
.Nm halt ,
.Nm reboot
.Nd stopping and restarting the system
.Sh SYNOPSIS
.Nm halt
.Op Fl lnqu
.Nm reboot
.Op Fl lnq
.Sh DESCRIPTION
The
.Nm halt
and
.Nm reboot
utilities flush the file system cache to disk,
send all running processes a
.Dv SIGTERM
(and subsequently a
.Dv SIGKILL )
and, respectively, halt or restart the system.
The action is logged, including entering a shutdown record into the
.Xr wtmp 5
file.
.Pp
When the system is halted with the halt command, the system is powered off.
.Pp
The options are as follows:
.Bl -tag -width indent
.It Fl l
The halt or reboot is
.Em not
recorded in the system log.
This option is intended for applications such as
.Xr shutdown 8 ,
that call
.Nm reboot
or
.Nm halt
and log this themselves.
.It Fl n
The file system cache is not flushed.
This option should probably not be used.
.It Fl q
The system is halted or restarted quickly and ungracefully, and only
the flushing of the file system cache is performed (if the
.Fl n
option is not specified).
This option should probably not be used.
.It Fl u
The system is halted up until the point of removing system power, but waits 
before removing power for 5 minutes so that an external UPS 
(uninterruptible power supply) can forcibly remove power. 
This simulates a dirty shutdown to permit a later automatic power on. OS X uses
this mode automatically with supported UPSs in emergency shutdowns.
.El
.Pp
Normally, the
.Xr shutdown 8
utility is used when the system needs to be halted or restarted, giving
users advance warning of their impending doom and cleanly terminating
specific programs.
.Sh SIGTERM TO SIGKILL INTERVAL
The
.Dv SIGKILL
will follow the
.Dv SIGTERM
by an intentionally indeterminate period of time.
Programs are expected to take only enough time to flush all dirty data and exit.
Developers are encouraged to file a bug with the OS vendor, should they encounter an issue with this functionality.
.Sh SEE ALSO
.Xr wtmp 5 ,
.Xr shutdown 8 ,
.Xr sync 8
.Sh HISTORY
A
.Nm reboot
utility appeared in
.At v6 .
