MacOSX11.3.sdk/usr/share/man/man8/softwareupdate.8
.Dd September 11, 2012 
.Dt softwareupdate 8 
.Os Mac OS X
.\"																				NAME 
.Sh NAME
.Nm softwareupdate
.Nd system software update tool
.\"																				SYNOPSIS
.Sh SYNOPSIS
.Nm
.Ar command
.Op Ar args ...
.\"																				DESCRIPTION
.Sh DESCRIPTION
Software Update checks for new and updated versions of your software based on information about your computer and current software.
.Pp
Invoke
.Nm
by specifying a
.Ar command
followed by zero or more
.Ar args .
.Pp
.Nm
requires admin authentication for all commands except
.Cm --list .
If you run
.Nm
as a normal admin user, you will be prompted for a password where required. Alternatively, you can run
.Nm
as root and avoid all further authentication prompts.
.Pp
The following
.Ar commands
are available:
.Bl -tag -width Fl
.It Fl l | -list
List all available updates.
.It Fl i | -install
Each update specified by
.Ar args
is downloaded and installed.
.Ar args
can be one of the following:
.Bl -tag -width Fl
.It Ar -r | --recommended
All updates that are recommended for your system. These are prefixed with a
.Em *
character in the
.Cm --list
output.
.It Ar -R | --restart
Automatically restart (or shut down) if required to complete installation. If the user invoking this tool is logged in then macOS will attempt to quit all applications, logout, and restart. If the user is not logged in, macOS will trigger a forced reboot if necessary. If you wish to always perform a forced reboot, pass -f (--force).
.It Ar -a | --all
All updates that are applicable to your system, including those non-recommended ones,
which are prefixed with a 
.Em -
character in the
.Cm --list
output. (Non-recommended updates are uncommon in any case.)
.It Ar item ...
One or more specified updates. The 
.Cm --list
output shows the item names you can specify here, prefixed by the
.Em *
or
.Em -
characters. See
.Sx EXAMPLES .
.El                      \" Ends the list
.It Fl d | -download
Each update specified by
.Ar args
is downloaded but not installed. The values of 
.Ar args
are the same as for the 
.Cm --install
command. Updates downloaded with 
.Cm --download
can be subsequently installed with
.Cm --install ,
or through the App Store (as long as they remain applicable to your system).
Updates are downloaded to 
.Pa /Library/Updates ,
but are not designed to be installed by double-clicking the packages in that
directory: always use
.Cm --install
or the App Store to actually perform the install.
.It Fl -schedule
Returns the per-machine automatic (background) check preference.
.It Fl h | -help
Print command usage.
.El                      \" Ends the list
.\"																				EXAMPLES
.Sh EXAMPLES          \" Section Header - required - don't modify
The following examples are shown as given to the shell:
.Bl -tag -width indent
.It Li "softwareupdate --list"       \" Each item preceded by .It macro
.El                      \" Ends the list
.Bd -literal -offset indent \" Begin a literal code section
Software Update Tool

Finding available software
Software Update found the following new or updated software:
   * Label: MacBookAirEFIUpdate2.4-2.4
        Title: MacBook Air EFI Firmware Update, Version: 2.4, Size: 3817K, Recommended: YES, Action: restart,
   * Label: ProAppsQTCodecs-1.0
        Title: ProApps QuickTime codecs, Version: 1.0, Size: 968K, Recommended: YES,
   * Label: JavaForOSX-1.0
        Title: Java for OS X 2012-005, Version: 1.0, Size: 65288K, Recommended: YES,
.Ed                      \" End literal code section
.Bl -tag -width -indent  \" Begins a tagged list 
.It Li "sudo softwareupdate --install JavaForOSX-1.0"
.El                      \" Ends the list
.Bd -literal -offset indent \" Begin a literal code section
Software Update Tool

Finding available software

Downloading Java for OS X 2012-005
Downloaded Java for OS X 2012-005
Installing Java for OS X 2012-005
Done with Java for OS X 2012-005
Done.
.Ed                      \" End literal code section
.Bl -tag -width -indent  \" Begins a tagged list 
.It Li "sudo softwareupdate --schedule"
.El                      \" Ends the list
.Bd -literal -offset indent \" Begin a literal code section
Automatic check is on
.Ed                      \" End literal code section
