MacOSX11.3.sdk/usr/share/man/man8/SubmitDiagInfo.8
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.\"See Also:
.\"man mdoc.samples for a complete listing of options
.\"man mdoc for the short list of editing options
.\"/usr/share/misc/mdoc.template
.Dd 1/11/07               \" DATE 
.Dt SubmitDiagInfo 8      \" Program name and manual section number 
.Os Mac OS X
.Sh NAME                 \" Section Header - required - don't modify 
.Nm SubmitDiagInfo
.\" The following lines are read in generating the apropos(man -k) database. Use only key
.\" words here as the database is built based on the words here and in the .ND line. 
.\" Use .Nm macro to designate other names for the documented program.
.Nd sends diagnostic information to Apple
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Sh DESCRIPTION          \" Section Header - required - don't modify
.Nm 
is a system process which runs periodically.
If the user has opted-in for automatic reporting of diagnostic and usage information, then
.Nm
collects and sends to Apple any recent diagnostic information which has not yet been sent to Apple. 
.Nm
also cleans up any diagnostic and usage information which was created more than one month ago and is no longer needed.
.Pp
Sending diagnostic and usage reports to Apple helps us improve the quality and performance of our products and services. 
It helps Apple identify common usage trends and issues that enable us to allocate our resources efficiently, 
and it helps us provide better support services to you and other customers. 
All of the diagnostic and usage information is collected anonymously from your computer in a way that does not personally identify you.  Reports may include the following information:
.Pp
.Bl -dash -compact
.It
Details about application or system crashes, freezes, or kernel panics.
.It
Information about events on your computer (e.g. whether a certain function, such as waking your computer was successful or not).
.It
Usage information (e.g. data about how Apple and third party software, hardware and services are being used).
.El
.Pp
Automatic reporting of diagnostic information is off by default and no information is sent 
to Apple unless a user has opted-in to automatic collection of diagnostic information.
A user is offered the opportunity to opt-in for automatic collection of additional 
diagnostic and usage information after the user has manually sent a crash, hang or panic report to Apple. 
Users may at any time opt in or out of automatic reporting in the Security & Privacy pane of the 
System Preferences application under the "Privacy" tab.
.Pp
All diagnostic and usage information which is eligible for automatic reporting is visible in the Console 
application under the "DIAGNOSTIC AND USAGE INFORMATION" heading in the application's sidebar.
(The information appears here even if a user has not yet opted-in for automatic reporting.)
For security purposes, some system diagnostic information will only be visible to admin users 
and will only be submitted when an admin user is logged in.
.Pp
Users who need technical support should use http://www.apple.com/support or other authorized support channels.  
Developers who are ADC members should submit bug reports using http://bugreporter.apple.com 
in order to allow for two way communication between Apple and the bug reporter.
.Pp
.\" .Sh ENVIRONMENT      \" May not be needed
.\" .Bl -tag -width "ENV_VAR_1" -indent \" ENV_VAR_1 is width of the string ENV_VAR_1
.\" .It Ev ENV_VAR_1
.\" Description of ENV_VAR_1
.\" .It Ev ENV_VAR_2
.\" Description of ENV_VAR_2
.\" .El                      
.\" .Sh DIAGNOSTICS       \" May not be needed
.\" .Bl -diag
.\" .It Diagnostic Tag
.\" Diagnostic informtion here.
.\" .It Diagnostic Tag
.\" Diagnostic informtion here.
.\" .El
.Sh SEE ALSO 
.\" List links in ascending order by section, alphabetically within a section.
.\" Please do not reference files that do not exist without filing a bug report
.Xr ReportCrash 8 
.Xr DumpPanic 8
.Xr diagnostics_agent 8
.\" .Sh BUGS              \" Document known, unremedied bugs 
.\" .Sh HISTORY           \" Document history if command behaves in a unique manner
