MacOSX11.3.sdk/usr/share/man/man8/timed.8
.Dd January 26, 2016
.Dt TIMED 8
.Os Darwin
.Sh NAME
.Nm timed
.Nd time synchronization daemon
.Sh SYNOPSIS
.Nm
takes no arguments, and users should not launch it manually.
.Sh DESCRIPTION
.Nm
maintains system clock accuracy by synchronizing the clock with reference clocks via technologies like NTP.
Inputs are merged inside of
.Nm , where it calculates uncertainty to facilitate scheduling proactive time jobs.
.Nm
is also aware of power/battery conditions.
.Sh FILES
.Bl -tag -width "/etc/ntp.con"
.It Pa /etc/ntp.conf
NTP server configuration.
.It Pa /var/db/timed/com.apple.timed.plist
The cached state of
.Nm
.
.It Pa /System/Library/LaunchDaemons/com.apple.timed.plist
The
.Nm 
service's property list file for launchd(8).
.El
.Sh SEE ALSO
.Xr date 1 ,
.Xr settimeofday 2 ,
.Xr adjtime 2 ,
.Xr gettimeofday 2 ,
.Xr launchd 8
.Sh HISTORY
This
.Nm
first appeared in Mac OS X 10.13 and iOS 5.0.
.\" .Sh BUGS
.\" There are none, it's perfect.
