MacOSX10.12.sdk/usr/share/man/man8/apfs.util.8
.\" Copyright (c) 2015 Apple Computer, Inc. All rights reserved.
.\" 
.\" The contents of this file constitute Original Code as defined in and
.\" are subject to the Apple Public Source License Version 1.1 (the
.\" "License").  You may not use this file except in compliance with the
.\" License.  Please obtain a copy of the License at
.\" http://www.apple.com/publicsource and read it before using this file.
.\" 
.\" This Original Code and all software distributed under the License are
.\" distributed on an "AS IS" basis, WITHOUT WARRANTY OF ANY KIND, EITHER
.\" EXPRESS OR IMPLIED, AND APPLE HEREBY DISCLAIMS ALL SUCH WARRANTIES,
.\" INCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY,
.\" FITNESS FOR A PARTICULAR PURPOSE OR NON-INFRINGEMENT.  Please see the
.\" License for the specific language governing rights and limitations
.\" under the License.
.\" 
.\"     @(#)apfs.util.8
.Dd June 1, 2015
.Dt APFS.UTIL 8
.Os "Mac OS X"
.Sh NAME
.Nm apfs.util
.Nd APFS file system utility
.Sh SYNOPSIS
.Nm
.Fl p Ar device removable writable
.Nm
.Fl k Ar device
.Nm
.Fl s Ar device
.Sh DESCRIPTION
The
.Nm
command supports the probing of apfs volumes, getting a
volume UUID and setting container and volume UUIDs.
.Pp
Options:
.Bl -tag -width indent
.It Fl p Ar device removable writable
Probe the
.Ar device
to determine whether it contains an apfs volume. The
.Ar removable
and
.Ar writable
arguments are ignored for compatibility with other file system utilities.
.It Fl k
Return the UUID of the apfs volume on
.Ar device .
.It Fl s
Set UUIDs for the container and the volume(s) on the
.Ar device
to new random values.
.El
.Sh SEE ALSO
.Xr diskarbitrationd 8
.Sh HISTORY
The
.Nm
utility first appeared in OS X 10.12.
