MacOSX10.12.sdk/usr/share/man/man8/app_sandbox_cache_builder.8
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.\"See Also:
.\"man mdoc.samples for a complete listing of options
.\"man mdoc for the short list of editing options
.\"/usr/share/misc/mdoc.template
.Dd 12/10/13               \" DATE 
.Dt app_sandbox_cache_builder 8      \" Program name and manual section number
.Os Darwin
.Sh NAME                 \" Section Header - required - don't modify 
.Nm app_sandbox_cache_builder
.\" The following lines are read in generating the apropos(man -k) database. Use only key
.\" words here as the database is built based on the words here and in the .ND line. 
.\" Use .Nm macro to designate other names for the documented program.
.Nd Application Sandbox cache builder
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Sh DESCRIPTION          \" Section Header - required - don't modify
.Nm
creates a cache file for the Application Sandboxing subsystem.
.Pp                      \" Inserts a space
This command is not intended to be invoked directly.
.Sh SEE ALSO
.Xr asctl 1
.Xr sandbox 7
.Sh FILES                \" File used or created by the topic of the man page
.Pa /System/Library/Caches/com.apple.app-sandbox-cache.plist
The cache file.