MacOSX10.12.sdk/usr/share/man/man8/emlog.pl.8
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.\"See Also:
.\"man mdoc.samples for a complete listing of options
.\"man mdoc for the short list of editing options
.\"/usr/share/misc/mdoc.template
.\" test using groff -man emscrape.pl.8 -T ascii | more
.Dd 09/01/06               \" DATE 
.Dt emlog 8      \" Program name and manual section number 
.Os Darwin
.Sh NAME                 \" Section Header - required - don't modify 
.Nm emlog
.\" The following lines are read in generating the apropos(man -k) database. Use only key
.\" words here as the database is built based on the words here and in the .ND line. 
.Nd Event Monitor Log Scraper
.\" Use .Nm macro to designate other names for the documented program.
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Op Fl p Ar udp_port        \" [-p port] 
.Op Fl l
.Sh DESCRIPTION				\" Section Header - required - don't modify
.Nm
is a perl script that scans log messages either fed through stdin or via a local UDP port, looking for authentication failures and other security notices,
and feeding them as events to the 
.Ar Event Monitor
.Ar (emond)
.Pp                      \" Inserts a space
Options:
.Bl -tag -width -indent  \" Differs from above in tag removed 
.It Fl p Ar udp_port_number             
Tells
.Nm
to listen on the given local port number, processing the UDP packets as single lines in a way compatible with
.Ar syslogd
.
.It Fl l             
Tells
.Nm
to process a single line of text then quit.
.El
.Pp
.\" .Sh ENVIRONMENT      \" May not be needed
.\" .Bl -tag -width "ENV_VAR_1" -indent \" ENV_VAR_1 is width of the string ENV_VAR_1
.\" .It Ev ENV_VAR_1
.\" Description of ENV_VAR_1
.\" .It Ev ENV_VAR_2
.\" Description of ENV_VAR_2
.\" .El                      
.Sh FILES                \" File used or created by the topic of the man page
.Bl -tag -width "/Users/joeuser/Library/really_long_file_name" -compact
.It Pa /usr/libexec/emlog.pl
The executable
.It Pa /usr/libexec/xssendevent
Tool that sends events to
.Ar emond
.It Pa /System/Library/LaunchDaemons/com.apple.emlog.plist
the launchd config file
.El                      \" Ends the list
.\" .Sh DIAGNOSTICS       \" May not be needed
.\" .Bl -diag
.\" .It Diagnostic Tag
.\" Diagnostic informtion here.
.\" .It Diagnostic Tag
.\" Diagnostic informtion here.
.\" .El
.Sh SEE ALSO 
.\" List links in ascending order by section, alphabetically within a section.
.\" Please do not reference files that do not exist without filing a bug report
.Xr emond 8 ,
.Xr launchd 8 ,  
.Xr xssendevent 8  
.\" .Sh BUGS              \" Document known, unremedied bugs 
.\" .Sh HISTORY           \" Document history if command behaves in a unique manner