MacOSX10.12.sdk/usr/share/man/man8/fontrestore.8
.\""Copyright (c) 2009-2010 Apple, Inc. All Rights Reserved.
.Dd 2010-02-03
.Dt fontrestore 8  
.Os Mac OS X       
.Sh NAME
.Nm fontrestore
.Nd Restore the available system fonts to a pristine state, if possible.
.Sh SYNOPSIS
.Nm fontrestore
.Cm default
.Op -n
.Sh DESCRIPTION
.Nm
detects fonts in
.Pa /Library/Fonts ,
.Pa /System/Library/Fonts ,
and
.Pa ~/Library/Fonts
which are not part of the system install and moves them to
.Pa /Library/Fonts (Removed) ,
.Pa /System/Library/Fonts (Removed) ,
and
.Pa ~/Library/Fonts/Fonts (Removed)
directories. Critical fonts required for operation of the user interface are also restored.
.Pp
The
.Op -n
option performs the same operation without touching the disk, describing what would be done without actually doing it.
.Pp
.Sh SEE ALSO
.Xr fontd 8
.Sh HISTORY
The 
.Nm
tool first appeared in MacOS X 10.7.