MacOSX12.1.sdk/usr/share/man/man7/apple_ssh_and_fips.7
.\" Copyright (c) 2021 Apple Inc. All rights reserved.
.Dd 17 September, 2021
.Dt apple_ssh_and_fips 7
.Os Darwin
.
.Sh NAME
.Nm apple_ssh_and_fips
.Nd Configuring SSH for FIPS algorithms
.Sh DESCRIPTION
The macOS version of SSH uses Apple’s FIPS Cryptographic Modules for
FIPS 140-2 validated algorithms, automatically without the need for
installation, administration, or configuration.
To restrict the SSH client and server to use only FIPS algorithms,
customize the configuration of
.Xr ssh 1
and
.Xr sshd 8
as directed below.
.Pp
The default configuration files for
.Xr ssh 1
and
.Xr sshd 8
read additional configuration directives from the
.Pa /etc/ssh/ssh_config.d
and
.Pa /etc/ssh/sshd_config.d
directories, respectively. Create a file in each of these directories
that contain directives to limit the algorithms used.
.Pp
For
.Xr ssh 1 ,
create
.Pa /etc/ssh/ssh_config.d/fips_ssh_config
with the following directives:
.Bl -inset
.It Cm Host
*
.It Cm Ciphers
aes128-gcm@openssh.com
.It Cm HostbasedAcceptedAlgorithms
ecdsa-sha2-nistp256,ecdsa-sha2-nistp256-cert-v01@openssh.com
.It Cm HostKeyAlgorithms
ecdsa-sha2-nistp256,ecdsa-sha2-nistp256-cert-v01@openssh.com
.It Cm KexAlgorithms
ecdh-sha2-nistp256
.It Cm MACs
hmac-sha2-256
.It Cm PubkeyAcceptedAlgorithms
ecdsa-sha2-nistp256,ecdsa-sha2-nistp256-cert-v01@openssh.com
.It Cm CASignatureAlgorithms
ecdsa-sha2-nistp256
.El
.Pp
For
.Xr sshd 8 ,
create
.Pa /etc/ssh/sshd_config.d/fips_sshd_config
with the following directives:
.Pp
.Bl -inset
.It Cm Ciphers
aes128-gcm@openssh.com
.It Cm HostbasedAcceptedAlgorithms
ecdsa-sha2-nistp256,ecdsa-sha2-nistp256-cert-v01@openssh.com
.It Cm HostKeyAlgorithms
ecdsa-sha2-nistp256,ecdsa-sha2-nistp256-cert-v01@openssh.com
.It Cm KexAlgorithms
ecdh-sha2-nistp256
.It Cm MACs
hmac-sha2-256
.It Cm PubkeyAcceptedAlgorithms
ecdsa-sha2-nistp256,ecdsa-sha2-nistp256-cert-v01@openssh.com
.It Cm CASignatureAlgorithms
ecdsa-sha2-nistp256
.El
.
.Sh SEE ALSO
.Xr ssh 1 ,
.Xr sshd 8
