MacOSX26.2.sdk/usr/share/man/man1/audiomxd.1
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.\"See Also:
.\"man mdoc.samples for a complete listing of options
.\"man mdoc for the short list of editing options
.\"/usr/share/misc/mdoc.template
.Dd Thu Oct 20 2022               \" DATE 
.Dt audiomxd 1      \" Program name and manual section number 
.Os Darwin
.Sh NAME                 \" Section Header - required - don't modify 
.Nm audiomxd
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Sh DESCRIPTION          \" Section Header - required - don't modify
.Nm 
is a daemon that manages audio route arbitration on macOS along with other nearby Apple devices such as iPhones and iPads.
.Nm 
was introduced with macOS version 14.0.