MacOSX26.2.sdk/usr/share/man/man1/bkctl.1
.Dd 20 April, 2016
.Dt bkctl 1
.Os Darwin
.Sh NAME
.Nm bkctl
.Nd Uses BookKit.framework to manage the iBooks book library
.Sh SYNOPSIS
.Nm
.Op Ar subcommand Op Ar arguments ...
.Sh DESCRIPTION
.Nm 
uses BookKit.framework to list, import, and remove books in the iBooks library.
.Nm
supports a number of subcommands on the command line.
.Sh SUBCOMMANDS
.Bl -tag -width -indent
.It Xo Ar list
.Xc
Lists the paths of all of the currently installed (uncompressed) {.epub, .ibooks, .pdf} books in the book library.
.Pp
.It Xo Ar rebuild
.Xc
Performs a consistency check of the book library. All books in Books.plist must exist as book files/directories. All books
in the Books directory must have an entry in Books.plist. All book files must be named <assetID>.{epub,ibooks,pdf}. This command
ensures that those requirements are maintained. This can be used to recover lost books.
.Pp
.It Xo Ar import
.Ar paths ...
.Xc
Imports one or more book files into the book library. The paths may point to individual books files, or to directories
containing book files, which will be recursively scanned for {.epub,.ibooks,.pdf} files.
.Pp
.It Xo Ar remove
.Ar paths ...
.Xc
Removes one or more book files from the book library. Paths must refer to books currently in the book library.
.It Ar shutdown
Shuts down the BookKit.framework XPC service. Use this when you need to update BookKit.framework from an installer or when
using
.Nm darwinup .
.El
.Sh DIRECTORIES & FILES
.Bl -tag -width "/System/Library/LaunchDaemons" -compact
.It Pa ~/Library/Application Support/iBooks/Books
Directory containing installed book files/directories.
.It Pa ~/Library/Application Support/iBooks/Books.plist
Binary property list file containing the known installed books.
.El
.Sh SEE ALSO 
.Xr darwinup 1
