MacOSX26.2.sdk/usr/share/man/man1/configureLocalKDC.1
.\" 
.\" Copyright (c) 2006-2007 Apple Inc. All rights reserved.
.\" 
.\" @APPLE_LICENSE_HEADER_START@
.\" 
.\" This file contains Original Code and/or Modifications of Original Code
.\" as defined in and that are subject to the Apple Public Source License
.\" Version 2.0 (the 'License'). You may not use this file except in
.\" compliance with the License. Please obtain a copy of the License at
.\" http://www.opensource.apple.com/apsl/ and read it before using this
.\" file.
.\" 
.\" The Original Code and all software distributed under the License are
.\" distributed on an 'AS IS' basis, WITHOUT WARRANTY OF ANY KIND, EITHER
.\" EXPRESS OR IMPLIED, AND APPLE HEREBY DISCLAIMS ALL SUCH WARRANTIES,
.\" INCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY,
.\" FITNESS FOR A PARTICULAR PURPOSE, QUIET ENJOYMENT OR NON-INFRINGEMENT.
.\" Please see the License for the specific language governing rights and
.\" limitations under the License.
.\" 
.\" @APPLE_LICENSE_HEADER_END@
.\" 
.Dd August 30, 2007
.Dt configureLocalKDC 1
.Os Darwin
.Sh NAME
.Nm configureLocalKDC
.Nd generate a LocalKDC
.Sh SYNOPSIS
.Nm
.Sh DESCRIPTION
.Nm
generates a LocalKDC and provisions LKDC service principals.
The script is non-destructive and can be run multiple times.
.Pp
.Sh FILES
.Nm
does not own, but references the following files:
.Pp
.br
/Library/Keychains/System.keychain
.br
/var/db/krb5kdc/kdc.conf
.br
/System/Library/LaunchDaemons/edu.mit.Kerberos.krb5kdc.plist
.br
/Library/Preferences/com.apple.AppleFileServer
.br
/Library/Preferences/SystemConfiguration/com.apple.smb.server
.Pp
.Sh SEE ALSO
.Xr systemkeychain 8 ,
.Xr certtool 1 ,
.Xr checkLocalKDC 1 ,
.Xr kdcsetup 1 ,
.Xr launchctl 1 ,
.Xr kadmin 8 ,
.Xr defaults 1
.Pp
.Sh HISTORY
.Nm
first appeared in version 10.5 of Mac OS X.
