MacOSX26.2.sdk/usr/share/man/man1/cryptexctl-install.1
.Dd April 2, 2021
.Dt CRYPTEXCTL-INSTALL 1
.Os Darwin
.Sh NAME
.Nm cryptexctl install
.Nd install a cryptex, either to the host or to a target device
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Fl -variant Ar VARIANT
.Oo
.Fl p | Fl -print-info
.Oc
.Ar CRYPTEX-DIRECTORY
.Sh DESCRIPTION          \" Section Header - required - don't modify
Install a cryptex, either to the host
.Pq if the host has a cryptex management daemon
or to a target device specified in the top level
.Xr cryptexctl 1
command.
.Sh OPTIONS
A list of options with descriptions:
.Pp
Required:
.Bl -tag -width -indend
.It Fl V | Fl -variant Ar VARIANT
The name of the cryptex
.It Ar CRYPTEX-DIRECTORY
The path to the cryptex bundle directory. The cryptex bundle directory is
the product of the
.Xr cryptexctl-personalize 1
subcommand and is expected to contain a personalized Image4 manifest. 
.El
.Pp
Optional:
.Bl -tag -width -indent
.It Op Fl p | Fl -print-info
Print information about the cryptex that was installed.
.El
.Sh ENVIRONMENT
.Bl -tag -width  CRYPTEXCTL_UDID
.It Ev CRYPTEXCTL_UDID
Read by the base
.Xr cryptexctl 1
command to select the device on which to operate when the
.Fl -udid
option is not specified and there is no
.Xr cryptexd 8
daemon on the host. See
.Xr cryptexctl 1
for more information about
.Ev CRYPTEXCTL_UDID .
.El
.Sh TROUBLESHOOTING
If an installation is failing you may wish to enable verbose logging. The
following will enable the most verbose logging from
.Nm :
.Pp
.Dl % cryptexctl -v9 -d9 -ldt install -V CryptexHTTP --print-info ./com.example.cryptex.cxbd.signed
.Pp
You may also want to see logging from the services involved in the cryptex
subsytem, the
.Xr cryptexctl-log 1
command is a quick way to get more information about a failing installation.
.Pp
.Dl % cryptexctl log stream
.Pp
In more extreme cases you might need to collect logging from the device.
If you have the
.Ev CRYPTEXCTL_UDID
environment variable set, you should use
.Qq sudo -E
to pass the environment variable through to
.Nm .
Otherwise you must specify the
.Fl -udid
option to
.Nm .
.Pp
.Dl % sudo -E cryptexctl log collect
.Dl % cryptexctl log show -- --archive ./system_logs.logarchive
.Pp
For more information about logging, see
.Xr cryptexctl-log 1
and
.Xr log 1 .
.Sh SEE ALSO
.\" List links in ascending order by section, alphabetically within a section.
.\" Please do not reference files that do not exist without filing a bug report
.Xr cryptexctl 1 ,
.Xr cryptexctl-create 1 ,
.Xr cryptexctl-personalize 1 ,
.Xr cryptexctl-log 1 ,
.Xr cryptexctl-uninstall 1 ,
.Xr log 1
.Sh HISTORY         \" Document history if command behaves uniquely
Introduced in macOS 11.0
