MacOSX26.2.sdk/usr/share/man/man1/pl.1
.\""Copyright (c) 2007-2011, Apple Inc. All Rights Reserved.
.Dd October 23, 2007
.Dt PL 1
.Os "Mac OS X"
.Sh NAME
.Nm pl
.Nd ASCII property list utility
.Sh SYNOPSIS
.Nm
.Op --input file
.Op --output file
.Sh DESCRIPTION
.Nm
can be used to check the syntax of old-style ASCII property list files.
.Pp
The options are:
.Bl -tag -width "-output file "
.It Fl -input Ar file 
Cause
.Nm 
to use the specified file as input. If the input option is not specified, stdin is used.
.It Fl -output Ar file
Cause
.Nm
to use the specified file as output. If the output option is not specified, stdout is used.
.El
.Pp
.Sh DIAGNOSTICS
The
.Nm
command exits 0 on success, and <0 on failure.
.Sh SEE ALSO 
.Xr plist 5
.Xr plutil 1
.Sh STANDARDS
The 
.Nm
command obeys no one's rules but its own.
.Sh HISTORY
The
.Nm
command first appeared in Mac OS X 10.5.
