MacOSX10.11.sdk/usr/share/man/man8/cd9660.util.8
.\""Copyright (c) 2001-2004 Apple Computer, Inc. All Rights Reserved.
.\"The contents of this file constitute Original Code as defined in and are 
.\"subject to the Apple Public Source License Version 1.2 (the 'License'). 
.\"You may not use this file except in compliance with the
.\"License. Please obtain a copy of the License at 
.\"http://www.apple.com/publicsource and read it before using this file.
.\"
.\"This Original Code and all software distributed under the License are 
.\"distributed on an 'AS IS' basis, WITHOUT WARRANTY OF ANY KIND, EITHER 
.\"EXPRESS OR IMPLIED, AND APPLE
.\"HEREBY DISCLAIMS ALL SUCH WARRANTIES, INCLUDING WITHOUT LIMITATION, ANY 
.\"WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE,
.\"QUIET ENJOYMENT OR NON-INFRINGEMENT. Please see the License for the 
.\"specific language governing rights and limitations under the License."
.Dd November 2, 2004
.Dt CD9660.UTIL 8 
.Os Darwin
.Sh NAME
.Nm cd9660.util
.Nd ISO 9660 file system utility
.Sh SYNOPSIS
.Nm
.Op Fl m Ar mountflag1 mountflag2 mountflag3 mountflag4
.Ar device node
.Pp
.Nm
.Op Fl p Ar mountflag1 mountflag2 mountflag3 mountflag4
.Ar device
.Pp
.Nm
.Op Fl u 
.Ar device
.Sh DESCRIPTION
The
.Nm
command supports the mounting, probing, and unmounting of ISO 9660 file systems.
.Pp
Options:
.Bl -tag
.It Fl m Ar mountflag1 mountflag2 mountflag3 mountflag4
mount
.It Fl p Ar mountflag1 mountflag2 mountflag3 mountflag4
probe for mounting
.It Fl u 
unmount
.El
.Pp
.Ar mountflags 
above are either:
.Bl -bullet
.It
.Ar removable 
or
.Ar fixed
.It
.Ar readonly
or
.Ar writeable  
.It
.Ar suid
or
.Ar nosuid  
.It
.Ar dev
or
.Ar nodev
.El
.Sh SEE ALSO 
.Xr diskarbitration 8
.Sh HISTORY
Derived from the Openstep Workspace Manager file system utility programs.
