MacOSX10.11.sdk/usr/share/man/man8/mount_ntfs.8
.\"Copyright (c) 2006-2008 Apple Inc. All Rights Reserved.
.\"
.\"This file contains Original Code and/or Modifications of Original Code as
.\"defined in and that are subject to the Apple Public Source License Version
.\"2.0 (the 'License'). You may not use this file except in compliance with the
.\"License.
.\"
.\"Please obtain a copy of the License at http://www.opensource.apple.com/apsl/
.\"and read it before using this file.
.\"
.\"The Original Code and all software distributed under the License are
.\"distributed on an 'AS IS' basis, WITHOUT WARRANTY OF ANY KIND, EITHER
.\"EXPRESS OR IMPLIED, AND APPLE HEREBY DISCLAIMS ALL SUCH WARRANTIES,
.\"INCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY, FITNESS FOR
.\"A PARTICULAR PURPOSE, QUIET ENJOYMENT OR NON-INFRINGEMENT. Please see the
.\"License for the specific language governing rights and limitations under the
.\"License.
.Dd September 12, 2008
.Dt MOUNT_NTFS 8
.Os "Mac OS X"
.Sh NAME
.Nm mount_ntfs
.Nd mount an NTFS file system
.Sh SYNOPSIS
.Nm
.Op Fl s
.Op Fl o Ar options
.Ar special 
.Ar node
.Sh DESCRIPTION
The
.Nm mount_ntfs
command attaches the NTFS file system residing on the device
.Pa special
to the global file system namespace at the location indicated by
.Pa node .
This command is normally executed by
.Xr mount 8
at boot time, but can be used by any user to mount an NTFS file system on any
directory that they own (provided, of course, that they have appropriate
access to the device that contains the file system).
.Pp
The options are as follows:
.Bl -tag -width indent
.It Fl s
Mount the volume using case sensitive semantics.  This means that you can create files that have names that only differ in case such as for example "foo" and "Foo".  Without this option the volume is mounted using case insensitive semantics in which case if you create a file with name "foo" you then cannot create a file named "Foo" or rather if you do create a file named "Foo" it would overwrite the existing file "foo".
.It Fl o
Options are specified with a
.Fl o
flag followed by a comma separated string of options.
See the
.Xr mount 8
man page for possible options and their meanings.
.El
.Sh SEE ALSO
.Xr mount 2 ,
.Xr unmount 2 ,
.Xr fstab 5 ,
.Xr mount 8
.Sh HISTORY
This NTFS implementation first appeared in Mac OS X 10.5.
.Sh AUTHORS
This NTFS implementation was written by
.An Anton Altaparmakov Aq aia21@cantab.net .
