MacOSX10.11.sdk/usr/share/man/man8/sa1.8
.\"Portions Copyright (c) 1999-2003 Apple Computer, Inc. All Rights
.\"Reserved.
.\"
.\"This file contains Original Code and/or Modifications of Original Code
.\"as defined in and that are subject to the Apple Public Source License
.\"Version 2.0 (the 'License'). You may not use this file except in
.\"compliance with the License. Please obtain a copy of the License at
.\"http://www.opensource.apple.com/apsl/ and read it before using this
.\"file.
.\"
.\"The Original Code and all software distributed under the License are
.\"distributed on an 'AS IS' basis, WITHOUT WARRANTY OF ANY KIND, EITHER
.\"EXPRESS OR IMPLIED, AND APPLE HEREBY DISCLAIMS ALL SUCH WARRANTIES,
.\"INCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY,
.\"FITNESS FOR A PARTICULAR PURPOSE, QUIET ENJOYMENT OR NON-INFRINGEMENT.
.\"Please see the License for the specific language governing rights and
.\"limitations under the License.
.\" 
.\"     @(#)sa1.8
.Dd Jul 25 2003               \" DATE 
.Dt sa1 8      \" Program name and manual section number 
.Os "Mac OS X"
.Sh NAME                 \" Section Header - required - don't modify 
.Nm sa1
.Nd Generate a system activity daily data file.
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm /usr/lib/sa/sa1
.Op Ar t n              \" [t n]
.Sh DESCRIPTION          \" Section Header - required - don't modify
The
.Nm sa1
command is a shell script used to invoke the system
activity data collector,
.Nm sadc .
The binary sample data is collected at intervals
.Ar t
seconds apart, in a loop
.Ar n
times.
The binary sample data is written to the standard
daily data file,
.Ar /var/log/sa/sadd
where the
.Ar dd
represents the current day of the month.
.Pp                      \" Inserts a space
.Nm sa1
is intended to be started by cron.
.Sh EXAMPLE CRON ENTRY
.Bd -literal
# Starting at 8am collect system activity records
# every 20 minutes for 12 hours
# 20 minutes = 1200 seconds
# 12 hours with 3 samples each hour = 36 loops

0 8 * * 1-5 /usr/lib/sa/sa1 1200 36


# After the 12 hour period,
# collect a system activity report

30 20 * * 1-5 /usr/lib/sa/sa2 -A

.Ed
.Pp
.Sh FILES                \" File used or created by the topic of the man page
.Bl -tag -width "/var/log/sa/sadd" -compact
.It Pa /var/log/sa/sadd
Default daily activity file that holds the binary sampling data.
.Ar dd
are digits that represent the day of the month.
.El
.Sh SEE ALSO 
.\" List links in ascending order by section, alphabetically within a section.
.Xr crontab 1 ,
.Xr fs_usage 1 ,
.Xr netstat 1 ,
.Xr sar 1 ,
.Xr sc_usage 1 ,
.Xr top 1 , 
.Xr vm_stat 1 ,
.Xr crontab 5 ,
.Xr iostat 8 ,
.Xr sa2 8 , 
.Xr sadc 8
