MacOSX10.11.sdk/usr/share/man/man8/sandboxd.8
.\"
.\" Copyright (c) 2006-2008 Apple Inc. All rights reserved.
.\"
.\" @APPLE_LICENSE_HEADER_START@
.\"
.\" This file contains Original Code and/or Modifications of Original Code
.\" as defined in and that are subject to the Apple Public Source License
.\" Version 2.0 (the 'License'). You may not use this file except in
.\" compliance with the License. Please obtain a copy of the License at
.\" http://www.opensource.apple.com/apsl/ and read it before using this
.\" file.
.\"
.\" The Original Code and all software distributed under the License are
.\" distributed on an 'AS IS' basis, WITHOUT WARRANTY OF ANY KIND, EITHER
.\" EXPRESS OR IMPLIED, AND APPLE HEREBY DISCLAIMS ALL SUCH WARRANTIES,
.\" INCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY,
.\" FITNESS FOR A PARTICULAR PURPOSE, QUIET ENJOYMENT OR NON-INFRINGEMENT.
.\" Please see the License for the specific language governing rights and
.\" limitations under the License.
.\"
.\" @APPLE_LICENSE_HEADER_END@
.\"
.Dd July 29, 2008
.Dt SANDBOXD 8
.Os "Mac OS X"
.Sh NAME
.Nm sandboxd
.Nd sandbox daemon
.Sh SYNOPSIS
.Nm
.Op s
.Nm
.Sh DESCRIPTION
.Nm
performs services on behalf of the Sandbox kernel extension.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It s
Just log basic sandbox violation information and don't do full symbolication.
.El
.Pp
This command is not intended to be invoked directly.
.Sh SEE ALSO
.Xr sandbox-exec 1 ,
.Xr sandbox_init 3 ,
.Xr sandbox 7
