MacOSX10.11.sdk/usr/share/man/man8/smbd.8
.\"
.\" Copyright 2009-2010 Apple, Inc. All rights reserved.
.\"
.\" The following requests are required for all man pages.
.Dd Wed Nov  4 17:03:55 PST 2009
.Dt smbd 8
.Os Darwin
.Sh NAME
.Nm smbd
.Nd SMB server daemon
.Sh SYNOPSIS
.Nm
.Op Cm options
.Sh DESCRIPTION
.Nm
runs on a server machine to service SMB protocol requests from SMB client
machines.
.Sh OPTIONS
.Bl -tag -width -indent  \" Differs from above in tag removed
.It Fl debug
The service will log extensive debug information and may perform extra
diagnostic checks. In debug mode,
.Nm
will not exit when idle.
.It Fl help
Prints a usage message and exits.
.It Fl ports Ar list
The service will listen on each of the TCP ports specified in the
comma-separated list. This option is typically only used for debugging, since
.Nm
is normally launched by
.Xr launchd 8
on port 445.
.It Fl stdout
Causes
.Nm
to print log messages to standard output instead of the system log.
.It Fl no-symlinks
In normal operation,
.Nm
will respond to client symlink requests but will never follow
symlinks itself. This flag causes
.Nm
to restrict client access to symlink operations and to always follow
symlinks. In this case, clients will not be aware that symlinks
are in use because they will always be directed to the symlink
target.
.El
.\" The following requests should be uncommented and used where appropriate.
.\" This next request is for sections 2 and 3 function return values only.
.\" .Sh RETURN VALUES
.\" This next request is for sections 1, 6, 7 & 8 only
.\" .Sh ENVIRONMENT
.Sh FILES
.Bl -tag -width -indent
.It Pa /Library/Preferences/SystemConfiguration/com.apple.smb.server.plist
The primary configuration for the SMB stack. This file is updated by various
system services and should not be edited by hand.
.It Pa /System/Library/LaunchDaemons/com.apple.smbd.plist
The
.Nm
service's property list file for
.Xr launchd 8 .
.El
.Sh SIGNALS
.Bl -tag -width SIGTERM
.It Dv SIGHUP
This signal causes
.Nm
to re-read its configuration settings.
.El
.\" .Sh EXAMPLES
.\" This next request is for sections 1, 6, 7 & 8 only
.\"     (command return values (to shell) and fprintf/stderr type diagnostics)
.\" .Sh DIAGNOSTICS
.\" The next request is for sections 2 and 3 error and signal handling only.
.\" .Sh ERRORS
.Sh SEE ALSO
.Xr launchd 8
.\" Cross-references should be ordered by section (low to high), then in
.\"     alphabetical order.
.Sh STANDARDS
The SMB protocol is documented as part of the Microsoft Work Group
Server Protocol Program (WSPP) technical documentation set,
specifically
.Bl -tag -width -indent  \" Differs from above in tag removed
.It Em MS-CIFS
Common Internet File System Specification
.It Em MS-SMB
Server Message Block (SMB) Protocol Specification
.El
.Sh HISTORY
The
.Nm
utility first appeared in Mac OS 10.7.
.\" .Sh AUTHORS
.\" .Sh BUGS
