MacOSX10.11.sdk/usr/share/man/man8/tokenadmin.8
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.\"See Also:
.\"man mdoc.samples for a complete listing of options
.\"man mdoc for the short list of editing options
.Dd Wed Dec 06 2006               \" DATE 
.Dt tokenadmin 8      \" Program name and manual section number 
.Os Darwin
.Sh NAME                 \" Section Header - required - don't modify 
.Nm tokenadmin
.\" The following lines are read in generating the apropos(man -k) database. Use only key
.\" words here as the database is built based on the words here and in the .ND line. 
.\" Use .Nm macro to designate other names for the documented program.
.Nd Command-line interface to smartcards and other token-based keychains
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Op Fl hqv               \" [-hqv]
.Ar command              \" command
.Op Ar command_options   \" [command_options]
.Op Ar command_args      \" [command_args]
.Sh DESCRIPTION          \" Section Header - required - don't modify
A command-line tool to administer smartcards and other token-based keychains.
.Sh OPTIONS
.Bl -tag -width -indent
.It Fl h
With no arguments, shows a list of all commands.  If arguments are 
provided, shows usage for each of the specified commands.  Same as the
.Cm help
command.
.It Fl q
Makes
.Nm
less verbose.
.It Fl v
Makes
.Nm
more verbose.
.El                      \" Ends the list
.Pp
.Sh "COMMANDS"
Note: all commands other than 
.Cm help
take the 
.Fl h
option to display help.  
.Bl -tag -width "create-fv-user"
.It Cm help
Shows all commands. 
.It Cm create-fv-user
.Fl u Ar short-name Fl l Ar long-name Op Fl p Ar password
.sp
Creates a new FileVaulted user protected by the inserted smart card or token.
.sp
Options:
.Bl -tag -compact -width -indent
.It Fl u Ar short-name
Specify the short (i.e., login) name to be used for the account.
.It Fl l Ar long-name
Specify the full name to be used for the account. If the full name contains
spaces, the name must be enclosed by quotation marks.  
.It Fl p Ar password
Password for the user's login keychain (optional). 
.El
.El
.Sh EXAMPLE
.Nm
.Cm create-fv-user 
-u fvtest3 -p foo -l "FV Test User 3" 
.sp
Create a new FileVaulted user with short name "fvtest3" and full name 
"FV Test User 3", with the new FileVault image being protected by the
inserted token. The password for the user's login keychain is "foo". 
.Sy Note: 
after creating this user with 
.Nm ,
you must run "sc_auth accept -u fvtest3" or this user will not be able to 
log in.  
.Sh SEE ALSO 
.\" List links in ascending order by section, alphabetically within a section.
.\" Please do not reference files that do not exist without filing a bug report
.Xr security 1 ,
.Xr sc_auth 8 ,
.Xr systemkeychain 8 
.Sh NOTES
.Nm
will eventually be merged into the 
.Xr security 1
command.
