MacOSX12.1.sdk/usr/share/man/man8/AssetCacheManagerUtil.8
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.\"See Also:
.\"man mdoc.samples for a complete listing of options
.\"man mdoc for the short list of editing options
.\"/usr/share/misc/mdoc.template
.Dd 10/24/16               \" DATE 
.Dt AssetCacheManagerUtil 8      \" Program name and manual section number 
.Os "macOS"
.Sh NAME                 \" Section Header - required - don't modify 
.Nm AssetCacheManagerUtil
.\" The following lines are read in generating the apropos(man -k) database. Use only key
.\" words here as the database is built based on the words here and in the .ND line. 
.\" .Nm Other_name_for_same_program(),
.\" .Nm Yet another name for the same program.
.\" Use .Nm macro to designate other names for the documented program.
.Nd control the macOS Content Cache
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Op -a|--all
.Op -j|--json
.Op -l|--linger
.Ar command
.Sh DESCRIPTION          \" Section Header - required - don't modify
.Nm
controls the macOS Content Cache.
.Nm
must be run by root except as noted below.
The options are:
.Bl -tag
.It -a|--all
Show all events, not just the end result of the specified
.Ar command .
.It -j|--json
Print results in machine-parseable JSON format to stdout.
.It -l|--linger
Linger after completing
.Ar command ,
to show other events.
.El
.Pp
The commands are:
.Bl -tag
.It activate
Activates the content cache.
Content caching is deactivated by default.
After you activate content caching, restart devices on your network to take advantage of content caching immediately.
Devices on your network will discover this content cache over time.
Devices that are restarted will use this content cache immediately.
.It deactivate
Deactivates the content cache.
.It isActivated
Reports the content cache's activation status.
Does not require root.
.It canActivate
Reports whether the content cache is eligible for activation.
Does not require root.
.It flushCache
Flushes the content cache.
.It flushPersonalCache
Flushes all personal (iCloud) content from the content cache.
.It flushSharedCache
Flushes all shared (non-iCloud) content from the content cache.
.It status
Reports the content cache's status.
Does not require root.
.It settings
Reports the content cache's settings.
Does not require root.
.It reloadSettings
Forces the content cache to reload its settings.
.It moveCacheTo path
Moves the cache to
.Ar path .
The path must end with /Library/Application Support/Apple/AssetCache/Data.
The contents of
.Ar path
are deleted and replaced with the cache.
.It absorbCacheFrom path read-only|and-destroy
Imports the cache from
.Ar path .
The path must end with either /Library/Application Support/Apple/AssetCache/Data or /Library/Server/Caching/Data.
If the last argument is
.Ar read-only
the cache at
.Ar path
is not modified, otherwise it is emptied.
This command only starts the absorption, which proceeds and finishes in the background.
Use the
.Xr log 1
command to view progress, for example:
log show --predicate 'subsystem == "com.apple.AssetCache"' --style compact --last 5m
.El
.Sh "SEE ALSO"
System Preferences > Sharing > Content Caching,
.Ns Xr AssetCache 8 ,
.Ns Xr AssetCacheLocatorUtil 8 ,
.Ns Xr AssetCacheTetheratorUtil 8
