MacOSX12.1.sdk/usr/share/man/man8/backgroundtaskmanagementagent.8
.Dd May 10, 2018
.Dt btm-agent 8
.Os macOS
.
.Sh NAME
.Nm backgroundtaskmanagementagent
.Nd User agent which manages lists of background task processes
.
.Sh DESCRIPTION
.Nm
is a per\-user agent that manages lists of background tasks.
This includes items in System Preferences > Users & Groups > Login Items, items installed with SMLoginItemSetEnabled(), and items from managed device profiles.
.
.Sh FILES
/System/Library/CoreServices/backgroundtaskmanagementagent
/System/Library/LaunchAgents/com.apple.backgroundtaskmanagementuiagent.plist
.Pp
~/Library/Application Support/com.apple.backgroundtaskmanagementagent/backgrounditems.btm
.
.Sh SEE ALSO
.Nm btmtool
.
