MacOSX12.1.sdk/usr/share/man/man8/csnameddata.8
.\""Copyright (c) 2001-2017 Apple Computer, Inc. All Rights Reserved.
.Dd August 1, 2020
.Dt OPEN 8
.Os "macOS"
.Sh NAME
.Nm csnameddata
.Nd displays and sets information for the the CSNamedData service
.Sh SYNOPSIS
.Nm
.Op Fl v
.Op Fl Fl verbose
.Op Fl f
.Op Fl Fl full
.Ar command Op Ar options
.Op Ar command
.Sh DESCRIPTION
The
.Nm
command displays information for and sets and controls the service which provides CSNamedData.
The options are as follows:
.Bl -tag -width "---------"
.It Fl f
when displaying an item, don't truncate the data display
.It Fl full
when displaying an item, don't truncate the data display
.It Fl v
display more verbose status
.It Fl Fl verbose
display more verbose status
.El
.Sh COMMANDS
Each command and any arguments are handled.  Multiple commands may be passed in one invokation.
.Bl -tag -width --------------
.It get Ar key
fetches the data for the given key from the service and displays it.  If
.Fl f
is passed, the full data will be displayed, otherwise it will be truncated if longer than 64 characters.
.It set Ar key Ar value
sets the data for the given key.  If the first character of value is '/', then it is assumed to be a file and the contents of the file will be read and set as the value, otherwise value will be treated as a string.
.It flush Ar key
flushes any data set for the given key.  This only affects future callers; any previous processes which have fetched the value will still see the previous value.
.It flushAll
flushes all data in the service.  This only affects future callers; any previous processes which have fetched the value will still see the previous value.
.It showall
displays all of the known keys and values from the service.  If
.Fl f
is passed, then the full data will be displayed, otherwise it will be truncated if longer than 64 characters.
.It statistics
displays usage statistics.
.El
.Sh EXAMPLES
.Nm
get com.apple.sample
.Pp
displays whatever value, if any, is set for the key "com.apple.sample"
.Pp
.Nm
set com.apple.sample "This is a string"
.Pp
sets the value of the key "com.apple.sample" to the 16 character string "This is a string".
.Pp
.Nm
flushall
.Pp
flushes all data in the service
.Sh HISTORY
First appeared in macOS 11.1
