MacOSX12.1.sdk/usr/share/man/man8/diskmanagementd.8
.Dd 15 June 2016
.Os "macOS"
.Dt diskmanagementd 8
.Pp
.Sh NAME
.Nm diskmanagementd
.Nd DiskManagement.framework server
.Sh SYNOPSIS
.Nm
.Sh DESCRIPTION
.Nm
is the back-end daemon to the DiskManagement framework.  It is launched on demand whenever
there is at least one client of the DiskManagement framework in the system and exits automatically
when there are no more such clients.
.Pp
.Nm
considers a client to have stopped using DiskManagement if it exited normally, exited abnormally
(perhaps it crashed), or if it released all of its DiskManagement framework objects.
.Pp
There are no configuration options.  Users should not run this daemon manually.
.Sh SEE ALSO
.Ns Xr diskarbitrationd 8 ,
.Ns Xr diskutil 8 ,
.Ns Xr mount 8
