MacOSX12.1.sdk/usr/share/man/man8/natpmpd.8
.\" 
.\" Copyright (c) 2010-2011 Apple Inc. All rights reserved.
.\" 
.\" @APPLE_OSREFERENCE_LICENSE_HEADER_START@
.\" 
.\" This file contains Original Code and/or Modifications of Original Code
.\" as defined in and that are subject to the Apple Public Source License
.\" Version 2.0 (the 'License'). You may not use this file except in
.\" compliance with the License. The rights granted to you under the License
.\" may not be used to create, or enable the creation or redistribution of,
.\" unlawful or unlicensed copies of an Apple operating system, or to
.\" circumvent, violate, or enable the circumvention or violation of, any
.\" terms of an Apple operating system software license agreement.
.\" 
.\" Please obtain a copy of the License at
.\" http://www.opensource.apple.com/apsl/ and read it before using this file.
.\" 
.\" The Original Code and all software distributed under the License are
.\" distributed on an 'AS IS' basis, WITHOUT WARRANTY OF ANY KIND, EITHER
.\" EXPRESS OR IMPLIED, AND APPLE HEREBY DISCLAIMS ALL SUCH WARRANTIES,
.\" INCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY,
.\" FITNESS FOR A PARTICULAR PURPOSE, QUIET ENJOYMENT OR NON-INFRINGEMENT.
.\" Please see the License for the specific language governing rights and
.\" limitations under the License.
.\" 
.\" @APPLE_OSREFERENCE_LICENSE_HEADER_END@
.\"
.Dd March 16, 2011
.Dt natpmpd 8      \" Program name and manual section number 
.Os Darwin
.Sh NAME                 \" Section Header - required - don't modify 
.Nm natpmpd
.\" The following lines are read in generating the apropos(man -k) database. Use only key
.\" words here as the database is built based on the words here and in the .ND line. 
.\" Use .Nm macro to designate other names for the documented program.
.Nd NAT Port mapping daemon.
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Op Fl d
.Op Fl k Ar mssclamp
.Op Fl x/y Ar privateIfName
publicIfName
.Sh DESCRIPTION          \" Section Header - required - don't modify
.Nm
is a daemon implementing NAT-PMP. NAT-PMP is a protocol for handling port forwarding requests from clients behind a NAT. 
It is normally invoked by
.Xr InternetSharing 8
.Pp                      \" Inserts a space
The options are as follows:
.Bl -tag -width Ds
.It Fl x/y Ar publicinterface
The private interfaces that need the use the service.
.El
.Sh NOTES
com.apple/100.InternetSharing/natpmp PF anchor is required for this daemon to correctly function.
.Pp
.Sh SEE ALSO
.Xr InternetSharing 8 ,
.Xr pf.conf 5
