MacOSX12.1.sdk/usr/share/man/man8/networkQuality.8
.\" Copyright (c) 2020-2021 Apple Computer, Inc.  All rights reserved.
.Dd 9/22/20
.Dt networkQuality 8
.Os Darwin
.Sh NAME
.Nm networkQuality
.Nd Network quality testing tool
.Sh SYNOPSIS
.Nm
.Op Fl chsv           \" [-chsv]
.Op Fl I Ar interface \" [-I interface]
.Sh DESCRIPTION
.Nm
allows for measuring the different aspects of Network Quality, including:
.Pp
Maximal capacity (often described as speed)
.Pp
The responsiveness of the connection. Responsiveness measures the quality of your network by the number of roundtrips completed per minute (RPM) under working conditions. See
.Ar https://support.apple.com/kb/HT212313
.Pp
Other aspects of the connection that affect the quality of experience.
.Pp
NOTE: This tool will connect to the Internet to perform its tests. This will use data on your Internet service plan.
.Pp
The following options are available:
.Bl -tag -width -indent
.It Fl C                 \"-C flag as a list item
Use custom configuration URL.
.It Fl c
Produce computer-readable output
.It Fl h
Show help
.It Fl I Ar interface
Bind test to interface (e.g., en0, pdp_ip0,...)
.Pp
If not specified, the default interface will be used.
.It Fl s
Run tests sequentially instead of parallel upload/download
.It Fl v
Verbose output
.El                      \" Ends the list
.Pp
.\" .El
.Sh SEE ALSO
.\" List links in ascending order by section, alphabetically within a section.
.\" Please do not reference files that do not exist without filing a bug report
.Xr ping 8 ,
.Xr traceroute 8
.\" .Sh BUGS              \" Document known, unremedied bugs
.\" .Sh HISTORY           \" Document history if command behaves in a unique manner
