MacOSX12.1.sdk/usr/share/man/man8/socketfilterfw.8
.Dd November 10, 2016
.Dt socketfilterfw 8
.Os Mac OS X
.Sh NAME
.Nm socketfilterfw
.Nd Application Firewall daemon
.Sh SYNOPSIS
.Nm
.Op Fl hdlk
.Op Fl -getglobalstate
.Op Fl -setglobalstate Ar on | off
.Op Fl -getblockall
.Op Fl -setblockall Ar on | off
.Op Fl -listapps
.Op Fl -getappblocked Ar path
.Op Fl -blockapp Ar path
.Op Fl -unblockapp Ar path
.Op Fl -add Ar path
.Op Fl -remove Ar path
.Op Fl -getallowsigned
.Op Fl -setallowsigned
.Op Fl -setallowsignedapp
.Op Fl -getstealthmode
.Op Fl -setstealthmode Ar on | off
.Op Fl -getloggingmode
.Op Fl -setloggingmode Ar on | off
.Op Fl -getloggingopt
.Op Fl -setloggingopt Ar throttled | brief | detail
.Pp
.Sh DESCRIPTION
.Nm
is a daemon that gets launched on demand when the Application Firewall is enabled.  There are also command-line options to change the Application Firewall behavior.
.Sh OPTIONS
.Pp
The command line options are as follows:
.Bl -tag -width indent
.It Fl h
Display this help and exit.
.It Fl d
Turn on debugging.
.It Fl l
Do logging and run in daemon mode.
.It Fl k
Kill daemon.
.It Fl -getglobalstate
Display if the firewall is enabled or not.
.It Fl -setglobalstate Ar on | off
Turn the firewall on or off.
.It Fl -getblockall
Show whether block all is enabled or not.
.It Fl -setblockall Ar on | off
Enable or disable block all option.
.It Fl -listapps
Display a list of paths of added applications.
.It Fl -getappblocked Ar path
Show whether connections are blocked or not for the application at the indicated path.
.It Fl -blockapp Ar path
Block the application at the indicated path.
.It Fl -unblockapp Ar path
Unblock the application at the indicated path.
.It Fl -add Ar path
Add the application at the indicated path to the firewall.
.It Fl -remove Ar path
Remove the application at the indicated path from the firewall.
.It Fl -getallowsigned
Show whether built-in and downloaded signed applications are to automatically receive incoming connections.
.It Fl -setallowsigned
Set whether built-in signed applications are to automatically receive incoming connections or not.
.It Fl -setallowsignedapp
Set whether downloaded signed applications are to automatically receive incoming connections or not.
.It Fl -getstealthmode
Show whether stealth mode is on or not.
.It Fl -setstealthmode Ar on | off
Set stealth mode on or off.
.It Fl -getloggingmode
Show whether logging is on or not.
.It Fl -setloggingmode Ar on | off
Set logging to on or off.
.It Fl -getloggingopt
Show logging option.
.It Fl -setloggingopt Ar throttled | brief | detail
Set logging option.
.El
