MacOSX10.11.sdk/usr/share/man/man1/avconvert.1
.\"Copyright (c) 2011 Apple Computer, Inc. All Rights Reserved.
.Dd December 14, 2011
.Dt AVCONVERT 1
.Os "Mac OS X"
.Sh NAME
.Nm avconvert
.Nd movie conversion tool
.Sh SYNOPSIS
.Nm
.Op Fl hvq
.Fl \-p Ar <preset_name>
.Fl \-s Ar <source_media>
.Fl \-o Ar <output_movie>
.Sh DESCRIPTION
.Nm
can be used to compress video media to different types for sharing on the web or loading onto devices.
.Bl -tag -width "-p name"
.It Fl h
prints usage information and available presets
.It Fl v
sets the console output to verbose
.It Fl q
sets the console output to quiet
.It Fl prog
shows progress during the export (default with -v)
.It Fl p | \-preset Ar name
converts the source media to an output file using the specified preset. Use --listPresets to get the full list. Common presets are:
.Bd -literal
.Sy PresetAppleM4VCellular
.Sy PresetAppleM4ViPod
.Sy PresetAppleM4VWiFi
.Sy PresetAppleM4VAppleTV
.Sy PresetAppleM4V480pSD
.Sy PresetAppleM4V720pHD
.Sy PresetAppleM4V1080pHD
.Sy PresetAppleM4A
.Ed
.It Fl s | \-source Ar file
is the source media file
.It Fl o | \-output Ar file
is the output movie file
.It Fl \-listPresets
lists all of the presets avconvert supports
.It Fl \-listTracks
lists the available tracks in the source media. Must be used with the \-\-source flag
.El
.Sh OPTIONS
.Pp
Optional flags to configure the audio export settings
.Bl -tag -width "--preset name"
.It Fl adr Ar number
a limit value for the data rate for the audio track in bits per second
.It Fl af Ar fourCC
sets the format of the audio output using a fourCC eg. aac
.It Fl sr Ar number
configures the sample rate of the output in Hertz. eg. 44100
.It Fl cc Ar number
is the channel count of the output eg. 1 (for mono) 2 (stereo) 4 (quad)
.El
.Pp
Optional flags to configure the video export settings
.Bl -tag -width "--preset name"
.It Fl vdr Ar number
a limit value for the video data rate in bits per second
.It Fl th Ar number
sets the height of the output video in pixels
.It Fl tw Ar number
sets the width of the output video in pixels
.It Fl vc Ar fourCC
sets the format of the video output using a fourCC eg. avc1
.It Fl fr Ar number 
sets the frame rate of the output video in frames per second
.It Fl kr Ar number
specifies how often keyframes appear in the output video
.It Fl fr Ar yes | Ar no
sets whether or not to enable frame reordering (b-frames)
.El
.Pp
Optional flags configuring track and metadata output
.Bl -tag -width "--preset name"
.It Fl ot Ar name
omits the listed track type from the exported movie Allowable track types are:
.Bd -literal
.Sy videoTrack
.Sy audioTrack
.Sy subtitleTrack
.Sy chapterTrack
.Sy thumbnailTrack
.Sy closedcaptionTrack 
.Sy textTrack 
.Ed
.It Fl md Ar file
sets the file from which the metadata for the export is found if that is different from the source movie
.El
.Sh EXAMPLES
.Pp
	avconvert --listPresets
.Pp
Lists the available presets that can be used for export
.Pp
	avconvert --preset AppleM4ViPod --source sample_movie.mov --output ipod_movie.m4v
.Pp
Exports the source movie "sample_movie.mov" to "ipod_movie.m4v" using the iPod encoding preset
.Pp
	avconvert --preset AppleM4VAppleTV --source sample_movie.mov --output appletv_movie.m4v -adr 128000 -sr 441000
.Pp
Overrides the AppleTV defaults for audio data rate and sample rate in the output movie
.Pp
	avconvert --preset AppleM4VAppleTV --source sample_movie.mov --output appletv_movie.m4v -ot audioTrack
.Pp
Omits the audio track from the output file "appletv_movie.m4v"
.Sh HISTORY
.Nm
command first appeared in Mac OS X 10.7.