MacOSX10.11.sdk/usr/share/man/man1/launchservicesd.1
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.\"See Also:
.\"man mdoc.samples for a complete listing of options
.\"man mdoc for the short list of editing options
.\"/usr/share/misc/mdoc.template
.Dd 04/01/13               \" DATE
.Dt launchservicesd 8      \" Program name and manual section number 
.Os Darwin
.Sh NAME                 \" Section Header - required - don't modify 
.Nm launchservicesd
.\" The following lines are read in generating the apropos(man -k) database. Use only key
.\" words here as the database is built based on the words here and in the .ND line. 
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Op Ar --server          \" --server
.Sh DESCRIPTION          \" Section Header - required - don't modify
.Nm
is used internally by MacOS X to track and coordinate information about the running applications on the system.
.Sh FILES                \" File used or created by the topic of the man page
.Bl -tag -width "/System/Library/CoreServices/launchservicesd" -compact
.It Pa /System/Library/CoreServices/launchservicesd
.El                      \" Ends the list
.Sh SEE ALSO
.\" List links in ascending order by section, alphabetically within a section.
.\" Please do not reference files that do not exist without filing a bug report
.Xr lsappinfo 8
.\" .Sh BUGS              \" Document known, unremedied bugs
.Sh HISTORY           \" Document history if command behaves in a unique manner
.Nm
was introduced in MacOS 10.9.