MacOSX10.11.sdk/usr/share/man/man1/securityd.1
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.\"See Also:
.\"man mdoc.samples for a complete listing of options
.\"man mdoc for the short list of editing options
.Dd Fri Sep 10 2004             \" DATE 
.Dt securityd 1      \" Program name and manual section number 
.Os Darwin
.Sh NAME                 \" Section Header - required - don't modify 
.Nm securityd
.\" The following lines are read in generating the apropos(man -k) database. Use only key
.\" words here as the database is built based on the words here and in the .ND line. 
.\" Use .Nm macro to designate other names for the documented program.
.Nd Security context daemon for Authorization and cryptographic operations
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Sh DESCRIPTION          \" Section Header - required - don't modify
.Nm
maintains security contexts and arbitrates cryptographic operations and Security Authorizations. Access to
keychain items is routed through 
.Nm
to enforce access controls and to keep private keys out of
user process address space.  Authorization calls also communicate with 
.Nm
to enforce rules contained in the
.Pa /etc/authorization
database.  All user interaction with
.Nm
is mediated through the
.Nm "Security Agent."
.Pp
This command is not intended to be invoked directly.
.Sh HISTORY
.Nm
was first introduced in Mac OS X version 10.0 (Cheetah) as the "Security Server" and was renamed in 10.4 (Tiger).
.Sh AUTHORS
.An "Perry The Cynic"
