MacOSX10.15.sdk/usr/share/man/man7/sandbox.7
.\" Copyright (c) 2010 Apple Inc.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 4. Neither the name of Apple Computer nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY APPLE COMPUTER AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"
.Dd January 29, 2010
.Dt SANDBOX 7
.Os "Mac OS X"
.Sh NAME
.Nm sandbox
.Nd overview of the sandbox facility
.Sh SYNOPSIS
.Fd #include <sandbox.h>
.Sh DESCRIPTION
The
.Nm
facility allows applications to voluntarily restrict their access to
operating system resources.  This safety mechanism is intended to limit
potential damage in the event that a vulnerability is exploited.  It
is not a replacement for other operating system access controls.
.Pp
New processes inherit the
.Nm
of their parent.
Restrictions are generally enforced upon acquisition of operating system
resources only.  For example, if file system writes are restricted, an
application will not be able to
.Xr open 2
a file for writing.  However, if the application already has a file
descriptor opened for writing, it may use that file descriptor regardless
of restrictions.
.Sh SEE ALSO
.Xr sandbox-exec 1 ,
.Xr sandbox_init 3 ,
.Xr sandboxd 8
