MacOSX10.14.sdk/usr/share/man/man5/bom.5
.\"Copyright (c) 1999-2003 Apple Computer, Inc.  All Rights Reserved.
.\"
.\"This file contains Original Code and/or Modifications of Original Code
.\"as defined in and that are subject to the Apple Public Source License
.\"Version 2.0 (the 'License'). You may not use this file except in
.\"compliance with the License. Please obtain a copy of the License at
.\"http://www.opensource.apple.com/apsl/ and read it before using this
.\"file.
.\"
.\"The Original Code and all software distributed under the License are
.\"distributed on an 'AS IS' basis, WITHOUT WARRANTY OF ANY KIND, EITHER
.\"EXPRESS OR IMPLIED, AND APPLE HEREBY DISCLAIMS ALL SUCH WARRANTIES,
.\"INCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY,
.\"FITNESS FOR A PARTICULAR PURPOSE, QUIET ENJOYMENT OR NON-INFRINGEMENT.
.\"Please see the License for the specific language governing rights and
.\"limitations under the License.
.Dd 28 September 2006
.Dt BOM 5
.Os "Mac OS X"
.Sh NAME
.Nm bom
.Nd bill of materials 
.Sh DESCRIPTION
The Mac OS X Installer uses a file system "bill of materials" to determine
which files to install, remove, or upgrade. A bill of materials,
.Nm bom ,
contains all the files within a directory, along with some information
about each file. File information includes: the file's UNIX permissions,
its owner and group, its size, its time of last modification, and so on.
Also included are a checksum of each file and information about hard
links.
.Pp
The bill of materials for installed packages are found within the package
receipts located in /Library/Receipts.
.Sh SEE ALSO
.Xr ditto 1 ,
.Xr lsbom 8 ,
.Xr mkbom 8
.Sh BUGS
Mac OS X's bill of materials format is not compatible with formats from
older operating systems.
.Sh HISTORY
The bill of materials file appeared in NeXTSTEP to support installation.
The file format was updated and extended for Mac OS X 10.0.  The format
was extended to support 64 bit file sizes with OS X 10.3.
