MacOSX10.14.sdk/usr/share/man/man5/rpc.5
.\" Portions Copyright (c) 2006 Apple Computer, Inc. All Rights Reserved.
.\"	$NetBSD: rpc.5,v 1.2 1994/11/30 19:31:30 jtc Exp $
.\"	@(#)rpc.5	2.2 88/08/03 4.0 RPCSRC; from 1.4 87/11/27 SMI;
.\"
.\"	See the DISCLAIMER and README files in /usr/src/lib/libc/rpc for
.\"	more information about this file.
.\"
.Dd September 26, 1985
.Dt RPC 5
.Os
.Sh NAME
.Nm rpc
.Nd rpc program number data base
.Sh DESCRIPTION
The
.Nm rpc
file contains user readable names that
can be used in place of rpc program numbers.
Each line has the following information:
.Pp
.Bl -item -offset indent -compact
.It
name of server for the rpc program
.It
rpc program number
.It
aliases
.El
.Pp
Items are separated by any number of blanks and/or
tab characters.
A ``#'' indicates the beginning of a comment; characters up to the end of
the line are not interpreted by routines which search the file.
.Sh EXAMPLES
Here is an example of the 
.Pa /etc/rpc
file from the Sun RPC Source distribution.
.Bd -literal -offset indent
#
# rpc 88/08/01 4.0 RPCSRC; from 1.12   88/02/07 SMI
#
portmapper	100000	portmap sunrpc
rstatd		100001	rstat rstat_svc rup perfmeter
rusersd		100002	rusers
nfs		100003	nfsprog
ypserv		100004	ypprog
mountd		100005	mount showmount
ypbind		100007
walld		100008	rwall shutdown
yppasswdd	100009	yppasswd
etherstatd	100010	etherstat
rquotad		100011	rquotaprog quota rquota
sprayd		100012	spray
3270_mapper	100013
rje_mapper	100014
selection_svc	100015	selnsvc
database_svc	100016
rexd		100017	rex
alis		100018
sched		100019
llockmgr	100020
nlockmgr	100021
x25.inr		100022
statmon		100023
status		100024
bootparam	100026
ypupdated	100028	ypupdate
keyserv		100029	keyserver
tfsd		100037 
nsed		100038
nsemntd		100039
.Ed
.Sh INTERACTION WITH DIRECTORY SERVICES
Processes generally find protocol records using one of the
.Xr getrpcent 3
family of functions.
On Mac OS X, these functions interact with the
.Xr DirectoryService 8
daemon,
which reads the /etc/rpc file as well as searching other directory information services
to determine rpc name and program number information.
.Sh FILES
.Pa /etc/rpc
.Sh SEE ALSO
.Xr getrpcent 3 ,
.Xr DirectoryService 8
