MacOSX10.10.sdk/usr/share/man/man1/open.1
.\""Copyright (c) 2001 Apple Computer, Inc. All Rights Reserved.
.Dd February 10, 2004
.Dt OPEN 1  
.Os "Mac OS X"       
.Sh NAME
.Nm open
.Nd open files and directories
.Sh SYNOPSIS
.Nm
.Op Fl e
.Op Fl t
.Op Fl f
.Op Fl F
.Op Fl W
.Op Fl R
.Op Fl n 
.Op Fl g
.Op Fl h
.Op Fl b Ar bundle_identifier
.Op Fl a Ar application
.Ar
.Op Fl Fl args Ar arg1 ...
.Sh DESCRIPTION
The
.Nm
command opens a file (or a directory or URL), just as if you had double-clicked the file's icon. If no application name is specified, the default application as determined via LaunchServices is used to open the specified files. 
.Pp
If the file is in the form of a URL, the file will be opened as a URL.
.Pp
You can specify one or more file names (or pathnames), which are interpreted relative to the shell or Terminal window's current working directory. For example, the following command would open all Word files in the current working directory:
.Pp
.Bd -literal
open *.doc
.Ed
.Pp
Opened applications inherit environment variables just as if you had launched the application directly through its full path.  This behavior was also present in Tiger.
.Pp
The options are as follows:
.Bl -tag -width "-e"
.It Fl a\ \&application
Specifies the application to use for opening the file
.It Fl b\ \&bundle_indentifier
Specifies the bundle identifier for the application to use when opening the file
.It Fl e
Causes the file to be opened with /Applications/TextEdit
.It Fl t
Causes the file to be opened with the default text editor, as determined via LaunchServices
.It Fl f
Reads input from standard input and opens the results in the default text editor. 
End input by sending EOF character (type Control-D). 
Also useful for piping output to 
.Nm
and having it open in the default text editor.
.It Fl F
Opens the application "fresh," that is, without restoring windows. Saved persistent state is lost, except for Untitled documents.
.It Fl W
Causes
.Nm
to wait until the applications it opens (or that were already open) have exited.  Use with the
.Fl n
flag to allow
.Nm
to function as an appropriate app for the \fB$EDITOR\fR environment variable.
.It Fl R
Reveals the file(s) in the Finder instead of opening them.
.It Fl n
Open a new instance of the application(s) even if one is already running.
.It Fl g
Do not bring the application to the foreground.
.It Fl h
Searches header locations for a header whose name matches the given string and then opens it.  Pass a full header name (such as NSView.h) for increased performance.
.It Fl Fl args
All remaining arguments are passed to the opened application in the argv parameter to main().  These arguments are not opened or interpreted by the
.Nm
tool.
.El
.Sh EXAMPLES
"open '/Volumes/Macintosh HD/foo.txt'" opens the document in the default application for its type (as determined by LaunchServices).
.Pp
"open '/Volumes/Macintosh HD/Applications/'" opens that directory in the Finder.
.Pp
"open -a /Applications/TextEdit.app '/Volumes/Macintosh HD/foo.txt'" opens the document in the application specified (in this case, TextEdit).
.Pp
"open -b com.apple.TextEdit '/Volumes/Macintosh HD/foo.txt'" opens the document in the application specified (in this case, TextEdit).
.Pp
"open -e '/Volumes/Macintosh HD/foo.txt'" opens the document in TextEdit. 
.Pp
"ls | open -f" writes the output of the 'ls' command to a file in /tmp and opens the file in the default text editor (as determined by LaunchServices).
.Pp
"open http://www.apple.com/" opens the URL in the default browser.
.Pp
"open 'file://localhost/Volumes/Macintosh HD/foo.txt'" opens the document in the default application for its type (as determined by LaunchServices).
.Pp
"open 'file://localhost/Volumes/Macintosh HD/Applications/'" opens that directory in the Finder.
.Pp
"open -h NSView" lists headers whose names contain NSView and allows you to choose which ones to open.
.Pp
"open -a Xcode -h NSString.h" quickly opens /System/Library/Frameworks/Foundation.framework/Headers/NSString.h in Xcode.
.Pp
.Sh HISTORY
First appeared in NextStep.
