MacOSX10.10.sdk/usr/share/man/man1/stackshot.1
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.\"See Also:
.\"man mdoc.samples for a complete listing of options
.\"man mdoc for the short list of editing options
.\"/usr/share/misc/mdoc.template
.Dd 11/10/05               \" DATE 
.Dt stackshot 1      \" Program name and manual section number 
.Os Darwin
.Sh NAME                 \" Section Header - required - don't modify 
.Nm stackshot
.Nd capture user and kernel space stack traces, using a kernel stack trace 
facility
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Op Fl D
.Op Fl i
.Op Fl f Ar path
.Op Fl n Ar number
.Op Fl p Ar pid
.Op Fl B Ar size
.Sh DESCRIPTION          \" Section Header - required - don't modify
The
.Nm
daemon is a diagnostic facility used to capture stack traces for each thread on the system, including both user space and kernel stacks. The
resulting view of the system is internally consistent. This facility, especially when coupled with
.Xr sysdiagnose 1
(described below) can be used to obtain an overview of the state of the system under abnormal conditions, such as hangs and UI unresponsiveness, with a few keystrokes.
.Pp
The stack snapshot is triggered
upon pressing a special key chord. Two key chords are available: 
Control-Option-Command-Shift-Period triggers stackshot as well as
.Xr sysdiagnose 1
in the default configuration. An alternate keychord,
Control-Option-Command-Shift-Comma invokes stackshot and its stack symbolication facility alone.
.Pp
The daemon also triggers a stack snapshot upon reception of the SIGINFO
signal.
.Pp
Stack pages that are paged out are not captured--this caveat does not
apply to kernel space stacks, which are wired.
.\" Uncomment when symbolication is enabled.
.\" It caches the symbols from
.\" .Pa /mach.sym
.\" when it starts up, and queries the kernel for the kexts loaded into
.\" memory; it uses this information to attempt to assign symbols+offset
.\" tags to the stack addresses.
.Pp                      \" Inserts a space
The following options are available:
.Bl -tag -width -indent  \" Begins a tagged list 
.It Fl D
Turn on debugging.
.It Fl i
Do an immediate snapshot, and exit. Useful when invoked from the command line.
.It Fl f Ar path
Output the log information to the specified path.  This supercedes
any preference configuration (see below).
.It Fl n Ar number
Limit the number of snapshots taken; the default is 1.
.It Fl p Ar pid
Log the stack information for the specified process-ID only.
.It Fl B Ar size
Specify the size of the trace buffer; the default is 52 kilobytes.
.It Fl t
Attempt to invoke
.Xr sysdiagnose 1
This will also cause the stackshot logfile to be symbolicated, with the symbolicated tracefile appended to
.Pa /Library/Logs/stackshot-syms.log.
.It Fl u
Attempt symbolication. Currently, this starts up a separate symbolicator 
thread, and signals that thread to begin symbolication using
.Xr atos 1
when a snapshot is triggered. The current implementation may take several
seconds to perform the address-symbol translations, depending on the state of the system. The symbolicated trace file is appended to:
.Pa /Library/Logs/stackshot-syms.log.
.It Fl l
Gather information on the loaded binary images as part of the stackshot.
.It Fl O
Gather OS trace information as part of the stackshot (this may time out).
.It Fl I
Include the list of importance donors per process in the output log.
.El                      \" Ends the list
.Sh SYMBOLICATION
Symbolication (as with the -t or -u options, or the symstacks.rb script described
below) is performed against the currently executing process images, which may
have been either fully or partially stripped of debugging symbols. Additionally,
kernel stacks are symbolicated against /mach_kernel, which typically has all
local and debugging symbols stripped (as with "strip -S -x"). In either case,
symbol matching may not always be accurate.  If in doubt, you may run the
unstripped executable images, or symbolicate the trace file directly against the
unstripped images using an alternate mechanism, such as gdb. The symstacks.rb
script (see below) can take a "-k" argument, which specifies the location of an
alternate kernel image to symbolicate with--this can be an unstripped kernel
image. When filing bug reports, it is best to include both the trace file
("stackshot.log") and the symbolicated trace ("stackshot-syms.log").
.Sh NOTES
The
.Nm
daemon is intended to be run by the
.Xr launchd 8
super-daemon. The system may not be configured with
.Nm
enabled by default. 
.Xr launchctl 1
can be used to enable and disable this daemon. 
.Nm
reads configuration information from
.Pa ~root/Library/Preferences/com.apple.stackshot.plist .
It examines the following keys
.Bl -tag -width "Trace_Server"
.It Trace\ File
Specifies the file to use.  The default is
.Pa /Library/Logs/stackshot.log .
.It Trace\ Server
A dictionary containing ``Host'' (as a string) and ``Port''
(as an integer) keys, for a server.  If both a file and server
are specified,
.Nm
will attempt to use both.  The server is expected to do nothing
other than accept a connection, accept a stream of data, and
write it to a file of its choosing.
.It Buffer\ Size
Specifies the size of the trace buffer.
.El
.Pp
.Sh FILES                \" File used or created by the topic of the man page
.Bl -tag -width "/usr/sbin/symstacks.rb" -compact
.It Pa /usr/libexec/stackshot
The
.Nm 
binary.
.It Pa ~root/Library/Preferences/com.apple.stackshot.plist
Preference file used for configuration information.
.It Pa /System/Library/LaunchDaemons/com.apple.stackshot.plist
Configuration file used by
.Xr launchd 8 .
.It Pa /usr/sbin/symstacks.rb
.Xr ruby 1
script to process the output of
.Nm
and turn symbol addresses into symbol names. It reads a
.Nm
trace file from standard input or a file specified with "-f" , and writes the
symbolicated version to standard output, or to a file specified with "-w". See caveats above regarding accuracy of symbolication against stripped images. The "-k" argument to the script can specify the location of a kernel image, which will be used for symbolication. The "-s" argument forces the script to symbolicate kernel stacks alone, which can be useful in conjunction with the "-k" argument to symbolicate kernel stacks on systems which differ from the one which generated the trace file. Note that symbolication is performed against currently running process images, so the script must be executed on the same (or identical) system for accuracy, and any processes of interest must be currently executing.
.El
.Sh SEE ALSO 
.\" List links in ascending order by section, alphabetically within a section.
.\" Please do not reference files that do not exist without filing a bug report
.Xr launchd 8
.Sh BUGS
Certain types of deadlocks (especially driver/kernel level deadlocks) may prevent
triggering
.Nm
when the hot-key combination is pressed.
.Pp
Depending upon the type of deadlock, there may be issues accessing the 
filesystem and/or network, preventing publication of the data once the
traces are gathered.
.Pp
The daemon makes a minimal effort to ensure that the log file has space 
allocated, and does no processing afterwards. The aforementioned 
.Xr ruby 1
script can be used to translate addresses to symbols. It is up to the user 
to examine the file (and perhaps send it off to someone for debugging) 
afterwards.
.Pp
The symbolication is not perfect, and may benefit from human scrutiny or
post-processing.
