MacOSX10.14.sdk/usr/share/man/man8/awacsd.8
.\" -*- tab-width: 4 -*-
.\" 
.\" Copyright (c) 2009-2014 Apple Inc. All Rights Reserved.
.\" 
.\"
.Dd July 2010           \" Date
.Dt awacsd 8         \" Document Title
.Os Darwin                  \" Operating System
.\"
.Sh NAME
.Nm awacsd
.Nd Apple Wide Area Connectivity Service daemon  \" Name Description for whatis database
.\" 
.Sh SYNOPSIS
.Nm Ar [-fuh] [-d logfile] [-t timer]
.\"
.Sh DESCRIPTION
.Nm
is an executable invoked by
.Nm launchd
to facilitate connections between devices using Back to My Mac. Users cannot invoke
.Nm
from the command line.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl f
Do not filter packets
.It Fl u
Do not attempt UDP hole punching
.It Fl h
Do not attempt TLS hostname verification
.It Fl d Ar \fBlogfile\fR
Log verbose debugging messages to the specified file.
.It Fl t Ar \fBtimer\fR
Set keepalive timer to specified number of seconds.
.El
.\"
.Sh FILES
.Pa /usr/libexec/awacsd \" Pathname
.Pp
.Pa /System/Library/LaunchDaemons/com.apple.awacsd.plist \" Pathname
.\"
.Sh HISTORY
.Nm
first appeared in Mac OS X 10.6.5.
