MacOSX10.14.sdk/usr/share/man/man8/deleted.8
.Dd 10 September, 2013
.Dt deleted 8
.Os Darwin
.Sh NAME
.Nm deleted
.Nd The purgeable space / cache management daemon.
.Sh DESCRIPTION
.Nm
is a system daemon that keeps track of purgeable space via registered services.
.Nm
listens for low-space events from the file system and attempts to avoid running out
of disk space by requesting that clients purge space.
.Nm
is not intended to be invoked directly.
.Sh FILES
.Bl -tag -width "/System/Library/CacheDelete" -compact
.It Pa /System/Library/CacheDelete
CacheDelete service definitions provided by Apple.
.El
.Sh SEE ALSO
.Xr launchctl 1 ,
.Xr launchd.plist 5
