MacOSX10.14.sdk/usr/share/man/man8/dpaudiothru.8
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.\"/usr/share/misc/mdoc.template
.Dd February 18, 2009       \" DATE 
.Dt dpaudiothru 8
.Os Darwin
.Sh NAME                 \" Section Header - required - don't modify 
.Nm dpaudiothru
.Nd Display Port audio tool.
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Sh DESCRIPTION          \" Section Header - required - don't modify
.Nm
Launched by dpd daemon to allow audio to play from host machine to target machine via display port.
.Nm
should only be run via dpd daemon.
.Pp                      \" Inserts a space
.Sh FILES                \" File used or created by the topic of the man page
.Bl -tag -width "/System/Library/LaunchDaemons/com.apple.dpd.plist" -compact
.It Pa /usr/libexec/dpaudiothru
the daemon
.It Pa /System/Library/LaunchDaemons/com.apple.dpd.plist
launchd configuration plist
.El
