MacOSX10.14.sdk/usr/share/man/man8/DumpPanic.8
.Dd March 06, 2017
.Dt DumpPanic 8
.Os macOS
.Sh NAME
.Nm DumpPanic
.Nd Writes panic reports
.Sh DESCRIPTION
.Nm
reads panic log information from the system and writes it into a panic report on disk.
The panic report is intended to help kernel engineers diagnose the cause of the panic and are submitted anonymously to Apple by the
.Nm SubmitDiagInfo
process.
The reports are used by Apple to improve its products.
Users who need support should use http://www.apple.com/support or other authorized support channels.
Developers who are ADC members should report bugs using http://bugreporter.apple.com in order to allow for two way communication between Apple and the bug reporter.
.Pp
.Nm
runs on every boot to check for evidence of a panic and exits cleanly if none is found.
.Pp
More information about interpreting the contents of panic logs can be found in Technote 2063: https://developer.apple.com/library/content/technotes/tn2063/_index.html
.Sh SEE ALSO
.Xr SubmitDiagInfo 8
