MacOSX10.14.sdk/usr/share/man/man8/fsck_apfs.8
.\" Copyright (c) 2015 - 2018 Apple Inc. All rights reserved.
.Dd March 6, 2018
.Dt FSCK_APFS 8
.Os "Mac OS X"
.Sh NAME
.Nm fsck_apfs
.Nd APFS consistency check
.Sh SYNOPSIS
.Nm fsck_apfs
.Op Fl q | n | y
.Op Fl l
.Op Fl s
.Op Fl S
.Op Fl o
.Ar device
.Sh DESCRIPTION
.Pp
The
.Nm
utility verifies and repairs APFS containers and volumes.
.Pp
.Nm
checks the specified APFS containers and volumes and tries to repair
all detected inconsistencies.
.Pp
Because of inconsistencies between the block device and the buffer
cache, the raw device should always be used.
.Pp
In its current state, fsck_apfs checks the integrity of various container
data structures.
.Pp
The options are as follows:
.Bl -hang -offset indent
.It Fl q
Causes
.Nm
to quickly check whether the volume is `clean'.
.It Fl n
Never attempt to repair any damage that is found.
.It Fl y
Always attempt to repair any damage that is found.
.It Fl l
Enable live verification mode. This makes it possible to check an APFS
container which is currently mounted read-write, although no
repairs can be made.
.It Fl s
Print space verification summary.
.It Fl S
Skip iteration of snapshots (top-level snapshot structures will still be checked), although no
repairs can be made.
.It Fl o
Repair overallocations; please do not run an older fsck_apfs on newer systems with this option.
.El
.Sh EXIT VALUES
.Nm
exits 0 on success, and >0 if error occurs.
.Sh SEE ALSO
.Xr fsck 8
.\".Sh BUGS
.\" .Nm
.\" is not able to fix some inconsistencies that it detects.
.\".Sh HISTORY
