MacOSX10.14.sdk/usr/share/man/man8/hdid.8
.Dd 16 Aug 2013
.Os "macOS"
.Dt hdid 8
.Sh NAME
.Nm hdid
.Nd historical mechanism for attaching disk images
.Sh SYNOPSIS
.Nm
.Op options
.Ar image
.Sh DESCRIPTION
Historically,
.Nm
was both the tool used to attach a disk image and the user process used
to load and decompress disk image data for the hard disk image (HDI)
driver in Mac OS X.
.Nm
exists only for backwards compatibility.
.Pp
As of Mac OS X 10.4,
.Nm
invokes
.Dl hdiutil attach -agent hdid
which causes
.Xr hdiutil 1
to behave like the historical 
.Nm .
For example, some of
.Sy hdiutil attach Ns 's
more modern behaviors (such as verifying images which haven't been verified
before) are disabled.
.Xr hdiutil 1
should be used instead of
.Nm .
.\"
.\" need to make sure this still works after we fix prompting ...
.\".B -stdinpass
.\"causes
.\".B hdid
.\"to read a null-terminated passphrase from its standard input.  ^@
.\"(control-@) can be typed to explicitly insert the terminator.  This option
.\"is designed for automation in which standard input would be attached
.\"to a file or pipe.
.\"
.Sh SEE ALSO
.Xr hdiutil 1
