MacOSX10.14.sdk/usr/share/man/man8/nbdst.8
.Dd 29 Apr 2003
.Os "macOS"
.Dt NBDST 8
.Pp
.Sh NAME
.Nm nbdst
.Nd NetBoot deferred shadow tool
.Sh SYNOPSIS
.Nm nbdst
.Op Fl recycle | Fl preallocate Ar size
.Ar devnode
.Ar shadowfile
.Sh DESCRIPTION
.Nm
is used during NetBoot to associate a shadow file with the disk
image being used as the root device. After the shadow file
is attached, subsequent writes to the root device will be
redirected to the shadow file, which normally resides on local
storage.
.Nm
is invoked by /etc/rc.netboot
.Sh ARGUMENTS
.Pp
The following arguments must be specified:
.Bl -tag -width "devnode012345" -compact
.It Ar devnode
The device node of the root device, in the form
.Qo disk0 Qc
.It Ar shadowfile
Path to a shadow file which will be created and associated
with the NetBoot root device
.El
.Sh OPTIONS
.Bl -tag -width "recycle "
.It Fl recycle
If a shadow file already exists, reset it and use it again.  Otherwise,
information written to an existing shadow file will reappear.  Reusing
a previous shadow file without resetting it requires that the shadow file
be created with the same base image.
.It Fl preallocate Ar size
Set the shadow file to the given size up front.  This forces a reset of
the shadow file (like
.Fl recycle Ns ")."
.El
.Sh NOTE
.Nm
can only be run as root.
.Sh SEE ALSO
.Ns Xr hdiutil 1 ,
.Ns Xr hdik 8
