MacOSX10.14.sdk/usr/share/man/man8/pkreporter.8
.Dd 6/22/14               \" DATE
.Dt pkreporter 8      \" Program name and manual section number
.Os Darwin
.Sh NAME                 \" Section Header - required - don't modify 
.Nm pkreporter
.Nd inventories and reports PlugIn state.
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Op Fl v
.Sh DESCRIPTION          \" Section Header - required - don't modify
.Nm
runs once per week to inventory and report PlugIn state.
.Pp
.Bl -tag -width -indent  \" Differs from above in tag removed
.It Fl v
Enable verbose output.
.El                      \" Ends the list
.Pp
.\" .Sh ENVIRONMENT      \" May not be needed
.\" .Bl -tag -width "ENV_VAR_1" -indent \" ENV_VAR_1 is width of the string ENV_VAR_1
.\" .It Ev ENV_VAR_1
.\" Description of ENV_VAR_1
.\" .It Ev ENV_VAR_2
.\" Description of ENV_VAR_2
.\" .El                      
.\" .Sh DIAGNOSTICS       \" May not be needed
.\" .Bl -diag
.\" .It Diagnostic Tag
.\" Diagnostic informtion here.
.\" .It Diagnostic Tag
.\" Diagnostic informtion here.
.\" .El
.Sh SEE ALSO 
.Xr pluginkit 8
.Xr xpc 3
.Sh BUGS              \" Document known, unremedied bugs 
None yet.
.Sh HISTORY           \" Document history if command behaves in a unique manner
pkreporter was first introduced in OS X 10.10.
