MacOSX10.14.sdk/usr/share/man/man8/printtool.8
.\"Copyright (c) 2016 Apple Inc. All rights reserved.
.\"
.Dd December 8, 2016
.Dt printtool 8
.Os "macOS"
.Sh NAME
.Nm printtool
.Nd a tool to perform privileged operations on the printing system
.Sh SYNOPSIS
\&\s-1NONE\s0 (launched by launchd)
.Sh DESCRIPTION
.Nm
acts as a privileged gateway between macOS applications and the printing system.
.Pp
This command is not intended to be invoked directly.
.Sh FILES
.Bl -tag -width -indent
.It Pa /System/Library/Frameworks/ApplicationServices.framework/Versions/A/Frameworks/PrintCore.framework/Versions/A/printtool
.El
.Sh SEE ALSO
.Xr launchd 8
.Sh HISTORY
.Nm
first appeared in macOS 10.4.
