MacOSX10.14.sdk/usr/share/man/man8/PrintUITool.8
.\"Copyright (c) 2016 Apple Inc. All rights reserved.
.\"
.Dd December 12, 2016
.Dt PrintUITool 8
.Os "macOS"
.Sh NAME
.Nm PrintUITool
.Nd a tool to perform privileged ui based operations on the printing system
.Sh SYNOPSIS
\&\s-1NONE\s0 (launched by launchd)
.Sh DESCRIPTION
.Nm
acts as a privileged gateway between macOS applications, the printing system, software update server and so on.
.Pp
This command is not intended to be invoked directly.
.Sh FILES
.Bl -tag -width -indent
.It Pa /System/Library/Frameworks/ApplicationServices.framework/Versions/A/Frameworks/PrintCore.framework/Versions/A/PrintUITool
.El
.Sh SEE ALSO
.Xr launchd 8
.Sh HISTORY
.Nm
first appeared in macOS 10.4.
