MacOSX10.14.sdk/usr/share/man/man8/rpcsvchost.8
.\"
.\" Copyright (c) 2009-2010 Apple Inc. All rights reserved.
.\"
.\" The following requests are required for all man pages.
.Dd Wed Nov  4 21:01:31 PST 2009
.Dt rpcsvchost 8
.Os Darwin
.Sh NAME
.Nm rpcsvchost
.Nd hosting environment for DCE/RPC services
.Sh SYNOPSIS
.Nm
.Op Cm options
.Ar service
.Op Ar service ...
.Sh DESCRIPTION
.Nm
is a very simple environment for hosting DCE/RPC services.
It loads DCE/RPC services from the list of plugins given as arguments,
binds to an appropriate set of endpoints and listens for protocol requests.
.Pp
If
.Ar service
is not a relative file name, it is assumed to be the name of a dylib located in
.Pa /usr/lib/rpcsvc .
.Sh OPTIONS
.Bl -tag -width -indent  \" Differs from above in tag removed
.It Fl debug, nodebug
.Nm
will log debug information and may perform extra
diagnostic checks. This option is typically only useful for debugging.
.It Fl endpoints Ar BINDING Op ,BINDING
This argument specifies additional endpoints that
.Nm
should attempt to bind.
.Ar BINDING
must be a comma-separated list of DCE/RPC binding strings that include both the
protocol sequence and endpoint fields.
.It Fl help
Prints a usage message and exits.
.\" The following requests should be uncommented and used where appropriate.
.It Fl launchd, nolaunchd
Normally,
.Nm
attempts to bind all the well-known endpoints specified by the service plugins.
If there are no well-known endpoints, it will bind new endpoints on all
supported protocol sequences. The
.Fl launchd
option disables this behavior and causes
.Nm
to check in with
.Xr launchd 8
to obtain a set of sockets to bind as protocol endpoints.
.Pp
Launchd sockets vended to
.Nm
must be named with the appropriate DCE/RPC protocol sequence (eg. "ncacn_np").
.It Fl sandbox, nosandbox
When this option is specified, the modules loaded by
.Nm
will be run in a sandbox.
.Nm
will attempt to intialize the sandbox using the sandbox profile with the name 
com.apple.<module-name>.sb. See
.Xr sandbox 7 
for an overview of the sandbox facility.
.It Fl register, noregister
When this option is specified,
.Nm
attempts to register the loaded services with the DCE/RPC endpoint mapper.
.It Fl stdout
Causes
.Nm
to print log messages to standard output instead of the system log.
.It Fl wait-for-debugger
Causes
.Nm
to wait for a debugger to attach after it has loaded and initialized its
plugins. This is useful for debugging instances of
.Nm
that are launched by
.Xr launchd 8 .
.El
.\" This next request is for sections 2 and 3 function return values only.
.\" .Sh RETURN VALUES
.\" This next request is for sections 1, 6, 7 & 8 only
.\" .Sh ENVIRONMENT
.\" .Sh FILES
.\" .Sh EXAMPLES
.Sh DIAGNOSTICS
.Ex -std rpcsvchost
.\" The next request is for sections 2 and 3 error and signal handling only.
.\" .Sh ERRORS
.Sh SEE ALSO
.Xr launchd.plist 5 ,
.Xr launchd 8 ,
.Xr sandbox 7
.\" .Sh STANDARDS
.Sh HISTORY
The
.Nm
utility first appeared in Mac OS 10.7.
.\" .Sh AUTHORS
.\" .Sh BUGS
