MacOSX12.0.sdk/usr/share/man/man8/coremotionlivabilityd.8
.Dd February 11, 2021
.Dt COREMOTIONLIVABILITYD 8
.Os Darwin
.Sh NAME
.Nm coremotionlivabilityd
.Nd The daemon responds to system events and scheduled timers to sample sensor data  and logs, and posts them back to Motion team.
.Sh SYNOPSIS
takes no arguments, and users should not launch it manually.
.Sh DESCRIPTION
The daemon responds to system events and scheduled timers to sample sensor data and logs, and posts them back to Motion team. This daemon will be internal-only, and launch-on-demand. Only users who explicitly install the companion App will launch the daemon, and once they delete the App, the daemon stops implementing data collection. Other users (internal or external) should never see the daemon launch or run. The data are used for validation and algorithm development of CoreMotion TLFs.
.Sh HISTORY
This is the first time this process is introduced to macOS.
