MacOSX12.0.sdk/usr/share/man/man8/endpointsecurityd.8
.\" Copyright (c) 2017 Apple Inc. All rights reserved.
.Dd 27 November, 2018
.Dt endpointsecurityd 8
.Os Darwin
.Sh NAME
.Nm endpointsecurityd
.Nd Daemon that manages user space components of the EndpointSecurity (ES) subsystem
.Sh DESCRIPTION
.Nm
is a daemon that manages ES components.
.Pp
Applications can also interact with
.Nm
and opt into ES functionality by utilizing the
.Xr libEndpointSecurity 3
library.
.Nm
is responsible for initializing and starting ES System Extensions, as well as
monitoring the health of ES clients and acting as a watchdog when necessary.
.Pp
You should not invoke
.Nm
directly.
.Sh FILES
.Bl -tag -width "/System"
.It Pa /System/Library/LaunchDaemons/com.apple.endpointsecurity.endpointsecurityd.plist
The
.Xr launchd.plist 5
controlling the
.Nm
job.
.El
.Sh SEE ALSO
.Xr EndpointSecurity 7 ,
.Xr libEndpointSecurity 3 ,
.Xr sysextd 8 ,
.Xr launchd.plist 5
