MacOSX11.1.sdk/usr/share/man/man1/avmediainfo.1
.\"Copyright (c) 2019 Apple Inc. All Rights Reserved.
.Dd Dec 18, 2019
.Dt AVMEDIAINFO 1
.Os "macOS"
.Sh NAME
.Nm avmediainfo
.Nd media analysis tool
.Sh SYNOPSIS
.Nm
<media_file>
<options>

.Sh DESCRIPTION
.Nm
is a tool that can be used to parse and analyze media files. It is capable of displaying generic information about the asset related to its tracks, metadata, format extensions, chunks, and samples. It also warns the user of any errors encountered while parsing the media file.
.It
<media_file> The media file to be analysed.
.It
<options> Use the options in order to display specific information regarding the asset.
.Pp
.Ed
.El
.Sh OPTIONS
.Pp
.Bl -tag -width "--metadata [metadataTypeOptions]" -offset indent -compact
.It Fl \-formatextensions
Displays format description extensions for each track.
.It Fl \-samples
Lists high level sample information for each track (Decode Time(stamp), Presentation Time(stamp), Duration, Offset, Size, Dependency) for QT/ISO movies.
.It Fl \-chunks
Lists high level chunk information (Index, Offset, Size, Sample Count, Sample Range, Start Time, Chunk Info) for QT/ISO movies.
.It Fl \-interleave
Shows the interleave by listing the chunks in offset order.
.It Fl \-integeroffsets
Displays all offsets as integers, instead of hex.
.It Fl \-brief
Displays a brief description of the movie.
.It Fl \-help
Show help.
.Ed
.It Fl \-metadata Ar [metadataTypeOptions]
Displays metadata information based on options provided.
Supported metadataType options:
.Bl -tag -width "metadataTypeOptions" -offset indent -compact
.It Sy asset
Displays metadata for the asset. (Default, if no options are provided).
.It Sy track
Displays metadata for each track.
.It Sy chapter
Displays the chapter metadata.
.It Sy all
Displays all available metadata.
.El
.It Fl \-mediatype Ar [mediatypeOptions]
Restricts which tracks have chunk and/or sample information displayed based on options provided.
Supported mediatype options:
.Bl -tag -width "metadataTypeOptions" -offset indent -compact
.It Sy audio
Displays info about audio tracks.
.It Sy video
Displays info about video tracks.
.It Sy closedcaption
Displays info about closedcaption tracks.
.It Sy metadata
Displays info about temporal metadata tracks.
.It Sy subtitle
Displays info about subtitle tracks.
.It Sy text
Displays info about text tracks.
.It Sy timecode
Displays info about timecode tracks.

.El
.Sh EXAMPLES
.Pp
Display all the samples and chunks for the video tracks in a media file:
.Pp
	avmediainfo /tmp/myTestMovie.mov --samples --chunks --mediatype video
.Pp
Show the interleaving order across chunks, and display all the track level metadata for a media file:
.Pp
	avmediainfo /tmp/myTestMovie.m4v --interleave --metadata track
.Sh HISTORY
.Nm
command first appeared in Mac OS X 10.16.
