MacOSX11.1.sdk/usr/share/man/man1/sntp.1
.Dd 8/4/10
.Dt SNTP 1 
.Os Darwin
.Sh NAME 
.Nm sntp
.Nd A very Simple Network Time Protocol client program
.Sh SYNOPSIS
.Nm
.Op Fl drSs
.Op Fl g Ar milliseconds
.Op Fl t Ar seconds
.Ar host-name-or-IP
.Sh DESCRIPTION
.Bl -tag -width -indent 
.It Fl d
Enable debug logging.
.It Fl g Ar milliseconds
Gap betwen requests in milliseconds.
.It Fl r
bind(2) the NTP reserved port (123) for source communications.
.It Fl S
Use settimeofday(2) to set the system clock if the offset is greater than 50 milliseconds.
.It Fl s
Use adjtime(2) to slew the system clock if the offset is less than 50 milliseconds.
.It Fl t Ar seconds
Maximum number of seconds to wait for responses.
.El
.Pp
.Sh USAGE
.Bl -tag -width indent
.It Li "sntp pool.ntp.org"
.El
.Sh SEE ALSO 
.Xr settimeofday 2 , 
.Xr adjtime 2 ,
.Xr timed 8 ,
.Sh HISTORY
This
.Nm
should not be confused with the Network Time Foundation's
.Nm
implementation. This is a simplified client that supports a minimal subset of
features for compatibility.
.Pp
This
.Nm
first appeared in macOS 10.16.
