MacOSX10.13.sdk/usr/share/man/man8/AssetCacheTetheratorUtil.8
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.\"See Also:
.\"man mdoc.samples for a complete listing of options
.\"man mdoc for the short list of editing options
.\"/usr/share/misc/mdoc.template
.Dd 10/24/16               \" DATE 
.Dt AssetCacheTetheratorUtil 8      \" Program name and manual section number 
.Os "macOS"
.Sh NAME                 \" Section Header - required - don't modify 
.Nm AssetCacheTetheratorUtil
.\" The following lines are read in generating the apropos(man -k) database. Use only key
.\" words here as the database is built based on the words here and in the .ND line. 
.\" .Nm Other_name_for_same_program(),
.\" .Nm Yet another name for the same program.
.\" Use .Nm macro to designate other names for the documented program.
.Nd control networking of tethered devices
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Op -j|--json
.Ar enable
.Op --duration seconds
.Ar --first address
.Ar --last address
.Ar --server path
.Nm
.Op -j|--json
.Ar disable
.Nm
.Op -j|--json
.Ar isEnabled
.Nm
.Op -j|--json
.Ar status
.Sh DESCRIPTION          \" Section Header - required - don't modify
iOS and tvOS devices connected to a computer with a USB cable can be "tethered,"
so that they route their Internet requests through the computer.
.Nm
enables a tethered network (perhaps for a specified number of seconds), disables it, or reports on its status.
.Nm
must be run by root, except for the isEnabled and status commands.
.Sh OPTIONS
.Bl -tag
.It -j|--json
Print results in machine-parseable JSON format to stdout.
.It --duration seconds
Automatically tear down the tether after a specified amount of time.
.It --first address
.It --last address
The first and last IPv4 addresses, in dot notation, to use for the tethered network.
The gateway -- the tethering Mac -- will have the first address.
.It --server path
The path to a plist specifying the tethered caching server.
The plist must be a dictionary with the following keys and values:
.Bl -tag
.It capabilities dictionary
A set of capabilities that the caching server supports.
.It guid string
The caching server's ServerGUID.
.It port number
The port number on which the caching server accepts requests.
.El
.El
.Sh "SEE ALSO"
.Ns Xr AssetCacheLocatorUtil 8 ,
.Ns Xr AssetCacheManagerUtil 8
