MacOSX10.13.sdk/usr/share/man/man8/atsutil.8
.\""Copyright (c) 2007-2008 Apple, Inc. All Rights Reserved.
.Dd 2008-12-06
.Dt atsutil 8
.Os Mac OS X
.Sh NAME
.Nm atsutil
.Nd font registration system utility
.\" -------------------------SYNOPSIS SECTION-------------------------
.Sh SYNOPSIS
.Nm atsutil
.Sy autoactivation
.Op Fl DdeaRh
.Op Ar path
.br
.Nm
.Sy databases
.Op Fl remove | Fl removeUser
.br
.Nm
.Sy fontprotection
.Op Fl on | Fl off
.Op Fl get
.Op Fl files
.Op Fl fonts
.br
.Nm
.Sy server
.Op Fl ping | Fl shutdown
.br
.Nm
.Sy help
.\" -------------------------DESCRIPTION SECTION-------------------------
.Sh DESCRIPTION
.Nm
tool controls some aspects of the font registration system.  It may be used to 
modify font auto activation settings, font protection settings, remove font registration databases
and caches, or restart the font registration daemon.
.Pp
.Sy autoactivation
modifies font auto activation settings globally or for a specific application.
.Pp
.Sy databases 
will remove fontd System or User databases along with any cache files. Removing databases may cause
the loss of font registration state: fonts activated outside the standard font directories, font 
faces disabled, and font libraries. New databases will be regenerated from fonts installed the 
standard font directories after the user logs out, restarts, or the fontd server is restarted.
.Pp
.Sy fontprotection
overrides System font protection settings.
.Pp
.Sy server
queries the status of fontd or shutdowns the fontd.  Shutting down the fontd will spawn a new fontd.
Shutting down the server is NOT recommended and will likely lead to misrendered text or application
crashes.
.\" -------------------------OPTIONS SECTION-------------------------
.Sh OPTIONS
.\" -------------------------Auto Activation-------------------------
.Sy autoactivation Op Fl DdeaRh
.Op Ar path
.br
.Fl D
set font auto activation setting to default.
.br
.Fl d
is specified, then set font auto activation setting to disabled.
.br
.Fl e
is specified, then set font auto activation setting to enabled.
.br
.br
.Fl R
is specified, then reset font auto activation setting to default.
.br
.Fl h
is specified, then display help information.
.br
.Fl path
with options is specified, then set font auto activation setting locally for application.  Otherwise,
setting is global in scope.
.Pp
Note,  
.Sy path
without options will return current font auto activation setting for application.
.Pp
.\" -------------------------Databases-------------------------
.Sy databases Op Fl remove | removeUser
.br
.Fl remove
remove fontd databases for active user and system (used when no one is logged in and some background processes).
.br
.Fl removeUser
remove fontd databases for the active user only.
.Pp
.\" -------------------------Font Protection-------------------------
.Sy fontprotection Op Fl on | off
.Op Fl get
.Op Fl files
.Op Fl fonts
.br
.Fl on
enable System font protection.
.br
.Fl off
disable System font protection.
.br
.Fl get
return System font protection setting.
.br
.Fl files
prints list of protected font files.
.br
.Fl fonts
prints list of protected font faces (Postscript names).
.Pp
.\" -------------------------Server-------------------------
.Sy server Op Fl ping | shutdown
.br
.Fl ping
query running fontd.
.br
.Fl shutdown
shutdown fontd and spawn a new fontd. NOTE: this action is not recommended. See above.
.Sh SEE ALSO
.Xr fontd 8
.Sh HISTORY
\fBatsutil\fR first appeared in MacOS X 10.5.
