MacOSX10.13.sdk/usr/share/man/man8/automount.8
.Dd July 17, 2010
.Os Darwin
.Dt AUTOMOUNT 8
.Sh NAME
.Nm automount
.Nd mount autofs on the appropriate mount points
.Sh SYNOPSIS
.Nm automount
.Op Fl v
.Op Fl c
.Op Fl u
.Op Fl t Ar timeout
.Sh DESCRIPTION
.Nm
reads the
.Pa /etc/auto_master
file, and any local or network maps it includes, and mounts autofs on
the appropriate mount points to cause mounts to be triggered.  It will
also attempt to unmount any top-level autofs mounts that correspond to
maps no longer found.
.Sh OPTIONS
.Bl -tag -width Ds
.It Fl v
Print more detailed information about actions taken by
.Nm .
.It Fl c
Tell
.Xr automountd 8
to flush any cached information it has.
.It Fl u
Unmount all non-busy automounted mounts.
Top-level triggers are preserved.
.It Fl t Ar timeout
Set to
.Ar timeout
seconds the time after which an automounted file system will be
unmounted if it hasn't been referred to within that period of time.  The
default is 10 minutes (600 seconds).
.El
.Sh FILES
.Bl -tag  -width Ds
.It Pa /etc/autofs.conf
configuration file for automount and automountd.
.It Pa /etc/auto_master
The master map contains a list of directories to be controlled
by autofs and their associated direct map or indirect maps.
.El
.Sh SEE ALSO
.Xr auto_master 5 ,
.Xr automountd 8 ,
.Xr autofs.conf 5
