MacOSX10.13.sdk/usr/share/man/man8/defragcli.8
.Dd June 20, 2016
.Dt DEFRAGCLI 8
.Os Darwin
.Sh NAME
.Nm defragcli
.Nd targeted userspace defragmentation tool
.Sh SYNOPSIS
.Nm
.Op Fl dfh
.Op Fl c Ar file
.Op Fl t Ar seconds
.Op Fl u Ar userid
.Sh DESCRIPTION
.Nm
allows the super-user to trigger targeted defragmentation of files specified by
a defragmentation configuration file.
.Sh ARGUMENTS
.Bl -tag -width -indent
.It Fl d
Dry mode, will not adjust kernel parameters
.It Fl f
Force defragmentation attempt even on mounts that do not normally qualify
.It Fl c
Path to a defragmentation configuration plist file
.It Fl t
Maximum time for
.Nm
to run before stopping
.It Fl u
User ID of user's home directory to defragment, default is current user if run
via elevation (e.g. sudo(8))
.El
.Sh FILES
.Bl -tag -width "/var/db/defragx.plist" -compact
.It Pa /usr/sbin/defragcli
this binary
.It Pa /var/db/defragx.plist
defragmentation configuration plist
.El
.Sh SEE ALSO
.Xr defragx 8
