MacOSX10.13.sdk/usr/share/man/man8/fsck_apfs.8
.\" Copyright (c) 2015 Apple Inc. All rights reserved.
.Dd December 3, 2015
.Dt FSCK_APFS 8
.Os "Mac OS X"
.Sh NAME
.Nm fsck_apfs
.Nd APFS consistency check
.Sh SYNOPSIS
.Nm fsck_apfs
.Op Fl q | n | y
.Op Fl l
.Ar device
.Sh DESCRIPTION
.Pp
The
.Nm
utility verifies and repairs APFS containers and volumes.
.Pp
.Nm
checks the specified APFS containers and volumes and tries to repair
all detected inconsistencies.
.Pp
Because of inconsistencies between the block device and the buffer
cache, the raw device should always be used.
.Pp
In its current state, fsck_apfs checks the integrity of various container
data structures. We do not check for overlapping allocations.
.Pp
The options are as follows:
.Bl -hang -offset indent
.It Fl l
Lock down the file system for a verify-only check.  This makes it
possible to check a file system that is currently mounted, although no
repairs can be made.
.It Fl q
Causes
.Nm
to quickly check whether the volume is `clean'.
.It Fl n
Never attempt to repair any damage that is found.
.It Fl y
Always attempt to repair any damage that is found.
.El
.Sh EXIT VALUES
.Nm
exits 0 on success, and >0 if error occurs.
.Sh SEE ALSO
.Xr fsck 8
.\".Sh BUGS
.\" .Nm
.\" is not able to fix some inconsistencies that it detects.
.\".Sh HISTORY
