MacOSX10.13.sdk/usr/share/man/man8/mount_cddafs.8
.Dd January 31, 2002
.Dt MOUNT_CDDAFS 8
.Os Darwin
.Sh NAME
.Nm mount_cddafs
.Nd mount an Audio CD
.Sh SYNOPSIS
.Nm mount_cddafs
.Op Fl o Ar options
.Ar special
.Ar node
.Sh DESCRIPTION
The
.Nm mount_cddafs
command attaches the CDDA filesystem residing on the device
.Pa special
to the global filesystem namespace at the location indicated by
.Pa node .
This command is normally executed by
.Xr mount 8
at boot time.
.Pp
The options are as follows:
.Bl -tag -width indent
.It Fl o
Options are specified with a
.Fl o
flag followed by a comma separated string of options.
See the
.Xr mount 8
man page for possible options and their meanings.
.El
.Sh SEE ALSO
.Xr mount 2 ,
.Xr unmount 2 ,
.Xr mount 8
.Sh HISTORY
The
.Nm mount_cddafs
utility first appeared in MacOS X Public Beta