MacOSX10.9.sdk/usr/share/man/man8/chkpasswd.8
.Dd July 20, 2004
.Dt CHKPASSWD 8
.Os Darwin
.Sh NAME
.Nm chkpasswd
.Nd verifies user password against various systems
.Sh SYNOPSIS
.Nm chkpasswd
.Op Fl i Ar infosystem Op Fl l Ar location
.Op Fl c
.Op Ar name
.Sh DESCRIPTION
.Nm chkpasswd
verifies a supplied username and password against file, NIS,
or OpenDirectory infosystems.
.Pp
The options are as follows:
.Bl -tag -width Ds
.\" ==========
.It Fl c
The supplied password is compared verbatim without first being encrypted.
.\" ==========
.It Fl i Ar infosystem
Specify the system against which to check the password
(default is PAM). Valid systems:
.Bl -tag -width "opendirectory"
.It Ar file
File-based passwords
.It Ar nis
NIS/YP authentication
.It Ar opendirectory
OpenDirectory (Directory Services) authentication.
If no
.Fl l
option is specified, the search node is used.
.It Ar PAM
Pluggable Authentication Modules
.El
.Pp
.\" ==========
.It Fl l Ar location
Specify a location; varies based on infosystem type:
.Bl -tag -width "for opendirectory"
.It for file
Filename (default: /etc/master.passwd).
.It for nis
NIS domainname.
.It for opendirectory
A directory node name such as /Local/Default.
.It for PAM
Unused.
.El
.Pp
.El
.Ar name
username
.Sh SEE ALSO
.Xr dscl 1 ,
.Xr passwd 5
