MacOSX10.9.sdk/usr/share/man/man8/corestoraged.8
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.\"man mdoc for the short list of editing options
.\"/usr/share/misc/mdoc.template
.Dd April 8th, 2010
.Dt CORESTORAGED 1
.Os "Mac OS X"
.Sh NAME
.Nm corestoraged
.Nd CoreStorage volume manager
.Sh SYNOPSIS
.Nm
.Sh DESCRIPTION
.Nm
manages CoreStorage volumes.  It is invoked by
.Xr launchd 8
when a CoreStorage volume needs management.
.Pp
.Sh FILES
.Pa /System/Library/LaunchDaemons/com.apple.corestorage.corestoraged.plist
.Sh SEE ALSO 
.Xr diskutil 8
.\" .Sh BUGS              \" Document known, unremedied bugs 
.\" .Sh HISTORY           \" Document history if command behaves in a unique manner 
