MacOSX10.9.sdk/usr/share/man/man8/docsetbless.8
.\" Copyright (c) 2007 Apple, Inc.
.\" All rights reserved.
.\"
.\" to preview: /usr/bin/nroff -msafer -mandoc docsetbless.8 | less
.\"
.Dd March 2, 2007
.Dt docsetbless 8
.Os Mac OS X
.Sh NAME
.Nm docsetbless 
.Nd Documentation set installation blesser
.Sh SYNOPSIS
.Nm
.Sh DESCRIPTION
.Nm docsetbless 
is used by Apple's developer tools to prepare locations for documentation set installation.
.Pp
.Sh FILES
.Bl -tag -width "/usr/libexec/docsetbless" -compact
.It Pa /usr/libexec/docsetbless
Executable
.It Pa /etc/devdocsets
Configuration file of blessed locations
.El
.Sh SEE ALSO 
.Xr docsetutil 1 
