MacOSX10.9.sdk/usr/share/man/man8/emond.8
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.\"See Also:
.\"man mdoc.samples for a complete listing of options
.\"man mdoc for the short list of editing options
.\"/usr/share/misc/mdoc.template
.\" test using groff -man emond.8 -T ascii | more
.Dd 2/18/08               \" DATE 
.Dt emond 8      \" Program name and manual section number 
.Os Darwin
.Sh NAME                 \" Section Header - required - don't modify 
.Nm emond
.\" The following lines are read in generating the apropos(man -k) database. Use only key
.\" words here as the database is built based on the words here and in the .ND line. 
.Nd Event Monitor Daemon
.\" Use .Nm macro to designate other names for the documented program.
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Op Fl r Ar path         \" [-r path] 
.Op Fl c Ar path         \" [-c path] 
.Sh DESCRIPTION          \" Section Header - required - don't modify
.Nm
accepts events from various services, runs them through a simple rules engine, and takes action. The actions can run commands; send email,  
or SMS messages.
.Pp                      \" Inserts a space
Options:
.Bl -tag -width -indent  \" Differs from above in tag removed 
.It Fl r Ar path_to_rules                \"-a flag as a list item
Tells
.Nm
to look for rules files in the specified path. The path may refer to either a file or a directory. If the path refers to a
directory, then all files with a .plist extension in that directory will be loaded.
.It Fl c Ar path_to_config 
Tells
.Nm
to look in specified path for its config file.
.El                      \" Ends the list
.Pp
.\" .Sh ENVIRONMENT      \" May not be needed
.\" .Bl -tag -width "ENV_VAR_1" -indent \" ENV_VAR_1 is width of the string ENV_VAR_1
.\" .It Ev ENV_VAR_1
.\" Description of ENV_VAR_1
.\" .It Ev ENV_VAR_2
.\" Description of ENV_VAR_2
.\" .El                      
.Sh FILES                \" File used or created by the topic of the man page
.Bl -tag -width "/Users/joeuser/Library/really_long_file_name" -compact
.It Pa /etc/emond.d/rules/
Default directory where
.Nm
looks for rules.
.It Pa /etc/emond.d/emond.plist
the plist formatted config file
.It Pa /System/Library/LaunchDaemons/com.apple.emond.plist
the launchd config file
.El                      \" Ends the list
.\" .Sh DIAGNOSTICS       \" May not be needed
.\" .Bl -diag
.\" .It Diagnostic Tag
.\" Diagnostic informtion here.
.\" .It Diagnostic Tag
.\" Diagnostic informtion here.
.\" .El
.Sh SEE ALSO 
.\" List links in ascending order by section, alphabetically within a section.
.\" Please do not reference files that do not exist without filing a bug report
.Xr emond.plist 5 ,
.Xr	distnoted 8 ,
.Xr emlog.pl 8 ,
.Xr launchd 8 ,
.Xr xssendevent 8  
.\" .Sh BUGS              \" Document known, unremedied bugs 
.\" .Sh HISTORY           \" Document history if command behaves in a unique manner