MacOSX10.9.sdk/usr/share/man/man8/hostinfo.8
.\" Copyright (c) 2003-2009 Apple Inc. All rights reserved.
.\" 
.\" The contents of this file constitute Original Code as defined in and
.\" are subject to the Apple Public Source License Version 1.1 (the
.\" "License").  You may not use this file except in compliance with the
.\" License.  Please obtain a copy of the License at
.\" http://www.apple.com/publicsource and read it before using this file.
.\" 
.\" This Original Code and all software distributed under the License are
.\" distributed on an "AS IS" basis, WITHOUT WARRANTY OF ANY KIND, EITHER
.\" EXPRESS OR IMPLIED, AND APPLE HEREBY DISCLAIMS ALL SUCH WARRANTIES,
.\" INCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY,
.\" FITNESS FOR A PARTICULAR PURPOSE OR NON-INFRINGEMENT.  Please see the
.\" License for the specific language governing rights and limitations
.\" under the License.
.\" 
.\"     @(#)hostinfo.1
.Dd October 30, 2003               \" DATE 
.Dt hostinfo 8      \" Program name and manual section number 
.Os "Mac OS X"
.Sh NAME                 \" Section Header - required - don't modify 
.Nm hostinfo
.\" The following lines are read in generating the apropos(man -k) database. Use only key
.\" words here as the database is built based on the words here and in the .ND line. 
.\" Use .Nm macro to designate other names for the documented program.
.Nd host information
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Sh DESCRIPTION          \" Section Header - required - don't modify
The
.Nm
command displays information about the host system on which the command is executing.
The output includes
a  kernel version description,
processor configuration data,
available physical memory,
and various scheduling statistics.
.Pp
.Sh OPTIONS
There are no options.
.Sh DISPLAY
.Pp
.Bl -ohang -width Primary_memory_available_ -offset indent
.It Mach kernel version:
The version string compiled into the kernel executing on the host system.
.Pp
.It Processor Configuration:
The maximum possible processors for which the kernel is configured, 
followed by the number of physical and logical processors available.
.Pp
Note: on Intel architectures, physical processors are referred to as cores, and 
logical processors are referred to as hardware threads; there may be multiple
logical processors per core and multiple cores per processor package.
This command does not report the number of processor packages.
.Pp
.It Processor type:
The host's processor type and subtype.
.Pp
.It Processor active:
A list of active processors on the host system.
Active processors are members of a processor set and are ready to 
dispatch threads.
On a single processor system, the active processor, is processor 0.
.Pp
.It Primary memory available:
The amount of physical memory that is configured for use on the host system.
.Pp
.It Default processor set:
Displays the number of tasks currently assigned to the host processor set,
the number of threads currently assigned to the host processor set,
and the number of processors included in the host processor set.
.Pp
.It Load average:
Measures the average number of threads in the run queue.
.Pp
.It Mach factor:
A variant of the load average which measures 
the processing resources available to a new thread.
Mach factor is based on the number of CPUs divided by (1 + the number of runnablethreads)
or 
the number of CPUs minus the number of runnable threads when the number of runnable threads
is less than the number of CPUs.
The closer the Mach factor value is to zero, the higher the load.
On an idle system with a fixed number of active processors, the mach factor will be equal to the number of CPUs.
.El
.Sh SEE ALSO 
.\" List links in ascending order by section, alphabetically within a section.
.Xr sysctl 8
.\" .Sh BUGS              \" Document known, unremedied bugs 
