MacOSX10.9.sdk/usr/share/man/man8/ioalloccount.8
.\"
.\" Copyright (c) 2000-2008 Apple Computer, Inc.  All rights reserved.
.\"
.\"	$Id: ioalloccount.8,v 1.4 2004/10/22 23:39:09 dreece Exp $
.\"
.Dd November 06, 2008
.Dt IOALLOCCOUNT 8
.Os Darwin
.Sh NAME
.Nm ioalloccount
.Nd Summarize IOKit memory usage.
.Sh SYNOPSIS
.Nm
.Sh DESCRIPTION
.Nm
displays some accounting of memory allocated by IOKit allocators,
including object instances, in the kernel.
.Pp
This information is useful for tracking leaks.
Instance counts can also found in the root of the IORegistry
in the
.Dq IOKitDiagnostics
property.
.Sh EXAMPLES
.Bl -tag -width findx
.It Li "ioalloccount"
   Instance allocation = 0x0022c718 = 2225 K
  Container allocation = 0x00141bad = 1286 K
   IOMalloc allocation = 0x00638221 = 6368 K
   Pageable allocation = 0x00f4f000 = 15676 K
.El
.Sh SEE ALSO
.Xr ioclasscount 8 ,
.Xr ioreg 8
