MacOSX10.9.sdk/usr/share/man/man8/notifyd.8
.Dd March 24, 2003
.Dt notifyd 8
.Os "Mac OS X"
.Sh NAME
.Nm notifyd
.Nd notification server
.Sh SYNOPSIS
.Nm
.Op Fl d Ar service_name
.Op Fl v
.Op Fl shm_pages Ar npages
.Op Fl no_restart
.Sh DESCRIPTION
.Nm
is the server for the Mac OS X notification system described in
.Xr notify 3 .
The server is usually started automatically during system startup, and is not run from the command line.
.Pp
The
.Fl d
option causes 
.Nm 
to run in a debugging mode.
It registers its mach port with the given service name.
It will stay attached to the terminal and print verbose log messages to the terminal.
.Pp
The 
.Fl v
option causes 
.Nm 
to produce verbose logging information.
.Pp
The 
.Fl shm_pages Ar npages
option sets the number of shared memory pages used for passive notification.
The default is one page.
If a value of zero is specified, shared memory is disabled, and passive notifications are performed using IPC between the client and the server.
.Pp
The 
.Fl no_restart
option causes
.Nm
to register as a non-restartable server with
.Xr mach_init .
.Sh SEE ALSO
.Xr notify 3 .
