MacOSX10.9.sdk/usr/share/man/man8/pam_group.8
.\" Copyright (c) 2003 Networks Associates Technology, Inc.
.\" All rights reserved.
.\" Copyright (c) 2008-2009 Apple Inc. All rights reserved.
.\"
.\" Portions of this software were developed for the FreeBSD Project by
.\" ThinkSec AS and NAI Labs, the Security Research Division of Network
.\" Associates, Inc.  under DARPA/SPAWAR contract N66001-01-C-8035
.\" ("CBOSS"), as part of the DARPA CHATS research program.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote
.\"    products derived from this software without specific prior written
.\"    permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD: src/lib/libpam/modules/pam_group/pam_group.8,v 1.3 2004/07/02 23:52:17 ru Exp $
.\"
.\" Protions copyright (c) 2009 Apple Inc. All rights reserved.
.\"
.Dd February 7, 2009
.Dt pam_group 8
.Os
.Sh NAME
.Nm pam_group
.Nd Group PAM module
.Sh SYNOPSIS
.Op Ar service-name
.Ar function-class
.Ar control-flag
pam_group
.Op Ar options
.Sh DESCRIPTION
The Group PAM module supports the account management function class.  In terms of the
.Ar function-class
parameter, this is the
.Dq Li account
class.
.Pp
The Group account management module permits or denies users based on their membership to a particular group
.Pq or groups
specified with the 
.Cm group
option.  If no groups are specified the default group
.Pq Dq wheel
will be used.
.Pp
The following options may be passed to this account management module:
.Bl -tag
.It Cm deny
Reverse the meaning of the test, i.e., reject the applicant if and only if he or she is a member of the specified group.  This can be useful to exclude certain groups of users from certain services.
.It Cm fail_safe
If the specified group does not exist, or has no members, act as if it does exist and the applicant is a member.
.It Cm group=groupname
Specify the name of the group to check.  This can be a comma-separated list 
.Pq i.e. Dq group=admin,wheel .
.It Cm root_only
Skip this module entirely if the target account is not the superuser account.
.It Cm ruser
Check the membership of the applicant
.Pq PAM_RUSER ,
rather than the target account 
.Pq PAM_USER
.
.El
.Sh SEE ALSO
.Xr pam_get_item 3 ,
.Xr pam.conf 5 ,
.Xr pam 8 ,
.Xr DirectoryService 8
.Sh AUTHORS
The
.Nm
module and this manual page were developed for the
.Fx
Project by
ThinkSec AS and NAI Labs, the Security Research Division of Network
Associates, Inc.\& under DARPA/SPAWAR contract N66001-01-C-8035
.Pq Dq CBOSS ,
as part of the DARPA CHATS research program.
