MacOSX10.9.sdk/usr/share/man/man8/pkd.8
.Dd 2/8/13               \" DATE
.Dt pkd 8      \" Program name and manual section number
.Os Darwin
.Sh NAME                 \" Section Header - required - don't modify 
.Nm pkd
.Nd PlugInKit, pluginkit, plugin
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Op Fl d Ar database
.Op Fl vW
.Sh DESCRIPTION          \" Section Header - required - don't modify
.Nm
manages plug-ins for the PlugInKit subsystem. It is a classic launch agent managed by launchd.
.Pp
.Bl -tag -width -indent  \" Differs from above in tag removed
.It Fl d Ar database
Use an alternate registry database file at the given location.
.It Fl v
Ask pkd to log more verbosely to the system log.
.It Fl W
Asks
.Nm
to write the location of this user's PlugInKit directory to stdout and exit.
This is the directory containing all per-user PlugInKit data.
.El                      \" Ends the list
.Pp
.\" .Sh ENVIRONMENT      \" May not be needed
.\" .Bl -tag -width "ENV_VAR_1" -indent \" ENV_VAR_1 is width of the string ENV_VAR_1
.\" .It Ev ENV_VAR_1
.\" Description of ENV_VAR_1
.\" .It Ev ENV_VAR_2
.\" Description of ENV_VAR_2
.\" .El                      
.Sh FILES                \" File used or created by the topic of the man page
.Bl -tag -width "PlugInKit/Registry" -compact
.It Pa PlugInKit/Registry
Inside the user's posix cache directory (as returned by confstr(3)), contains the user's current plugin registry.
.El                      \" Ends the list
.\" .Sh DIAGNOSTICS       \" May not be needed
.\" .Bl -diag
.\" .It Diagnostic Tag
.\" Diagnostic informtion here.
.\" .It Diagnostic Tag
.\" Diagnostic informtion here.
.\" .El
.Sh SEE ALSO 
.Xr pluginkit 1
.Xr xpc 3
.Sh BUGS              \" Document known, unremedied bugs 
None yet.
.Sh HISTORY           \" Document history if command behaves in a unique manner
Pkd was first introduced in OS X 10.9.
