MacOSX10.9.sdk/usr/share/man/man8/pluginkit.8
.Dd 2/29/13               \" DATE
.Dt pluginkit 8      \" Program name and manual section number
.Os Darwin
.Sh NAME                 \" Section Header - required - don't modify 
.Nm pluginkit
.Nd plugin pluginkit
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Op Fl m
.Op Fl Lv
.Op Ar key=value
.Op Ar
.br
.Nm
.Op Fl ar
.Op Fl v
.Op Ar
.Sh DESCRIPTION          \" Section Header - required - don't modify
.Nm
manages the
.Ar PlugInKit
subsystem for the current user. It can query for plugin matches,
as well as explicitly change the plugin database.
.Pp
A list of flags and their descriptions:
.Bl -tag -width -indent  \" Differs from above in tag removed 
.It Fl a
Explicitly adds plugins at the file location(s) given.
.It Fl l
When matching plugins, requests only the latest version of each plugin.
By default, all known versions are shown.
.It Fl r
Explicitly removes plugins at the file location(s) given. Note that automatic discovery
procedures may add them back if they are still present.
.It Fl -raw
Present replies from the management daemon (pkd) in raw XML form. This is primarily useful for debugging.
.It Fl v
Asks for more verbose operation.
.El                      \" Ends the list
.Pp
.\" .Sh ENVIRONMENT      \" May not be needed
.\" .Bl -tag -width "ENV_VAR_1" -indent \" ENV_VAR_1 is width of the string ENV_VAR_1
.\" .It Ev ENV_VAR_1
.\" Description of ENV_VAR_1
.\" .It Ev ENV_VAR_2
.\" Description of ENV_VAR_2
.\" .El                      
.\".Sh FILES                \" File used or created by the topic of the man page
.\".Bl -tag -width "/Users/joeuser/Library/really_long_file_name" -compact
.\".It Pa /usr/share/file_name
.\"FILE_1 description
.\".It Pa /Users/joeuser/Library/really_long_file_name
.\".El                      \" Ends the list
.\" .Sh DIAGNOSTICS       \" May not be needed
.\" .Bl -diag
.\" .It Diagnostic Tag
.\" Diagnostic informtion here.
.\" .It Diagnostic Tag
.\" Diagnostic informtion here.
.\" .El
.Sh SEE ALSO 
.Xr pkd 8 ,
.Xr launchd 8
.\" .Sh BUGS              \" Document known, unremedied bugs
.Sh HISTORY           \" Document history if command behaves in a unique manner
The
.Nm
command first appeared in OS X 10.9.
