MacOSX10.9.sdk/usr/share/man/man8/ptmd.8
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.\"See Also:
.\"man mdoc.samples for a complete listing of options
.\"man mdoc for the short list of editing options
.\"/usr/share/misc/mdoc.template
.Dd 6/29/09               \" DATE 
.Dt ptmd 8      \" Program name and manual section number 
.Os Darwin
.Sh NAME                 \" Section Header - required - don't modify 
.Nm ptmd
.\" The following lines are read in generating the apropos(man -k) database. Use only key
.\" words here as the database is built based on the words here and in the .ND line. 
.\".Nm Platform Thermal Monitor Daemon.
.\" Use .Nm macro to designate other names for the documented program.
.Nd platform thermal monitor daemon.
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.\".Op Fl abcd              \" [-abcd]
.\".Op Fl a Ar path         \" [-a path] 
.\".Op Ar file              \" [file]
.\".Op Ar                   \" [file ...]
.\".Ar arg0                 \" Underlined argument - use .Ar anywhere to underline
.\"arg2 ...                 \" Arguments
.Sh DESCRIPTION          \" Section Header - required - don't modify
The 
.Nm
daemon is automatically launched via its LaunchDaemon configuration
file. On platforms that require its services 
.Nm
stays running. On other platforms 
.Nm
starts and then exits. While running 
.Nm
relays to hardware any OS notifications effecting thermal conditions.
.\"Underlining is accomplished with the .Ar macro like this:
.\".Ar underlined text .
.\".Pp                      \" Inserts a space
.\"A list of items with descriptions:
.\".Bl -tag -width -indent  \" Begins a tagged list 
.\".It item a               \" Each item preceded by .It macro
.\"Description of item a
.\".It item b
.\"Description of item b
.\".El                      \" Ends the list
.\".Pp
.\"A list of flags and their descriptions:
.\".Bl -tag -width -indent  \" Differs from above in tag removed 
.\".It Fl a                 \"-a flag as a list item
.\"Description of -a flag
.\".It Fl b
.\"Description of -b flag
.\".El                      \" Ends the list
.\".Pp
.\" .Sh ENVIRONMENT      \" May not be needed
.\" .Bl -tag -width "ENV_VAR_1" -indent \" ENV_VAR_1 is width of the string ENV_VAR_1
.\" .It Ev ENV_VAR_1
.\" Description of ENV_VAR_1
.\" .It Ev ENV_VAR_2
.\" Description of ENV_VAR_2
.\" .El                      
.Sh FILES                \" File used or created by the topic of the man page
.Bl -tag -width "/System/Library/LaunchDaemons/com.apple.platform.ptmd.plist" -compact
.It Pa /usr/libexec/ptmd
The daemon
.It Pa /System/Library/LaunchDaemons/com.apple.platform.ptmd.plist
The launchd configuration plist
.It Pa /usr/share/man/man1/ptmd.8
This man page
.El                      \" Ends the list
.\" .Sh DIAGNOSTICS       \" May not be needed
.\" .Bl -diag
.\" .It Diagnostic Tag
.\" Diagnostic informtion here.
.\" .It Diagnostic Tag
.\" Diagnostic informtion here.
.\" .El
.\".Sh SEE ALSO 
.\" List links in ascending order by section, alphabetically within a section.
.\" Please do not reference files that do not exist without filing a bug report
.\".Xr a 1 , 
.\".Xr b 1 ,
.\".Xr c 1 ,
.\".Xr a 2 ,
.\".Xr b 2 ,
.\".Xr a 3 ,
.\".Xr b 3 
.\" .Sh BUGS              \" Document known, unremedied bugs 
.\" .Sh HISTORY           \" Document history if command behaves in a unique manner