MacOSX10.9.sdk/usr/share/man/man8/rcd.8
.Dd 12/7/09               \" DATE
.Dt rcd 8      \" Program name and manual section number
.Os Darwin
.Sh NAME                 \" Section Header - required - don't modify
.Nm rcd
.\" Use .Nm macro to designate other names for the documented program.
.Nd Remote control daemon.
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Sh DESCRIPTION          \" Section Header - required - don't modify
.Nm
routes media transport key and remote controller commands to the appropriate applications.
It is a daemon that is launched when these commands are received.
It is not meant to be invoked directly.
.\" .Sh DIAGNOSTICS       \" May not be needed
.\" .Bl -diag
.\" .It Diagnostic Tag
.\" Diagnostic informtion here.
.\" .It Diagnostic Tag
.\" Diagnostic informtion here.
.\" .El
.\" .Sh SEE ALSO
.\" List links in ascending order by section, alphabetically within a section.
.\" Please do not reference files that do not exist without filing a bug report
.\" .Xr
.\" .Sh BUGS              \" Document known, unremedied bugs
.\" .Sh HISTORY           \" Document history if command behaves in a unique manner
