MacOSX10.9.sdk/usr/share/man/man8/sa2.8
.\"Portions Copyright (c) 1999-2003 Apple Computer, Inc. All Rights
.\"Reserved.
.\"
.\"This file contains Original Code and/or Modifications of Original Code
.\"as defined in and that are subject to the Apple Public Source License
.\"Version 2.0 (the 'License'). You may not use this file except in
.\"compliance with the License. Please obtain a copy of the License at
.\"http://www.opensource.apple.com/apsl/ and read it before using this
.\"file.
.\"
.\"The Original Code and all software distributed under the License are
.\"distributed on an 'AS IS' basis, WITHOUT WARRANTY OF ANY KIND, EITHER
.\"EXPRESS OR IMPLIED, AND APPLE HEREBY DISCLAIMS ALL SUCH WARRANTIES,
.\"INCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY,
.\"FITNESS FOR A PARTICULAR PURPOSE, QUIET ENJOYMENT OR NON-INFRINGEMENT.
.\"Please see the License for the specific language governing rights and
.\"limitations under the License.
.\" 
.\"     @(#)sa2.8
.Dd Jul 25 2003               \" DATE 
.Dt sa2 8      \" Program name and manual section number 
.Os "Mac OS X"
.Sh NAME                 \" Section Header - required - don't modify 
.Nm sa2
.Nd Generate a system activity daily report file.
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm /usr/lib/sa/sa2
.Op Fl dgpu              \" [-dgpu]
.Op Fl n Ar mode         \" [-n mode ] 
.Op Fl e Ar time         \" [-e time]
.Op Fl f Ar filename     \" [-f filename]
.Op Fl i Ar seconds      \" [-i seconds]
.Op Fl s Ar time         \" [-s time]
.Sh DESCRIPTION          \" Section Header - required - don't modify
The
.Nm sa2
command is a shell script used to invoke the system
activity reporter
.Nm sar
for purposes of generating the standard default
daily report file.
The report file generated is,
.Ar /var/log/sa/sardd
where the
.Ar dd
represents the current day of the month.
The
.Nm sa2
options are the same as those documented in
.Nm sar(1) .
.Pp                      \" Inserts a space
When
.Nm sa2
runs, it will also remove data and report files,
found in /var/log/sa, that are more than one week old.
.Pp
The
.Nm sa2
command is intended to be started by cron.
.Pp
.Sh EXAMPLE CRON ENTRY
.Pp
.Bd -literal
# Starting at 8am collect system activity records
# every 20 minutes for 12 hours
# 20 minutes = 1200 seconds
# 12 hours with 3 samples each hour = 36 loops

0 8 * * 1-5 /usr/lib/sa/sa1 1200 36

# After the 12 hour period,
# collect a system activity report

30 20 * * 1-5 /usr/lib/sa/sa2 -A

.Ed
.Pp
.Sh FILES                \" File used or created by the topic of the man page
.Bl -tag -width "/var/log/sa/sardd" -compact
.It Pa /var/log/sa/sardd
Default daily report file.
.It Pa /var/log/sa/sadd
Default daily data file.
.Pp
.Ar dd
are digits that represent the day of the month.
.El
.Sh SEE ALSO 
.\" List links in ascending order by section, alphabetically within a section.
.Xr crontab 1 ,
.Xr fs_usage 1 ,
.Xr netstat 1 ,
.Xr sar 1 ,
.Xr sc_usage 1 ,
.Xr top 1 , 
.Xr vm_stat 1 ,
.Xr crontab 5 ,
.Xr iostat 8 ,
.Xr sa1 8 , 
.Xr sadc 8
