MacOSX10.9.sdk/usr/share/man/man8/sadc.8
.\"Portions Copyright (c) 1999-2003 Apple Computer, Inc. All Rights
.\"Reserved.
.\"
.\"This file contains Original Code and/or Modifications of Original Code
.\"as defined in and that are subject to the Apple Public Source License
.\"Version 2.0 (the 'License'). You may not use this file except in
.\"compliance with the License. Please obtain a copy of the License at
.\"http://www.opensource.apple.com/apsl/ and read it before using this
.\"file.
.\"
.\"The Original Code and all software distributed under the License are
.\"distributed on an 'AS IS' basis, WITHOUT WARRANTY OF ANY KIND, EITHER
.\"EXPRESS OR IMPLIED, AND APPLE HEREBY DISCLAIMS ALL SUCH WARRANTIES,
.\"INCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY,
.\"FITNESS FOR A PARTICULAR PURPOSE, QUIET ENJOYMENT OR NON-INFRINGEMENT.
.\"Please see the License for the specific language governing rights and
.\"limitations under the License.
.\" 
.\"     @(#)sadc.8
.Dd Jul 25 2003               \" DATE 
.Dt sadc 8      \" Program name and manual section number 
.Os "Mac OS X"
.Sh NAME                 \" Section Header - required - don't modify 
.Nm sadc
.Nd system activity data collector
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm /usr/lib/sa/sadc
.Op Fl m Ar mode        \" [-m mode]
.Op Ar t n              \" [t n]
.Op Ar ofile           \" [ofile]
.Sh DESCRIPTION          \" Section Header - required - don't modify
The
.Nm sadc
tool is used to collect cumulative system activity data.
The sample system data is collected at intervals
.Ar t
seconds apart, in a loop
.Ar n
times.
The binary sample data is written to
.Ar ofile
if specified.
Otherwise, the binary data is written to stdout.
If the
.Ar ofile 
file does not exist, it is created, otherwise it is truncated.
.Pp                      \" Inserts a space
.Nm sadc
is intended to be used as the engine behind the
.Nm sar(1)
command, and is not typically invoked on the command line.
Two shell scripts,
.Nm sa1
and
.Nm sa2 ,
are provided to drive the typical sampling, saving, and
reporting process.
.Pp
.Sh OPTIONS
The following options modify the way data is collected by
.Nm sadc .
.Bl -tag -width -indent  \" Begins a tagged list 
.It Fl m Ar mode
Modify the collection of system statistics as specified by
.Ar mode .
Currently only one mode is supported.
.Bl -tag -width -indent  \" Begins a tagged list
.It PPP
By default, the collection of ppp network interface statistics
is turned off.
This is because the number of ppp connections can be very high, 
causing the raw data file to grow unexpectedly large,
especially  when samples are collected at short intervals.  
Use the
.Ar PPP
mode to turn the collection back on.
.El
.El
.Pp
.Sh EXAMPLES
/usr/lib/sa/sadc 15 20 /tmp/sample.out
.Pp
This call collects 20 samples at 15 second intervals.
The binary data is written to the /tmp/sample.out file
.Sh FILES                \" File used or created by the topic of the man page
.Bl -tag -width "/var/log/sa/sadd" -compact
.It Pa /var/log/sa/sadd
Default daily activity file that holds the binary sampling data.
.Ar dd
are digits that represent the day of the month.
.It Pa /usr/lib/sa/sa1
Shell script used to drive the
.Nm sar
data collection.
.It Pa /usr/lib/sa/sa2
Shell script used to drive the
.Nm sar
data reporting.
.El
.Sh SEE ALSO 
.\" List links in ascending order by section, alphabetically within a section.
.Xr fs_usage 1 ,
.Xr netstat 1 ,
.Xr sar 1 ,
.Xr sc_usage 1 ,
.Xr top 1 , 
.Xr vm_stat 1 ,
.Xr iostat 8 ,
.Xr sa1 8 , 
.Xr sa2 8
