MacOSX10.9.sdk/usr/share/man/man8/ServerPerfLog.8
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.\"See Also:
.\"man mdoc.samples for a complete listing of options
.\"man mdoc for the short list of editing options
.\"/usr/share/misc/mdoc.template
.Dd 3/23/10               \" DATE 
.Dt ServerPerfLog 8
.Os Darwin
.Sh NAME           
.Nm ServerPerfLog
.\" Use .Nm macro to designate other names for the documented program.
.Nd Server Performance logging daemon.
.Sh SYNOPSIS        
.Nm
.Sh DESCRIPTION      
The Server Performance log daemon writes a variety of server performance
information into the Apple System Log facility for use by Server.app
and other programs that report on system performance.
.Pp
This data is logged as Alert messages into com.apple.performance Facility
in the ASL database.  
Data is recorded in ASL with Sender set to ServerPerf.
.Sh FILES                \" File used or created by the topic of the man page
.Bl -tag -width "/usr/libexec" -compact
.It Pa /usr/libexec/ServerPerfLog
Daemon.
.It Pa /System/Library/LaunchDaemons/com.apple.ServerPerfLog.plist
Launchd plist.
.El                      \" Ends the list
.Sh SEE ALSO 
.Xr asl 3
.\" .Sh BUGS              \" Document known, unremedied bugs 
.Sh HISTORY           
First shipped in 10.7.
