MacOSX10.9.sdk/usr/share/man/man8/sharingd.8
.Dd 12/15/12               \" DATE 
.Dt sharingd 8      \" Program name and manual section number
.Os Darwin
.Sh NAME                 \" Section Header - required - don't modify 
.Nm sharingd
.Nd Sharing Daemon that enables AirDrop, Shared Computers, and Remote Disc in the Finder.
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Sh DESCRIPTION          \" Section Header - required - don't modify
.Nm sharingd
is used by the Finder to enable AirDrop file sharing, connecting
to shared computers, and accessing Remote Discs from other computers.
.Pp                      \" Inserts a space
.Sh FILES                \" File used or created by the topic of the man page
/usr/libexec/sharingd
.Sh HISTORY 
.Nm sharingd
first appeared in Mac OS X 10.9.
