MacOSX10.9.sdk/usr/share/man/man8/SleepServicesD.8
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.\"/usr/share/misc/mdoc.template
.Dd August 31, 2011      \" DATE
.Dt SleepServicesD 8
.Os Darwin
.Sh NAME                 \" Section Header - required - don't modify
.Nm SleepServicesD
.Nd Sleep Services daemon.
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Sh DESCRIPTION          \" Section Header - required - don't modify
Schedules dark wakes for the purpose of receiving push notifications, and caps dark wake time based on battery drain.
.Pp                      \" Inserts a space
.Sh FILES                \" File used or created by the topic of the man page
.Bl -tag -width "/System/Library/LaunchDaemons/com.apple.sleepservicesd.plist" -compact
.It Pa /System/Library/CoreServices/SleepServicesD
the daemon
.It Pa /System/Library/LaunchDaemons/com.apple.sleepservicesd.plist
launchd configuration plist
.El
