MacOSX10.9.sdk/usr/share/man/man8/spindump.8
.Dd September 11, 2008
.Dt spindump 8
.Os Darwin
.Sh NAME
.Nm spindump 
.Nd Profile entire system during a time interval
.Sh SYNOPSIS
.Nm spindump
.Op pid | partial-name Op duration Op interval
.Op Fl file Ar path
.Op Fl wait
.Op Fl findDsyms
.Op Fl delayOnSignal Ar seconds
.Sh DESCRIPTION
.Nm spindump 
is used by various system components to create reports when an unresponsive application is force quit. Reports are stored at:
.Pp
/Library/Logs/DiagnosticReports/
.Pp
For normal application force quits 
.Nm spindump 
will display a dialog to offer the choice to view more details and/or send a report to Apple.
.Pp
-------------------------------------
.Pp
When run manually,
.Nm spindump
samples user and kernel stacks for every process in the system.
.Pp
The process with the matching
.Nm pid
or
.Nm partial-name
will be sorted topmost in the report, if specified. "-notarget" may be used to avoid providing a target process when specifying a duration and interval.
.Pp
.Nm duration
is the duration of the sampling in seconds. If not specified, the default of 10 seconds is used.
.Pp
.Nm interval
is the number of miliseconds between samples. If not specified, the default of 10 miliseconds is used.
.Pp
The
.Fl file
argument specifies where the report should be written. If
.Ar path
is a file, it will be overwritten. If
.Ar path
is a directory, a file will be created inside that directory with the name following the format <appname>_<pid>.spindump.txt. If a file by that name already exists, spindump will add a unique number to the filename. If not specified, spindump will output reports to files inside /tmp.
.Pp
The
.Fl wait
flag tells spindump to wait for the process to exist before sampling. If the process already exists, spindump will begin sampling immediately.
.Pp
The
.Fl findDsyms
flag tells spindump to use spotlight to find dsyms for use during symbolication.
.Pp
The
.Fl delayOnSignal
argument tells spindump to wait
.Ar seconds
seconds after receiving a signal before exiting.
.Sh SEE ALSO 
.Xr SubmitDiagInfo 8 ,
.Xr sample 1 
