MacOSX10.15.sdk/usr/share/man/man8/APFSUserAgent.8
.\" Copyright (c) 2017 Apple Inc. All rights reserved.
.\"
.\" The contents of this file constitute Original Code as defined in and
.\" are subject to the Apple Public Source License Version 1.1 (the
.\" "License").  You may not use this file except in compliance with the
.\" License.  Please obtain a copy of the License at
.\" http://www.apple.com/publicsource and read it before using this file.
.\"
.\" This Original Code and all software distributed under the License are
.\" distributed on an "AS IS" basis, WITHOUT WARRANTY OF ANY KIND, EITHER
.\" EXPRESS OR IMPLIED, AND APPLE HEREBY DISCLAIMS ALL SUCH WARRANTIES,
.\" INCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY,
.\" FITNESS FOR A PARTICULAR PURPOSE OR NON-INFRINGEMENT.  Please see the
.\" License for the specific language governing rights and limitations
.\" under the License.
.\"
.\"     @(#)APFSUserAgent.8
.Dd April 23, 2017
.Dt APFSUSERAGENT 8
.Os "Mac OS X"
.Sh NAME
.Nm APFSUserAgent
.Nd APFS new container observer
.Sh DESCRIPTION
.Pp
The
.Nm
watches for IOKit notifications about new APFS containers appearing.
.Pp
.Nm
checks APFS containers for encrypted volumes.
.Pp
If found, pops up a DiskUnlock dialog to ask user for volume unlock password.
.Sh EXIT VALUES
.Nm
always returns 0.
