MacOSX10.15.sdk/usr/share/man/man8/AssetCache.8
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.\"See Also:
.\"man mdoc.samples for a complete listing of options
.\"man mdoc for the short list of editing options
.\"/usr/share/misc/mdoc.template
.Dd 11/9/16               \" DATE 
.Dt AssetCache 8      \" Program name and manual section number 
.Os "macOS"
.Sh NAME                 \" Section Header - required - don't modify 
.Nm AssetCache
.\" The following lines are read in generating the apropos(man -k) database. Use only key
.\" words here as the database is built based on the words here and in the .ND line. 
.\" .Nm Other_name_for_same_program(),
.\" .Nm Yet another name for the same program.
.\" Use .Nm macro to designate other names for the documented program.
.Nd Caching service
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Sh DESCRIPTION          \" Section Header - required - don't modify
.Nm
speeds up the download of software and content distributed by Apple by
locally caching assets that were previously downloaded on your network.
.Nm
is launched automatically by the system.
Users should not run
.Nm
manually.
.Sh FILES                \" File used or created by the topic of the man page
.Bl -tag -width -compact
.It Pa /Library/Preferences/com.apple.AssetCache.plist
Configuration preferences.
.It Pa "/Library/Application Support/Apple/AssetCache/Data"
Data store.
.El                      \" Ends the list
.Sh DIAGNOSTICS       \" May not be needed
.Nm
logs to the
.Xr os_log 3
subsystem com.apple.AssetCache.
.\" .Bl -diag
.\" .It Diagnostic Tag
.\" Diagnostic informtion here.
.\" .It Diagnostic Tag
.\" Diagnostic informtion here.
.\" .El
.Sh SEE ALSO 
.\" List links in ascending order by section, alphabetically within a section.
.\" Please do not reference files that do not exist without filing a bug report
.Xr log 1 ,
.Xr AssetCacheLocatorUtil 8 ,
.Xr AssetCacheManagerUtil 8
.\" .Sh BUGS              \" Document known, unremedied bugs 
.\" .Sh HISTORY           \" Document history if command behaves in a unique manner
