MacOSX10.15.sdk/usr/share/man/man8/automountd.8
.Dd April 4, 2007
.Os Darwin
.Dt AUTOMOUNTD 8
.Sh NAME
.Nm automountd
.Nd automatic mount / unmount daemon for autofs
.Sh SYNOPSIS
.Nm /usr/libexec/automountd
.Op Fl v
.Op Fl n
.Op Fl T
.Op Fl o Ar opts
.Op Fl D Ar name Ns = Ns Ar value
.Sh DESCRIPTION
.Nm
is a daemon that responds to requests from autofs to mount and unmount
network filesystems, and to supply the contents of directories, based on
the contents of automounter maps. The automountd is started on demand by
.Xr launchd 8 .
As the daemon is launched by
.Nm launchd ,
the options below would be specified in the
.Li ProgramArguments
key in the
.Nm launchd
plist for
.Nm automountd .
See
.Sx FILES
below.
.Sh OPTIONS
.Bl -tag -width Ds
.It Fl v
Log to
.Xr syslogd 8
more detailed information about actions taken by
.Nm .
.It Fl n
Disable browsing of all maps.
.It Fl T
Increase by
.Li 1
the logging level for messages printed to the standard output
information about requests received from autofs, processing done for
those requests, and replies sent to autofs.  The default level of
.Li 0
causes no information to be logged; each higher value causes more
information to be logged.
.It Fl o Ar opts
Apply the options specified by
.Ar opts
to all mounts by default.
The options for a particular mount can override these options.
.It Fl D Ar name Ns = Ns Ar value
Set the environment value specified by
.Ar name
to the specified
.Ar value .
Environment variables can be referred to in map entries; the value of
the environment variable is substituted for the reference to the
variable.
.El
.Sh FILES
.Bl -tag  -width Ds
.It Pa /etc/autofs.conf
configuration file used to manage automountd
.It Pa /System/Library/LaunchDaemons/com.apple.automountd.plist
.Nm launchd
plist
.El
.Sh SEE ALSO
.Xr auto_master 5 ,
.Xr autofsd 8 ,
.Xr automount 8 ,
.Xr autofs.conf 5 ,
.Xr mount 8 ,
.Xr mount_nfs 8 ,
.Xr launchd 8 ,
.Xr launchd.plist 5
