MacOSX10.15.sdk/usr/share/man/man8/ntfs.util.8
.\"Copyright (c) 2006-2008 Apple Inc. All Rights Reserved.
.\"
.\"This file contains Original Code and/or Modifications of Original Code as
.\"defined in and that are subject to the Apple Public Source License Version
.\"2.0 (the 'License'). You may not use this file except in compliance with the
.\"License.
.\"
.\"Please obtain a copy of the License at http://www.opensource.apple.com/apsl/
.\"and read it before using this file.
.\"
.\"The Original Code and all software distributed under the License are
.\"distributed on an 'AS IS' basis, WITHOUT WARRANTY OF ANY KIND, EITHER
.\"EXPRESS OR IMPLIED, AND APPLE HEREBY DISCLAIMS ALL SUCH WARRANTIES,
.\"INCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY, FITNESS FOR
.\"A PARTICULAR PURPOSE, QUIET ENJOYMENT OR NON-INFRINGEMENT. Please see the
.\"License for the specific language governing rights and limitations under the
.\"License.
.Dd October 22, 2006
.Dt NTFS.UTIL 8
.Os "Mac OS X"
.Sh NAME
.Nm ntfs.util
.Nd NTFS file system utility
.Sh SYNOPSIS
.Nm
.Fl k
.Ar device
.Pp
.Nm
.Fl m
.Ar device mountpoint
.Ar mountflag1
.Ar mountflag2
.Ar mountflag3
.Ar mountflag4
.Pp
.Nm
.Fl p
.Ar device
.Ar mountflag1
.Ar mountflag2
.Pp
.Nm
.Fl u
.Ar device mountpoint
.Sh DESCRIPTION
The
.Nm
command supports the mounting, probing, and unmounting of NTFS file systems.
.Pp
Options:
.Bl -tag -compact -offset indent
.It Fl k
Get the UUID key for the NTFS file system at
.Ar device .
.It Fl m
Mount the NTFS file system located on
.Ar device
onto
.Ar mountpoint
with the flags
.Ar mountflag1 mountflag2 mountflag3 mountflag4 .
.It Fl p
Probe the
.Ar device
for an NTFS file system using the flags
.Ar mountflag1 mountflag2 .
If the probe is successful, i.e. the
.Ar device
contains a valid NTFS file system, its label is printed to the standard output
stream.
.It Fl u
Unmount the NTFS file system located at
.Ar device
and mounted on
.Ar mountpoint .
.El
.Pp
The
.Ar mountflags
referenced above are:
.Bl -bullet -compact -offset indent
.It
.Ar mountflag1 :
.Ar removable
or
.Ar fixed
.It
.Ar mountflag2 :
.Ar readonly
or
.Ar writeable
.It
.Ar mountflag3 :
.Ar suid
or
.Ar nosuid
.It
.Ar mountflag4 :
.Ar dev
or
.Ar nodev
.El
.Sh SEE ALSO
.Xr diskarbitrationd 8
.Xr mount_ntfs 8
.Sh HISTORY
This NTFS implementation first appeared in Mac OS X 10.5.
.Sh AUTHORS
This NTFS implementation was written by
.An Anton Altaparmakov Aq aia21@cantab.net .
