MacOSX10.15.sdk/usr/share/man/man8/osanalyticshelper.8
.Dd March 09, 2017
.Dt osanalyticshelper 8
.Os macOS
.Sh NAME
.Nm osanalyticshelper
.Nd Writes JetsamEvent reports
.Sh DESCRIPTION
.Nm
reads JetsamEvent information from the system and writes it into a JetsamEvent report on disk.
The JetsamEvent reports are intended to help performance engineers diagnose memory issues and are submitted anonymously to Apple by the
.Nm SubmitDiagInfo
process.
The reports are used by Apple to improve its products.
Users who need support should use http://www.apple.com/support or other authorized support channels.
Developers who are ADC members should report bugs using http://bugreporter.apple.com in order to allow for two way communication between Apple and the bug reporter.
.Sh SEE ALSO
.Xr SubmitDiagInfo 8
