MacOSX10.15.sdk/usr/share/man/man8/pam_nologin.8
.\" Copyright (c) 2001 Mark R V Murray
.\" All rights reserved.
.\"
.\" Portions Copyright (C) 2002-2009 Apple Inc.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD: src/lib/libpam/modules/pam_nologin/pam_nologin.8,v 1.5 2001/08/26 18:05:35 markm Exp $
.\"
.\" Protions copyright (c) 2009 Apple Inc. All rights reserved.
.\"
.Dd February 7, 2009
.Dt pam_nologin 8
.Os
.Sh NAME
.Nm pam_nologin
.Nd No Login PAM module
.Sh SYNOPSIS
.Op Ar service-name
.Ar function-class
.Ar control-flag
pam_nologin
.Op Ar options
.Sh DESCRIPTION
The No Login PAM module supports the account management function class.  In terms of the
.Ar function-class
parameter, this is the
.Dq Li account
class.
.Pp
The No Login authentication module always returns success for the superuser, and returns success for all other users if the file
.Pa /etc/nologin
does not exist.  If
.Pa /etc/nologin
does exist, then its contents are echoed to non-superusers before failure is returned.
.Sh FILES
.Bl -tag
.It Pa /etc/nologin
A message to denied users.
.El
.Sh SEE ALSO
.Xr nologin 8 ,
.Xr pam.conf 5 ,
.Xr pam 8 ,
.Xr pwpolicy 8
