MacOSX10.15.sdk/usr/share/man/man8/printtool.8
.\"Copyright (c) 2016-2018 Apple Inc. All rights reserved.
.\"
.TH printtool 8 macOS "December 8, 2016" "Apple Inc."
.SH NAME
printtool \-\- a command line tool to configure the printing system
.SH SYNOPSIS
.B printtool 
[
.B \-\-reset
] [
.B \-f
]
.SH DESCRIPTION
A tool to perform privileged configuration operations on the printing system.
.SH OPTIONS
The following options are recognized:
.TP 5
.B \-\-reset
Reset the printing system
.TP 5
.B \-f
Do not prompt for confirmation
.SH FILES
/System/Library/Frameworks/ApplicationServices.framework/Versions/A/Frameworks/PrintCore.framework/Versions/A/printtool
.EL
.XR launchd 8
.SH HISTORY
.NM printtool
First appeared in Mac OS 10.4. Reset command added in Mac OS 10.14
