MacOSX10.15.sdk/usr/share/man/man8/tmdiagnose.8
.\"Copyright (c) 2007-2010 Apple Inc.  All Rights Reserved.
.\"
.\"To check for errors: /usr/bin/groff -I/usr/share/man -S -Wall -mtty-char -mandoc -Tascii tmdiagnose.8 > /dev/null 

.Dd 6 September 2011
.Dt TMDIAGNOSE 8
.Os "Mac OS X"
.Sh NAME
.Nm tmdiagnose
.Nd gather information to aid in diagnosing Time Machine issues
.\"
.\" ============================================================================
.\" ========================== BEGIN SYNOPSIS SECTION ==========================
.Sh SYNOPSIS
.Nm
.Fl h
.Nm
.Op Fl d Ar seconds
.Op Fl f Ar path
.Op Fl m
.Op Fl r
.\" =========================== END SYNOPSIS SECTION ===========================
.\" ============================================================================
.\"
.\" ============================================================================
.\" ======================== BEGIN DESCRIPTION SECTION =========================
.Sh DESCRIPTION
The
.Nm
tool gathers system and backup information in order to assist Apple when investigating issues related to Time Machine. A great deal of information is harvested, spanning system state, system and backup configuration, and snapshot details.
.Pp
.\" ----------------------------------------------------------------------------
.\" ----------------------- BEGIN HARVEST MANIFEST -----------------------------
.Ss What Nm Sy Collects:
.Bl -bullet -offset indent -compact
.It
A spindump of the system
.It
Several seconds of fs_usage ouput 
.It
Several seconds of top output
.It
Individual samples of backupd and Finder
.It
Power Management state and logs
.It
IOKit registry information
.It
A netstat inspection
.It
A list of all open files on the system
.It
All system logs
.It
All kernel logs
.It
All install logs
.It
All fsck_hfs logs
.It
All WiFi logs
.It
Disk Utility logs for all local users
.It
The system migration log
.It
All spin and crash reports for the following processes:
.\" ----------------------------------------------------------------------------
.\" --------------------------- BEGIN PROCESS SUBLIST --------------------------
.Bl -item -offset 3n -compact
.It
backupd
.It
mds
.It
diskimages-helper
.It
DesktopServicesHelper
.It
newfs_hfs
.It
NetAuthSysAgent
.El
.Pp
.\" ---------------------------- END PROCESS SUBLIST ---------------------------
.\" ----------------------------------------------------------------------------
.It
Recent spin and crash reports for the following processes, for all local users:
.\" ----------------------------------------------------------------------------
.\" --------------------------- BEGIN PROCESS SUBLIST --------------------------
.Bl -item -offset 3n -compact
.It
Finder
.It
Locum
.It
System Preferences
.It
SystemUIServer
.It
iPhoto
.It
Mail
.It
MailTimeMachineHelper
.It
Address Book
.El
.\" ---------------------------- END PROCESS SUBLIST ---------------------------
.\" ----------------------------------------------------------------------------
.Pp
.It
Basic information about reachable AirPort and Time Capsule devices
.It
The FindSystemFiles cache
.It
Information about disks and mounted network shares
.It
Information about attached disk images
.It
A System Profiler report
.It
A list of software that has been installed via the
.Sy darwinup
tool
.It
Time Machine preferences, caches, and configuration information
.It
Comprehensive information about Time Machine backups and snapshots
.El
.\" --------------------------- END HARVEST MANIFEST ---------------------------
.\" ----------------------------------------------------------------------------
.Pp
The high-level backup structure for the current machine directory is recreated inside the diagnostic bundle, including the capture of various Time Machine log files contained within snapshots. Items in this "skeleton" structure have on them the extended attributes of the originals. Recreations of local snapshots are also captured in the same manner.
.Pp
The
.Nm
tool will run the Spotlight diagnostic tool
.Sy mddiagnose
automatically, if it is available.
.\" ----------------------------------------------------------------------------
.\" ----------------------- BEGIN UNHARVESTED INFORMATION ----------------------
.Ss What Nm Sy Doesn't Collect:
.Bl -bullet -offset indent -compact
.It
No user files are harvested from within backups
.It
No authentication credentials are harvested from the system
.It
No authentication credentials are harvested for reachable AirPort and Time Capsule devices
.El
.Pp
.\" ------------------------ END UNHARVESTED INFORMATION -----------------------
.\" ----------------------------------------------------------------------------
.\" ========================== END DESCRIPTION SECTION =========================
.\" ============================================================================
.\"
.\" ============================================================================
.\" =========================== BEGIN OPTIONS SECTION ==========================
.Sh OPTIONS
.Bl -hang -compact
.It Fl h
Print full usage.
.It Fl d Ar sec
Delay the start of the diagnostic by
.Ar sec
seconds. The system alert sound will play two times when the diagnostic begins.
.It Fl f Ar path
Write the diagnostic to the specified path.
.It Fl m
Gather memory diagnostics for backupd and Finder.
.It Fl r
Do not reveal the diagnostic in Finder when finished.
.El
.\" =========================== END OPTIONS SECTION ============================
.\" ============================================================================
.\"
.\" ============================================================================
.\" ======================== BEGIN EXIT STATUS SECTION =========================
.Sh EXIT STATUS
.Nm
exits with status 0 if there were no internal errors encountered during the diagnostic, or >0 when an error unrelated to external state occurs or unusable input is provided by the user.
.\" ========================= END EXIT STATUS SECTION ==========================
.\" ============================================================================
