MacOSX11.1.sdk/usr/share/man/man8/ac.8
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)ac.8	8.2 (Berkeley) 4/19/94
.\"
.Dd April 19, 1994
.Dt AC 8
.Os BSD 4
.Sh NAME
.Nm ac
.Nd display connect-time accounting
.Sh SYNOPSIS
.Nm ac
.Op Fl d
.Op Fl p
.Op Fl w Ar file
.Op Ar users ...
.Sh DESCRIPTION
A record of individual
login and logout times are written to the system log by
.Xr login 8
and
.Xr launchd 8 ,
respectively.
The program
.Nm ac
examines these records
and writes the accumulated connect time (in decimal hours)
for all logins to the standard output.
.Pp
Options available:
.Bl -tag -width people
.It Fl d
Display the connect times in 24 hour chunks.
.It Fl p
Display individual user totals.
.It Fl w Ar file
Read raw connect time data from
.Ar file ,
instead of the system log.
.It Ar users ...
Display totals for the given individuals
only.
.El
.Pp
If no arguments are given,
.Nm ac
displays the total amount of login time
for all active accounts on the system.
.Sh SEE ALSO
.Xr login 1 ,
.Xr utmpx 5 ,
.Xr launchd 8 ,
.Xr sa 8
.Sh HISTORY
An
.Nm ac
command appeared in Version 6 AT&T UNIX.
