MacOSX11.1.sdk/usr/share/man/man8/automation_trampoline.8
.Dd June 22, 2018
.Dt AUTOMATION_TRAMPOLINE 8
.Os macOS
."
."
.Sh NAME
."======================
.Nm automation_trampoline
.Nd runs automation on boot
."
."
."
."
.Sh DESCRIPTION
."======================
The
.Nm
daemon runs automation on boot, or when invoked manually.
.Pp
By default,
.Nm
is disallowed.
In order to run automation, one of the following conditions must be satisfied:
.Bl -dash
.It
The system is netbooted (kern.netboot=1).
.It
The system allows automation (kern.bootargs contains com.apple.automation=1).
.El
.Pp
.Nm
is not intended for general use, and its behavior is not documented. Use
.Xr launchd 8
instead.
.Sh "SEE ALSO"
.Xr launchd 8
