MacOSX11.1.sdk/usr/share/man/man8/diagnostics_agent.8
.Dd October 25, 2016
.Dt diagnostics_agent 8
.Os macOS
.Sh NAME
.Nm diagnostics_agent
.Nd Triggers log submission
.Sh DESCRIPTION
.Nm
is a system process with runs periodically. It collects diagnostics and usage data and logs it for later submission to Apple. Additionally,
.Nm
periodically initiates the log submission process.
.Pp
Sending diagnostic and usage reports to Apple helps us improve the quality and performance of our products and services.  It helps Apple identify common
usage trends and issues that enable us to allocate our resources efficiently, and it helps us provide better support services to you and other customers.
All of the diagnostic and usage information is collected anonymously from your computer in a way that does not personally identify you. 
.Pp
Automatic reporting of diagnostic information is off by default and no information is sent to Apple unless a user has opted-in to automatic collection of
diagnostic information.  A user is offered the opportunity to opt-in for automatic collection of additional diagnostic and usage information after the user
has manually sent a crash, hang or panic report to Apple.  Users may at any time opt in or out of automatic reporting in the Security & Privacy pane of the
System Preferences application under the "Privacy" tab.

.Sh SEE ALSO
.Xr SubmitDiagInfo 8
