MacOSX11.1.sdk/usr/share/man/man8/mount_url.8
.Dd April 23, 2007
.Os Darwin
.Dt MOUNT_URL 8
.Sh NAME
.Nm mount_url
.Nd mount a remote file system given a URL
.Sh SYNOPSIS
.Nm /usr/libexec/mount_url
.Op Fl nrw
.Op Fl o Ar options
.Ar URL node
.Sh DESCRIPTION
The
.Nm mount_url
program
mounts a remote file system, specified by
.Ar URL ,
on
.Ar node .
.Pp
The options are as follows:
.Bl -tag -width indent
.It Fl n
The mount should be done through the NetAuth agent.
.It Fl o
Options are specified with a
.Fl o
flag followed by a comma separated string of options.
See the
.Xr mount 8
man page for possible options and their meanings.
The following option is also available:
.Pp
.Bl -tag -width indent
.It Cm soft
Make the mount soft.
.El
.It Fl r
The file system is to be mounted read-only.
Mount the file system read-only (even the super-user may not write it).
The same as the
.Dq rdonly
argument to the
.Fl o
option.
.It Fl w
The file system object is to be read and write.
.El
.Sh SEE ALSO
.Xr mount 2 ,
.Xr umount 8
