MacOSX11.1.sdk/usr/share/man/man8/pkd.8
.Dd 1/22/14               \" DATE
.Dt pkd 8      \" Program name and manual section number
.Os Darwin
.Sh NAME                 \" Section Header - required - don't modify 
.Nm pkd
.Nd management and supervision daemon for plug-in services
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.\".Op Fl v
.Sh DESCRIPTION          \" Section Header - required - don't modify
.Nm
manages plug-ins for the PlugInKit subsystem. It is a classic launch agent managed by launchd.
.\".Pp
.\".Bl -tag -width -indent  \" Differs from above in tag removed
.\".It Fl v
.\"Ask pkd to log more verbosely to the system log.
.El                      \" Ends the list
.Pp
.\" .Sh ENVIRONMENT      \" May not be needed
.\" .Bl -tag -width "ENV_VAR_1" -indent \" ENV_VAR_1 is width of the string ENV_VAR_1
.\" .It Ev ENV_VAR_1
.\" Description of ENV_VAR_1
.\" .It Ev ENV_VAR_2
.\" Description of ENV_VAR_2
.\" .El                      
.\" .Sh DIAGNOSTICS       \" May not be needed
.\" .Bl -diag
.\" .It Diagnostic Tag
.\" Diagnostic informtion here.
.\" .It Diagnostic Tag
.\" Diagnostic informtion here.
.\" .El
.Sh SEE ALSO 
.Xr pluginkit 8
.Xr xpc 3
.Sh BUGS              \" Document known, unremedied bugs 
None yet.
.Sh HISTORY           \" Document history if command behaves in a unique manner
Pkd was first introduced in OS X 10.9.
.Pp
Pkd used to have a -v verbose option to increase logging. This is now accomplished
through the logging system by enabling the "info" or "debug" levels of logging for
the "com.apple.pluginkit" subsystem.
