MacOSX10.10.sdk/usr/share/man/man8/discoveryd_helper.8
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.\"See Also:
.\"man mdoc.samples for a complete listing of options
.\"man mdoc for the short list of editing options
.\"/usr/share/misc/mdoc.template
.Dd 5/3/14               \" DATE 
.Dt discoveryd_helper 8      \" Program name and manual section number 
.Os Darwin
.Sh NAME                 \" Section Header - required - don't modify 
.Nm discoveryd_helper
.\" The following lines are read in generating the apropos(man -k) database. Use only key
.\" words here as the database is built based on the words here and in the .ND line. 
.\" Use .Nm macro to designate other names for the documented program.
.Nd discoveryd's helper for privilege separation
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Op Fl Fl loglevel Ar level
.Op Fl Fl logclass Ar class
.Op Fl Fl lognoclass Ar class
.Sh DESCRIPTION          \" Section Header - required - don't modify
.Nm
is an executable invoked by launchd to provide privilege separation to
the discoveryd(8) daemon.
.Pp
Users should not run
.Nm
manually.
.Pp                      \" Inserts a space
.Pp
Flags and their descriptions:
.Bl -tag -width -indent  \" Differs from above in tag removed 
.It Fl Fl loglevel
Set the logging level for discoveryutil, not discoveryd to one of:
None, Basic, Intermediate, Detailed, VeryDetailed, Everything, or a number.
.It Fl Fl logclass
Set the logging class bitmap by subsystem using one of the following, which can be or-ed together:
None, Tests, Events, Sockets, Bonjour, Network, D2DServer, ClientIPC, DeviceInformation,
RemoteControl, Cache, WABServer, NATTSever, Helper, Packets, Power, SleepProxy,
DNSProxy, BTMMServer, Symptoms, Everything, or 0xNNN.
.It Fl Fl lognoclass
Clear the logging class bitmap by subsystem using one of the following, which can be or-ed together:
None, Tests, Events, Sockets, Bonjour, Network, D2DServer, ClientIPC, DeviceInformation,
RemoteControl, Cache, WABServer, NATTSever, Helper, Packets, Power, SleepProxy,
DNSProxy, BTMMServer, Symptoms, Everything, or 0xNNN.
.El                      \" Ends the list
.Pp
.\" .Sh ENVIRONMENT      \" May not be needed
.\" .Bl -tag -width "ENV_VAR_1" -indent \" ENV_VAR_1 is width of the string ENV_VAR_1
.\" .It Ev ENV_VAR_1
.\" Description of ENV_VAR_1
.\" .It Ev ENV_VAR_2
.\" Description of ENV_VAR_2
.\" .El                      
.Sh FILES                \" File used or created by the topic of the man page.\" 
.Bl -tag -width "/usr/libexec/discoveryd_helper"
.It Pa /usr/libexec/discoveryd_helper
Executable
.El                      \" Ends the list
.\" .Sh DIAGNOSTICS       \" May not be needed
.\" .Bl -diag
.\" .It Diagnostic Tag
.\" Diagnostic informtion here.
.\" .It Diagnostic Tag
.\" Diagnostic informtion here.
.\" .El
.Sh SEE ALSO 
.\" List links in ascending order by section, alphabetically within a section.
.\" Please do not reference files that do not exist without filing a bug report
.Xr discoveryd 8 , 
.Xr discoveryutil 8
.\" .Sh BUGS              \" Document known, unremedied bugs 
.\" .Sh HISTORY           \" Document history if command behaves in a unique manner