MacOSX10.10.sdk/usr/share/man/man8/discoveryd.8
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.\"See Also:
.\"man mdoc.samples for a complete listing of options
.\"man mdoc for the short list of editing options
.\"/usr/share/misc/mdoc.template
.Dd 5/3/14               \" DATE 
.Dt discoveryd 8      \" Program name and manual section number 
.Os Darwin
.Sh NAME                 \" Section Header - required - don't modify 
.Nm discoveryd
.\" The following lines are read in generating the apropos(man -k) database. Use only key
.\" words here as the database is built based on the words here and in the .ND line. 
.\" Use .Nm macro to designate other names for the documented program.
.Nd System daemon for DNS, Bonjour and other Discovery
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Op Fl Fl loglevel Ar level
.Op Fl Fl logclass Ar class
.Op Fl Fl lognoclass Ar class
.Op Fl Fl udsocket Ar standard|experimental
.Op Fl Fl logto Ar stderr|asl|aslstderr
.Op Fl Fl xpcpid
.Sh DESCRIPTION          \" Section Header - required - don't modify
The
.Nm
daemon is responsible for unicast DNS resolution, multicast DNS resolution,
and Service Discovery on the system.  It performs queries, registrations,
and provides answers on
behalf of other clients through the 
.Ar DNS Service Discovery
API as documented in dns_sd.h.
.Pp
.Nm
works cooperatively with discoveryutil(8).  discoveryutil can be used to introspect
and modify the state and operation of
.Nm .
This should be done with caution, since it can dramatically affect overall system
stability, and expose sensitive information.
.Pp                      \" Inserts a space
This daemon is not generally meant to be run on the command line, and users should
.Ar not
run it manually.
.Pp
Command line flags and their descriptions:
.Bl -tag -width -indent  \" Differs from above in tag removed 
.It Fl Fl loglevel
Set the logging level for 
.Nm
to one of:
None, Basic, Intermediate, Detailed, VeryDetailed, Everything, or a number.
.It Fl Fl logclass
Set the logging class bitmap by subsystem using one of the following, which can be or-ed together:
None, Tests, Events, Sockets, Bonjour, Network, D2DServer, ClientIPC, DeviceInformation,
RemoteControl, Cache, WABServer, NATTSever, Helper, Packets, Power, SleepProxy,
DNSProxy, BTMMServer, Symptoms, Everything, or 0xNNN.
.It Fl Fl lognoclass
Clear the logging class bitmap by subsystem using one of the following, which can be or-ed together:
None, Tests, Events, Sockets, Bonjour, Network, D2DServer, ClientIPC, DeviceInformation,
RemoteControl, Cache, WABServer, NATTSever, Helper, Packets, Power, SleepProxy,
DNSProxy, BTMMServer, Symptoms, Everything, or 0xNNN.
.It Fl Fl udsocket Ar standard|experimental
Use the "standard" or "experimental" unix domain socket for communication with the client
library for the DNS Service Discovery API.
.It Fl Fl logto Ar asl|stderr|aslstderr
Send the
.Nm
logging output to asl(3), standard error, or to both simultaneously.  Logging to asl
will be done at various levels, as appropriate.
.It Fl Fl xpcpid, Fl x
Become a debug version of
.Nm ,
which is available to a corresponding discoveryutil
running with the
--xpcpid option set.  The pid passed to discoveryutil's --xpcpid option is the process
id of the discoveryd process to be
connected to.
.El                      \" Ends the list
.Pp
.\" .Sh ENVIRONMENT      \" May not be needed
.\" .Bl -tag -width "ENV_VAR_1" -indent \" ENV_VAR_1 is width of the string ENV_VAR_1
.\" .It Ev ENV_VAR_1
.\" Description of ENV_VAR_1
.\" .It Ev ENV_VAR_2
.\" Description of ENV_VAR_2
.\" .El                      
.Sh FILES                \" File used or created by the topic of the man page.\" 
.Bl -tag -width "/usr/libexec/discoveryd" -compact
.It Pa /usr/libexec/discoveryd
Executable
.It Pa /usr/include/dns_sd.h
DNS Service Discovery API
.El                      \" Ends the list
.\" .Sh DIAGNOSTICS       \" May not be needed
.\" .Bl -diag
.\" .It Diagnostic Tag
.\" Diagnostic informtion here.
.\" .It Diagnostic Tag
.\" Diagnostic informtion here.
.\" .El
.Sh SEE ALSO 
.\" List links in ascending order by section, alphabetically within a section.
.\" Please do not reference files that do not exist without filing a bug report
.Xr discoveryutil 8 , 
.Xr discoveryd_helper 8 ,
.Xr dns-sd 1 ,
.Xr dig 1 ,
.Xr nslookup 1 ,
.Xr asl 3
.\" .Sh BUGS              \" Document known, unremedied bugs 
.\" .Sh HISTORY           \" Document history if command behaves in a unique manner