MacOSX10.10.sdk/usr/share/man/man8/discoveryutil.8
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.\"See Also:
.\"man mdoc.samples for a complete listing of options
.\"man mdoc for the short list of editing options
.\"/usr/share/misc/mdoc.template
.Dd 5/3/14               \" DATE 
.Dt discoveryutil 8      \" Program name and manual section number 
.Os Darwin
.Sh NAME                 \" Section Header - required - don't modify 
.Nm discoveryutil
.\" The following lines are read in generating the apropos(man -k) database. Use only key
.\" words here as the database is built based on the words here and in the .ND line. 
.\" Use .Nm macro to designate other names for the documented program.
.Nd Utility for manipulating discoveryd.
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Op Fl Fl loglevel Ar level
.Op Fl Fl logclass Ar class
.Op Fl Fl lognoclass Ar class
.Op Fl Fl xpcpid Ar pid
.Ar command
.Op args ...    
.Sh DESCRIPTION          \" Section Header - required - don't modify
.Nm
is a tool that is used to both introspect and change the state of discoveryd(8).
It must be run as
.Ar root .
Many of the commands available to
.Nm
can disrupt or change the behavior of unicast or multicast DNS discovery, so caution
is advised when making changes.
.Pp                      \" Inserts a space
.Nm
commands
.Bl -tag -width -indent  \" Begins a tagged list 
.It adduds path: add another UDS by path
Add a filesystem path for discoveryd to use as a unix domain socket for a client library.
.It clientlisteners: print the active client listeners
Print the list of active listeners, processes, and last commands.
.It configinterfaces [label]: print out the current interfaces
Print a list of interfaces that discoveryd is aware of from configd(8).
.It configresolvers [label]: print out the current network resolvers
Print a list of resolvers that discoveryd is aware of from configd(8).
.It dnsproxystate [label]: print out the current dnsproxy state info
Print the state of discoveryd's DNS proxy.
.It help
List the available
.Nm
commands.
.It logclass [0xX|class]: get / or in a log class
See --logclass below, but makes the change for discoveryd.
.It loglevel [N|name]: get / set the log level
See --loglevel below, but makes the change for discoveryd.
.It lognoclass [0xX|class]: get / and out a log class
See --lognoclass below, but makes the change for discoveryd.
.It mdnsactivedirectory [yes|no|auto]: set/get Active Directory detection state
.It mdnsbrowses [label]: print out the current mdns browses
.It mdnscachecontents [label]: log the current mdns cache contents
This goes to the system log, and log class "Cache" must be set for it to appear.
.It mdnscachestats [label]: print out the current mdns listener cache stats
.It mdnsflushcache [interface]: flush cache, potentially on a specific interface
.It mdnslisteners [label]: print out the current mdns listeners
.It mdnsregistrations [label]: print out the current mdns registrations
.It mdnsrestartquestions: force mdns questions to restart
.It mdnsrestartregistrations: force mdns registrations to restart
.It mdnssetedns0identifier [on|off]: set / get whether EDNS0 identifier records are sent for multicast
This is for debugging only.
.It memorypressure [yes|no]: simulate memory pressure
.It nattraversals: print information about NAT Traversals
.It sandboxtest file: trigger sandbox violation
.It testdatatypes: test complex data type transfers
.It udnscachecontents [label]: log the current udns cache contents
This goes to the system log, and log class "Cache" must be set for it to appear.
.It udnscachestats [label]: print out the current udns cache stats
.It udnsflushcaches: flush all udns caches
.It udnsforcetcp [yes|no]: force udns queries to go over TCP instead of UDP
.It udnsresolvers [label]: print out the current udns resolvers
.It udnsrestartquestions [force]: manually restart all udns questions
.It udnsunanswered [label]: print out the current udns unanswered queries on resolvers
.El                      \" Ends the list
.Pp
Flags and their descriptions:
.Bl -tag -width -indent  \" Differs from above in tag removed 
.It Fl Fl debug, Fl d
Interact with discoveryd not started by launchd(8).
.It Fl Fl priv, Fl p
Interact with discoveryd started by launchd(8).
.It Fl Fl loglevel
Set the logging level for discoveryutil, not discoveryd to one of:
None, Basic, Intermediate, Detailed, VeryDetailed, Everything, or a number.
.It Fl Fl logclass
Set the logging class bitmap by subsystem using one of the following, which can be or-ed together:
None, Tests, Events, Sockets, Bonjour, Network, D2DServer, ClientIPC, DeviceInformation,
RemoteControl, Cache, WABServer, NATTSever, Helper, Packets, Power, SleepProxy,
DNSProxy, BTMMServer, Symptoms, Everything, or 0xNNN.
.It Fl Fl lognoclass
Clear the logging class bitmap by subsystem using one of the following, which can be or-ed together:
None, Tests, Events, Sockets, Bonjour, Network, D2DServer, ClientIPC, DeviceInformation,
RemoteControl, Cache, WABServer, NATTSever, Helper, Packets, Power, SleepProxy,
DNSProxy, BTMMServer, Symptoms, Everything, or 0xNNN.
.It Fl Fl xpcpid, Fl x
Connect to a debug version of discoveryd which is correspondingly running with the
--xpcpid option set.  The pid is the process id of the discoveryd process to be
connected to.
.Nm
on this machine.  This is so multiple instances can be debugged.
.It Fl Fl timeout, Fl t Ar secs
Set a timeout when communicating with discoveryd, in case there is a problem.
For use with scripts.
.El                      \" Ends the list
.Pp
.\" .Sh ENVIRONMENT      \" May not be needed
.\" .Bl -tag -width "ENV_VAR_1" -indent \" ENV_VAR_1 is width of the string ENV_VAR_1
.\" .It Ev ENV_VAR_1
.\" Description of ENV_VAR_1
.\" .It Ev ENV_VAR_2
.\" Description of ENV_VAR_2
.\" .El                      
.Sh FILES                \" File used or created by the topic of the man page.\" 
.Bl -tag -width "/usr/sbin/discoveryutil"
.It Pa /usr/sbin/discoveryutil
Executable
.El                      \" Ends the list
.\" .Sh DIAGNOSTICS       \" May not be needed
.\" .Bl -diag
.\" .It Diagnostic Tag
.\" Diagnostic informtion here.
.\" .It Diagnostic Tag
.\" Diagnostic informtion here.
.\" .El
.Sh SEE ALSO 
.\" List links in ascending order by section, alphabetically within a section.
.\" Please do not reference files that do not exist without filing a bug report
.Xr discoveryd 8 , 
.Xr dns-sd 1 ,
.Xr dig 1 ,
.Xr nslookup 1
.\" .Sh BUGS              \" Document known, unremedied bugs 
.\" .Sh HISTORY           \" Document history if command behaves in a unique manner