MacOSX10.10.sdk/usr/share/man/man8/dpd.8
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.\"/usr/share/misc/mdoc.template
.Dd February 18, 2009       \" DATE 
.Dt dpd 8
.Os Darwin
.Sh NAME                 \" Section Header - required - don't modify 
.Nm dpd
.Nd Display Port daemon.
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Sh DESCRIPTION          \" Section Header - required - don't modify
The 
.Nm
executable is a daemon intended to listen for Command + F2 on the iMac to switch to external display input mode upon display port hot-plug. This feature is known as Target Display Mode. It disables display and idle sleep while in external display mode and launches an audio tool called dpaudiothru to capture audio input and route it into the mac unit. To go back to normal mac mode, unplug the display port or press Command + F2 again, which will restore all settings.
.Pp                      \" Inserts a space
.Nm
should only be run via launchd.
.Pp                      \" Inserts a space
.Sh FILES                \" File used or created by the topic of the man page
.Bl -tag -width "/System/Library/LaunchDaemons/com.apple.dpd.plist" -compact
.It Pa /usr/libexec/dpd
The daemon
.It Pa /System/Library/LaunchDaemons/com.apple.dpd.plist
The launchd configuration plist
.El
