MacOSX10.10.sdk/usr/share/man/man8/iostat.8
.\"
.\" Copyright (c) 1997 Kenneth D. Merry.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. The name of the author may not be used to endorse or promote products
.\"    derived from this software without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD: src/usr.sbin/iostat/iostat.8,v 1.20 2001/08/07 13:59:48 ru Exp $
.\"
.\" Copyright (c) 1985, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)iostat.8	8.1 (Berkeley) 6/6/93
.\"
.Dd September 27, 2001
.Dt IOSTAT 8
.Os
.Sh NAME
.Nm iostat
.Nd report
.Tn I/O
statistics
.Sh SYNOPSIS
.Nm iostat
.Op Fl CUdKIoT?\&
.Op Fl c Ar count
.Op Fl n Ar devs
.Op Fl w Ar wait
.Op Ar drives
.Sh DESCRIPTION
.Nm Iostat
displays kernel
.Tn I/O
statistics on terminal, device and cpu operations.
The first statistics that are printed are averaged over the system uptime.
To get information about the current activity, a suitable wait time should
be specified, so that the subsequent sets of printed statistics will be
averaged over that time.
.Pp
The options are as follows:
.Bl -tag -width flag
.\" ==========
.It Fl ?\&
Display a usage statement and exit.
.\" ==========
.It Fl C
Display CPU statistics.
This is on by default, unless
.Fl d
is specified.
.\" ==========
.It Fl c
Repeat the display
.Ar count
times.
If no
.Ar wait
interval is specified, the default is 1 second.
.\" ==========
.It Fl d
Display only device statistics.
If this flag is turned on, only device statistics will be displayed, unless
.Fl C
or
.Fl U
or
.Fl T
is also specfied to enable the display of CPU, load average or TTY statistics.
.\" ==========
.It Fl I
Display total statstics for a given time period, rather than average
statistics for each second during that time period.
.\" ==========
.It Fl K
In the blocks transferred display (-o), display block count in kilobytes rather
then the device native block size.
.\" ==========
.It Fl n
Display up to
.Ar devs
number of devices.
.Nm iostat
will display fewer devices if there aren't
.Ar devs
devices present.
.\" ==========
.It Fl o
Display old-style
.Nm iostat
device statistics.
Sectors per second, transfers per second, and miliseconds per seek are
displayed.
If
.Fl I
is specified, total blocks/sectors, total transfers, and
miliseconds per seek are displayed.
.\" ==========
.It Fl T
Display TTY statistics.
This is on by default, unless
.Fl d
is specified.
.\" ==========
.It Fl U
Display system load averages.
This is on by default, unless
.Fl d
is specified.
.\" ==========
.It Fl w
Pause
.Ar wait
seconds between each display.
If no repeat
.Ar count
is specified, the default is infinity.
.El
.Pp
.Nm Iostat
displays its information in the following format:
.Bl -tag -width flag
.It tty
.Bl -tag -width indent -compact
.It tin
characters read from terminals
.It tout
characters written to terminals
.El
.It devices
Device operations.
The header of the field is the device name and unit number.
.Nm iostat
will display as many devices as will fit in a standard 80 column screen, or
the maximum number of devices in the system, whichever is smaller.
If
.Fl n
is specified on the command line,
.Nm iostat
will display the smaller of the
requested number of devices, and the maximum number of devices in the system.
To force
.Nm iostat
to display specific drives, their names may be supplied on the command
line.
.Nm iostat
will not display more devices than will fit in an 80 column screen, unless
the
.Fl n
argument is given on the command line to specify a maximum number of
devices to display, or the list of specified devices exceeds 80 columns.
If fewer devices are specified on the command line than will fit in an 80
column screen,
.Nm iostat
will show only the specified devices.
.Pp
The standard
.Nm iostat
device display shows the following statistics:
.Pp
.Bl -tag -width indent -compact
.It KB/t
kilobytes per transfer
.It tps
transfers per second
.It MB/s
megabytes per second
.El
.Pp
The standard
.Nm iostat
device display, with the
.Fl I
flag specified, shows the following statistics:
.Pp
.Bl -tag -width indent -compact
.It KB/t
kilobytes per transfer
.It xfrs
total number of transfers
.It MB
total number of megabytes transferred
.El
.Pp
The old-style
.Nm iostat
display (using
.Fl o )
shows the following statistics:
.Pp
.Bl -tag -width indent -compact
.It sps
sectors transferred per second
.It tps
transfers per second
.It msps
average milliseconds per transaction
.El
.Pp
The old-style
.Nm iostat
display, with the
.Fl I
flag specified, shows the following statistics:
.Pp
.Bl -tag -width indent -compact
.It blk
total blocks/sectors transferred
.It xfr
total transfers
.It msps
average milliseconds per transaction
.El
.It cpu
.Bl -tag -width indent -compact
.It \&us
% of cpu time in user mode
.It \&sy
% of cpu time in system mode
.It \&id
% of cpu time in idle mode
.El
.El
.Sh EXAMPLES
.Dl iostat -w 1 disk0 disk2
.Pp
Display statistics for the first and third disk devices device every
second ad infinitum.
.Pp
.Dl iostat -c 2
.Pp
Display the statistics for the first four devices in the system twice, with
a one second display interval.
.Pp
.Dl iostat -Iw 3
.Pp
Display total statistics every three seconds ad infinitum.
.Pp
.Dl iostat -odICTw 2 -c 9
.Pp
Display total statistics using the old-style output format 9 times, with
a two second interval between each measurement/display.
The
.Fl d
flag generally disables the TTY and CPU displays, but since the
.Fl T
and
.Fl C
flags are given, the TTY and CPU displays will be displayed.
.Sh SEE ALSO
.Xr fstat 1 ,
.Xr netstat 1 ,
.Xr nfsstat 1 ,
.Xr ps 1 ,
.Xr pstat 8
.Pp
The sections starting with ``Interpreting system activity'' in
.%T "Installing and Operating 4.3BSD" .
.Sh HISTORY
This version of
.Nm iostat
first appeared in
.Nm FreeBSD 3.0 .
