MacOSX10.10.sdk/usr/share/man/man8/mount.8
.\" Copyright (c) 1980, 1989, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)mount.8	8.8 (Berkeley) 6/16/94
.\"
.Dd June 16, 1994
.Dt MOUNT 8
.Os BSD 4
.Sh NAME
.Nm mount
.Nd mount file systems
.Sh SYNOPSIS
.Nm mount
.Op Fl adfruvw
.Op Fl t Ar lfs | external_type
.Nm mount
.Op Fl dfruvw
.Ar special | mount_point
.Nm mount
.Op Fl dfruvw
.Op Fl o Ar options
.Op Fl t Ar lfs | external_type
.Ar special mount_point
.Sh DESCRIPTION
The
.Nm mount
command
calls the
.Xr mount 2
system call to prepare and graft a
.Ar "special device"
or the remote node (rhost:path) on to the file system tree at the point
.Ar mount_point ,
which must be a directory.  If either
.Ar special
or
.Ar mount_point
are not provided, the appropriate information is obtained via the
.Xr getfsent 3
library routines.
.Pp
The system maintains a list of currently mounted file systems.
If no arguments are given to
.Nm mount,
this list is printed.
.Pp
The options are as follows:
.Bl -tag -width indent
.It Fl a
All the filesystems listed via
.Xr getfsent 3
are mounted.
Exceptions are those marked as ``noauto;'' excluded by the
.Fl t
flag (see below); entries that are neither ``ro,'' ``rw,'' or
``rq;'' ``nfs'' entries that also have ``net'' as an option; and
already-mounted ``nfs'' entries.
.It Fl d
Causes everything to be done except for the actual system call.
This option is useful in conjunction with the
.Fl v
flag to
determine what the
.Nm mount
command is trying to do.
.It Fl f
Forces the revocation of write access when trying to downgrade
a filesystem mount status from read-write to read-only.
.It Fl o
Options are specified with a
.Fl o
flag followed by a comma separated string of options.
The following options are available:
.Bl -tag -width indent
.It async
All
.Tn I/O
to the file system should be done asynchronously.
This can be somewhat dangerous with respect to losing data when faced with
system crashes and power outages.
This is also the default.
It can be avoided with the
.Em noasync
option.
.It force
The same as
.Fl f ;
forces the revocation of write access when trying to downgrade
a filesystem mount status from read-write to read-only.
.It noasync
This filesystem should not force all
.Tn I/O
to be written asynchronously.
.It noauto
This filesystem should be skipped when mount is run with the
.Fl a
flag.
.It nodev
Do not interpret character or block special devices on the file system.
This option is useful for a server that has file systems containing
special devices for architectures other than its own.
.It noexec
Do not allow execution of any binaries on the mounted file system.
This option is useful for a server that has file systems containing
binaries for architectures other than its own.
.It noowners
Ignore the ownership field for the entire volume.
This causes all objects to appear as owned by user ID 99 and group ID 99.
User ID 99 is interpreted as the current effective user ID, while group ID 99
is used directly and translates to ``unknown''.
.It nosuid
Do not allow set-user-identifier or set-group-identifier bits to take effect.
.It rdonly
The same as
.Fl r ;
mount the file system read-only (even the super-user may not write it).
.It sync
All
.Tn I/O
to the file system should be done synchronously.
.It update
The same as
.Fl u ;
indicate that the status of an already mounted file system should be changed.
.It union
Causes the namespace to appear as the union of directories
of the mounted filesystem with corresponding directories in the
underlying filesystem.
Lookups will be done in the mounted filesystem first.
If those operations fail due to a non-existent file the underlying
directory is then accessed.
.It noatime
Do not update the file access time when reading from a file.
This option is useful on file systems where there are large numbers of files
and performance is more critical than updating the file access time (which
is rarely ever important).
.It nobrowse
This option indicates that the mount point should not be visible
via the GUI (i.e., appear on the Desktop as a separate volume).
.El
.Pp
Any additional options specific to a filesystem type that is not
one of the internally known types (see the
.Fl t
option) may be passed as a comma separated list; these options are
distinguished by a leading
.Dq \&-
(dash).
Options that take a value are specified using the syntax -option=value.
For example, the mount command:
.Bd -literal -offset indent
mount -t hfs -o nosuid,-w,-m=755 /dev/disk2s9 /tmp
.Ed
.Pp
causes
.Nm mount
to execute the equivalent of:
.Bd -literal -offset indent
/sbin/mount_hfs -o nosuid -w -m 755 /dev/disk2s9 /tmp
.Ed
.It Fl r
Mount the file system read-only (even the super-user may not write it).
The same as the
.Dq rdonly
argument to the
.Fl o
option.
.It Fl t Ar "lfs \\*(Ba external type"
The argument following the
.Fl t
is used to indicate the file system type.
There is no default local file system for use with mount. A type must
be specified in order to mount a non-NFS filesystem.
The \fI-t\fP option can be used
to indicate that the actions should only be taken on
filesystems of the specified type.
More than one type may be specified in a comma separated list.
The list of filesystem types can be prefixed with
.Dq no
to specify the filesystem types for which action should
.Em not
be taken.
For example, the
.Nm mount
command:
.Bd -literal -offset indent
mount -a -t nonfs,hfs
.Ed
.Pp
mounts all filesystems except those of type
.Tn NFS
and
.Tn HFS .
.Pp
If the type is not one of the internally known types,
mount will attempt to execute a program in
.Pa /sbin/mount_ Ns Em XXX
where
.Em XXX
is replaced by the type name.
For example, nfs filesystems are mounted by the program
.Pa /sbin/mount_nfs .
.It Fl u
The
.Fl u
flag indicates that the status of an already mounted file
system should be changed.
Any of the options discussed above (the
.Fl o
option)
may be changed;
also a file system can be changed from read-only to read-write
or vice versa.
An attempt to change from read-write to read-only will fail if any
files on the filesystem are currently open for writing unless the
.Fl f
flag is also specified.
The set of options is determined by first extracting the options
for the file system from the
filesystem table (see
.Xr getfsent 3 )
then applying any options specified by the
.Fl o
argument,
and finally applying the
.Fl r
or
.Fl w
option.
.It Fl v
Verbose mode.
.It Fl w
Mount the file system read-write.
.Pp
The options specific to NFS filesystems are described in the
.Xr mount_nfs 8
manual page.
.El
.Sh SEE ALSO
.Xr mount 2 ,
.Xr getfsent 3 ,
.Xr mount_afp 8 ,
.Xr mount_cd9660 8 ,
.Xr mount_cddafs 8 ,
.Xr mount_fdesc 8 ,
.Xr mount_hfs 8 ,
.Xr mount_msdos 8 ,
.Xr mount_nfs 8 ,
.Xr mount_smbfs 8 ,
.Xr mount_udf 8 ,
.Xr mount_webdav 8 ,
.Xr umount 8
.Sh BUGS
It is possible for a corrupted file system to cause a crash.
.Sh HISTORY
A
.Nm mount
command appeared in
.At v6 .
