MacOSX10.10.sdk/usr/share/man/man8/natutil.8
.\"     $Id: changeip.8 49217 2007-04-26 09:25:28Z cjalbert $
.\"
.\" Copyright (c) 2006-2008 Apple Inc., all rights reserved.
.\" Distributed only as part of Mac OS X Server
.\"
.\" test with groff -mandoc -T ascii ./natutil.8 | less
.Dd July 23, 2007
.Dt natutil 8
.Os "Mac OS X Server" 10.5
.Sh NAME
.Nm natutil
.\" The following lines are read in generating the apropos(man -k) database. Use only key
.\" words here as the database is built based on the words here and in the .ND line. 
.\" Use .Nm macro to designate other names for the documented program.
.Nd Query and configure supported Network Address Translation (NAT) devices
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Op Fl vx
.Op Fl a Ar auth
.Op Fl n Ar name
.Bro
.Fl 1 |
.Fl d |
.Fl m |
.Fl s |
.Fl i |
.Fl L
.Brc
.Pp
.Nm
.Op Fl vx
.Op Fl a Ar auth
.Op Fl n Ar name
.Bro
.Fl t |
.Fl u
.Brc
.Brq Fl T | Fl U
.Fl p Ar ports
.Sh DESCRIPTION          \" Section Header - required - don't modify
.Nm
uses the ACP protocol to detect,
configure, and extract status information from Internet gateway devices (IGDs)
(such as AirPort Base Stations) on the local network. Since most IGDs provide
Network Address Translation (NAT) service, they are often interchangably
referred to as
.Qq NAT devices
or simply 
.Qq NATs .
.Pp
The first synopsis line (with the exception of
.Fl L )
returns various information from NAT devices.
.Pp
The second invocation modifies settings on the device. After modifying
settings, AirPort Base Stations must be rebooted for the changes to take
effect. (
.Xr servermgrd 8
also reboots the AirPort Base Station when it modifies port mappings.)
.Sh OPTIONS
The following options / commands are available:
.Bl -tag -width -indent  \" Differs from above in tag removed 
.It Fl 1
Only return data if the IGD found is also our current gateway. 
.Bq Em AirPort only
Will only return if this base station can be autoconfigured
.It Fl a Ar auth
.Bq Em AirPort only
The authentication string to use when communicating with a
device protected with a password other than the default "public". Used mostly for scripted operation. Use -i to get the authentication 
string interactively.
.It Fl i
Get the authentication string interactively. This preferred over -a for security reasons.
.It Fl d
Reports the IGDs (Internet Gateway Devices) that were found during the discovery.
.It Fl m
Retrieves the port mapping table from the NAT.
.It Fl n Ar name
The prefix of the targeted NAT device's name (useful in a LAN with multiple NAT devices).
.It Fl p Ar ports
A comma-separated list of the ports to tap or untap. Must be used with
.Fl t
or
.Fl u .
.It Fl s
Retrieves the WAN & LAN status and configuration from the IGD.
.It Fl t
Configures the NAT to forward the given ports to this machine. Requires
.Fl p
and either
.Fl T
or
.Fl U .
.It Fl u
Removes the given ports from the NAT's port forwarding rules. Requires
.Fl p
and either
.Fl T
or
.Fl U .
.It Fl v
Verbose output. Provides progress and status information on standard output.
.It Fl x
XML output. This option provides the most information.
.It Fl L
.Bq Em AirPort only
Convert existing DHCP lease into a static reservation so the host will receive
the same IP address after each reboot.
.It Fl T
Ports will be tapped / untapped for the TCP protocol. Must be used with
.Fl t
or
.Fl u .
.It Fl U
Ports will be tapped / untapped for the UDP protocol. Must be used with
.Fl t
or
.Fl u .
.El                      \" Ends the list
.Pp
.\" .Sh ENVIRONMENT      \" May not be needed
.\" .Bl -tag -width "ENV_VAR_1" -indent \" ENV_VAR_1 is width of the string ENV_VAR_1
.\" .It Ev ENV_VAR_1
.\" Description of ENV_VAR_1
.\" .It Ev ENV_VAR_2
.\" Description of ENV_VAR_2
.\" .El                      
.\" .Sh FILES                \" File used or created by the topic of the man page
.\" .Bl -tag -width "/Users/joeuser/Library/really_long_file_name" -compact
.\" .It Pa /usr/share/file_name
.\" FILE_1 description
.\" .It Pa /Users/joeuser/Library/really_long_file_name
.\" FILE_2 description
.\" .El                      \" Ends the list
.\" .Sh DIAGNOSTICS       \" May not be needed
.\" .Bl -diag
.\" .It Diagnostic Tag
.\" Diagnostic informtion here.
.\" .It Diagnostic Tag
.\" Diagnostic informtion here.
.\" .El
.Sh SEE ALSO 
.\" List links in ascending order by section, alphabetically within a section.
.\" Please do not reference files that do not exist without filing a bug report
.Xr ifconfig 8 , 
.Xr ipconfig 8 
.\" .Sh BUGS              \" Document known, unremedied bugs 
.\" .Sh HISTORY           \" Document history if command behaves in a unique manner 
