MacOSX10.10.sdk/usr/share/man/man8/networkd.8
.\" Copyright (c) © 2013 Apple Inc.
.Dd January 2013
.Dt networkd 8
.Os Darwin
.\"
.Sh NAME
.Nm networkd
.Nd network daemon.
.\" 
.Sh SYNOPSIS
.Nm
.\"
.Sh DESCRIPTION
.Nm
is a launch-on-demand daemon that performs operations on behalf of code in
libystem_network, a component of libSystem.
.Pp
.Nm
has no user-specifiable command-line argument, and users should not run
.Nm
manually.
.Pp
.Ss LOGGING
There are several methods with which to examine 
.Nm Ns 's internal state for debugging and diagnostic purposes. The syslog(1)
logging levels map as follows:
.Pp
.Dl Error - Error messages
.Dl Warning - Non-fatal concerns
.Dl Notice - Internal state messages
.Dl Info - Informational messages
.Pp
By default, only log level Notice through Error is logged.
.Pp
Syslog may be used to modify the mask which logging levels are logged.
For example, to enable log levels Emergency - Debug :
.Pp
.Dl % sudo syslog -c networkd -d
.Pp
The networkd settings file may also be used to change the log level.
This method will add some additional logging that may be missing using the
syslog technique listed above. This method is also persistent across runs
of
.Nm
For example, to enable log levels Emergency (1) through Debug (7):
.Pp
.Dl % sudo defaults write /Library/Preferences/com.apple.networkd networkd_log_level -int 7
.Pp
The networkd settings file may also be used to change the log level for code in
libsystem_network. For example, to enable log levels Emergency (1) through Debug (7) for
libsystem_network code:
.Pp
.Dl % sudo defaults write /Library/Preferences/com.apple.networkd libnetcore_log_level -int 7
.Pp
A SIGINFO signal will dump a snapshot summary of the internal state to the
system log at log level NOTICE :
.Pp
.Dl % sudo killall -INFO networkd
.\"
.Sh FILES
.Bl -tag -width 10
.It Pa /usr/libexec/networkd
The binary.
.It Pa /System/Library/LaunchDaemons/com.apple.networkd.plist
The
.Xr launchd.plist 5
controlling the
.Nm
job.
.It Pa /Library/Preferences/com.apple.networkd.plist
An optional preferences file read by networkd.
.El
.\"
.Sh BUGS
.Nm
bugs are tracked in Apple Radar component "networkd".
.\"
.Sh HISTORY
.Nm
first appeared in Mac OS X 10.7.
.\"
.Sh SEE ALSO
.Xr networkd_privileged 8 ,
.Xr syslogd 8 ,
.Xr launchd.plist 5
