MacOSX10.10.sdk/usr/share/man/man8/repair_packages.8
.\" $Id: repair_packages.8,v 1.4 2006/07/07 00:51:08 pmb Exp $
.\" see 'man groff_man' for syntax, 'nroff -man repair_packages.8' to test
.Dd 6/15/06                \" DATE 
.Dt repair_packages 8      \" Program name and manual section number 
.Os Mac OS X
.\"																				NAME 
.Sh NAME
.Nm repair_packages
.Nd verify or repair filesystem permissions and flags for packages.
.\"																				SYNOPSIS 
.Sh SYNOPSIS
.Nm
.Op arguments
.\"																				DESCRIPTION 
.Sh DESCRIPTION
.Nm
is used by Disk Utility to verify or repair permissions on installed packages.
.\"																				ARGUMENTS 
.Sh ARGUMENTS
.Bl -tag
.It "--volume"
Perform all operations on the specified volume or home directory.
The root volume '/' will be used if unspecified.
.It "--list-standard-pkgs"
Output the list of package-id strings corresponding to receipts in the installer's receipt
database that will be verified or repaired by the \fI--standard-pkgs\fP flag.
.It --verify
Verify the specified package(s).
.It --repair
Repair the specified package(s).
.It --pkg Ar package-id
Add the specified package to the list of packages to verify or repair.
.It --standard-pkgs
Add the standard packages to the list of packages to verify or repair.
Use \fI--list-standard-pkgs\fP to view this list.
.It --output-format Ar #
Use a special output format selected by #. Different output formats may be optimized for
human or machine readability. The default output-format is '0', and is a verbose, 
human-readable format.
.El
.\"																				NOTES 
.Sh NOTES
.Nm
only runs on 10.6 or later systems. To verify or repair permissions on earlier systems,
reboot with a Tiger or Leopard system disk and verify or repair permissions with the
.Nm
version on that disk.
.\"																				SEE ALSO 
.Sh SEE ALSO
.Xr pkgutil 1
.Pp
http://lists.apple.com/archives/installer-dev
.\"																				BUGS 
.Sh BUGS
.Nm
does not verify file contents or restore missing files; It can only verify or repair
filesystem permissions.
.\"																				HISTORY 
