MacOSX10.13.sdk/usr/share/man/man1/avbdiagnose.1
.Dd 26/04/15               \" DATE
.Dt avbdiagnose 1      \" Program name and manual section number 
.Os Darwin
.Sh NAME                 \" Section Header - required - don't modify 
.Nm avbdiagnose
.Nd diagnostic tool for AVB.
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Sh DESCRIPTION          \" Section Header - required - don't modify
The 
.Nm
tool is used to capture a snapshot of the current AVB system state and help diagnose 
common issues with AVB.
.Pp                      \" Inserts a space
.Nm
looks for the system to determine that it actually has AVB capable interfaces and that at 
least one of these has been enabled.
.Pp
.Nm
will produce a number of warnings which may not be errors depending on the setup of the system.
Things such as missing local or remote attributes for MSRP will be flagged as a warning but is
not an error if the Mac is not sourcing or sinking streams as appropriate for the warning.
.Pp
.Nm
will flag potential errors and warnings and suggest filing a radar report at http://bugreporter.apple.com.
Please attach the generated file at /tmp/avbdiagnose-<date>.bz2 to the bug report. An error or warning
report may be the result of a network device. Please use your best judgement before filing the bug report.
.Pp
The following options are available:
.Bl -tag -width -a
.It --no-enumeration
Disable the reading of the AVDECC AEM from the device and archiving it in the result.
.It --no-coreaudio
Disable dumping of the state of the AVB audio driver device tree.
.It --acmp-state
Enabled reading of and dumping the ACMP state of the entities.
.It --stream-info
Enable sending of the AVDECC AECP AEM GET_STREAM_INFO command to each of the possible stream sources and sinks and including in the info dump.
.It --stream-counters
Enable sending of the AVDECC AECP AEM GET_COUNTER command to each of the possible stream sources and sinks and including in the info dump.
.It --no-info-tree
Disable dumping of the state of the AVB info tree.
.It --no-timesync
Disable dumping of the state of the Time Sync info tree.
.El
.Sh FILES                \" File used or created by the topic of the man page
.Bl -tag -width "/Users/joeuser/Library/really_long_file_name" -compact
.It Pa /tmp/avbdiagnose-<date>.bz2
output The information gathered by
.Nm
including the command line output, an ioreg dump and the current system.log and kernel.log files.
.El                      \" Ends the list
