MacOSX10.13.sdk/usr/share/man/man1/plutil.1
.\""Copyright (c) 2002-2012, Apple Inc. All Rights Reserved.
.Dd August 30, 2002
.Dt PLUTIL 1
.Os "Mac OS X"
.Sh NAME
.Nm plutil
.Nd property list utility
.Sh SYNOPSIS
.Nm
.Op command_option
.Op other_options
.Ar file
 ...
.Sh DESCRIPTION
.Nm
can be used to check the syntax of property list files, or convert a plist file from one format to another.  Specifying - as an input file reads from stdin.
.Pp
The first argument indicates the operation to perform, one of:
.Bl -tag -width "-convert fmt"
.It Fl help
Show the usage information for the command and exit.
.It Fl p
Print the property list in a human-readable fashion. The output format is not stable and not designed for machine parsing. The purpose of this command is to be able to easily read the contents of a plist file, no matter what format it is in.
.It Fl lint
Check the named property list files for syntax errors.
This is the default command option if none is specified.
.It Fl convert Ar fmt
Convert the named 
.Ar file
to the indicated format and write back to the file system.  If the file can't be loaded due to invalid syntax, the operation fails.
.Bl -tag -width "fmt is one of:"
.It \fIfmt\fR is one of: 
.Sy xml1 ,
for version 1 of the XML plist format
.Sy binary1 ,
for version 1 of the binary plist format
.Sy json ,
for the JSON format
.El
.El
.Pp
There are a few additional options:
.Bl -tag -width "-e extension"
.It Fl -
Specifies that all further arguments are file names
.It Fl s
Don't print anything on success.
.It Fl r
For JSON, add whitespace and indentation to make the output more human-readable.
.It Fl o Ar path
Specify an alternate path name for the result of the -convert operation; this option is only useful with a single file to be converted.  Specifying - as the path outputs to stdout.
.It Fl e Ar extension
Specify an alternate extension for converted files, and the output file names are otherwise the same.
.El
.Pp
.Sh DIAGNOSTICS
The
.Nm
command exits 0 on success, and 1 on failure.
.Sh SEE ALSO 
.Xr plist 5
.Sh STANDARDS
The 
.Nm
command obeys no one's rules but its own.
.Sh HISTORY
The
.Nm
command first appeared in Mac OS X 10.2.
