MacOSX11.0.sdk/usr/share/man/man5/bootptab.5
.\"
.\"
.\" Copyright (c) 2006 Apple Computer, Inc. All rights reserved.
.\"
.\" @APPLE_LICENSE_HEADER_START@
.\" 
.\" This file contains Original Code and/or Modifications of Original Code
.\" as defined in and that are subject to the Apple Public Source License
.\" Version 2.0 (the 'License'). You may not use this file except in
.\" compliance with the License. Please obtain a copy of the License at
.\" http://www.opensource.apple.com/apsl/ and read it before using this
.\" file.
.\" 
.\" The Original Code and all software distributed under the License are
.\" distributed on an 'AS IS' basis, WITHOUT WARRANTY OF ANY KIND, EITHER
.\" EXPRESS OR IMPLIED, AND APPLE HEREBY DISCLAIMS ALL SUCH WARRANTIES,
.\" INCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY,
.\" FITNESS FOR A PARTICULAR PURPOSE, QUIET ENJOYMENT OR NON-INFRINGEMENT.
.\" Please see the License for the specific language governing rights and
.\" limitations under the License.
.\" 
.\" @APPLE_LICENSE_HEADER_END@
.\"
.Dd September 7, 2006
.Dt BOOTPTAB 5
.Os "Mac OS X"
.Sh NAME
.Nm bootptab
.Nd Internet Bootstrap Protocol server database
.Sh DESCRIPTION
The file \fI/etc/bootptab\fR contains a list of host entries used by
\fBbootpd\fR (see
.Xr bootpd 8 )
to associate a hardware address with a particular IP address.
.Pp
The
.Nm
file contains two sections.   The two sections are separated by a single line
containing just "%%".  The first section is ignored.  The second section 
contains host entries, one host per line.  The format of the line is:
.nf
hostname     hwtype     hwaddr     ipaddr     bootfile
.fi
.Sh EXAMPLES
Here is an example \fI/etc/bootptab\fR:
.nf
#
# bootptab example
#
%%
# machine entries have the following format:
# 
# hostname      hwtype  hwaddr              ipaddr          bootfile
client1         1       00:01:02:03:04:05   10.0.0.20       boot0
client2         1       00:a0:b2:ef:ff:0a   10.0.0.20       boot
.fi
.Sh "SEE ALSO"
.Lp
.Xr xinetd 8 ,
.Xr tftpd 8 ,
.Xr netinfo 5 ,
.Xr exports 5
