MacOSX26.2.sdk/usr/share/man/man8/atsutil.8
.\""Copyright (c) 2007-2023 Apple, Inc. All Rights Reserved.
.Dd 2008-12-06
.Dt atsutil 8
.Os Mac OS X
.Sh NAME
.Nm atsutil
.Nd font registration system utility
.\" -------------------------SYNOPSIS SECTION-------------------------
.Sh SYNOPSIS
.Nm
.Sy fonts
.Op Fl list
.br
.Nm
.Sy databases
.Op Fl remove | Fl removeUser
.br
.Nm
.Sy help
.\" -------------------------DESCRIPTION SECTION-------------------------
.Sh DESCRIPTION
.Nm
tool controls some aspects of the font registration system.  It may be used remove font registration databases and caches, or list active fonts.
.Pp
.Sy fonts
enumerates all fonts available to processes in the OS. It also performs a consistency
check of the fonts available via font management APIs.
.Pp
.Sy databases
will remove fontd System or User databases along with any cache files. Removing databases may cause
the loss of font registration state: fonts activated outside the standard font directories, font
faces disabled, and font libraries. New databases will be regenerated from fonts installed the
standard font directories after the user logs out, restarts, or the fontd server is restarted.
.Pp
.\" -------------------------OPTIONS SECTION-------------------------
.Sh OPTIONS
.\" -------------------------Fonts-------------------------
.Sy fonts Op Fl list
.br
.Fl list
lists and performs a consistency check on registered fonts.
.Pp
.\" -------------------------Databases-------------------------
.Sy databases Op Fl remove | removeUser
.br
.Fl remove
remove fontd databases for active user and system (used when no one is logged in and some background processes).
.br
.Fl removeUser
remove fontd databases for the active user only.
.Pp
.Sh SEE ALSO
.Xr fontd 8
.Sh HISTORY
\fBatsutil\fR first appeared in MacOS X 10.5.
