MacOSX26.2.sdk/usr/share/man/man8/caffeinate.8
.\"
.\" Copyright (c) 2010-2012 Apple Inc.  All rights reserved.
.\"
.Dd November 9, 2012
.Dt CAFFEINATE 8
.Os Darwin
.Sh NAME
.Nm caffeinate
.Nd prevent the system from sleeping on behalf of a utility
.Sh SYNOPSIS
.Nm
.Op Fl disu
.Op Ar -t timeout
.Op Ar -w pid
.Op Ar utility arguments...
.Sh DESCRIPTION
.Nm
creates assertions to alter system sleep behavior.  If no assertion flags are
specified,
.Nm
creates an assertion to prevent idle sleep.  If a utility is specified,
.Nm
creates the assertions on the utility's behalf, and those assertions will persist
for the duration of the utility's execution. Otherwise,
.Nm
creates the assertions directly, and those assertions will persist until
.Nm
exits.
.Pp
Available options:
.Bl -tag -width indent
.It Fl d
Create an assertion to prevent the display from sleeping.
.It Fl i
Create an assertion to prevent the system from idle sleeping.
.It Fl m
Create an assertion to prevent the disk from idle sleeping.
.It Fl s
Create an assertion to prevent the system from sleeping. This assertion is valid only when system is running on AC power. 
.It Fl u 
Create an assertion to declare that user is active. If the display is off, this option turns the display on and prevents the display from going into idle sleep. If a timeout is not specified with '-t' option, then this assertion is taken with a default of 5 second timeout.
.It Fl t 
Specifies the timeout value in seconds for which this assertion has to be valid. The assertion is dropped after the specified timeout. Timeout value is not used when an utility is invoked with this command.
.It Fl w 
Waits for the process with the specified pid to exit. Once the the process exits, the assertion is also released.
This option is ignored when used with utility option.
.El
.Sh EXAMPLE
.TP
.Nm Fl i 
make
.br
\t \t \t
.Nm 
forks a process, execs "make" in it, and holds an assertion that prevents idle sleep as long as that process is running.
.Sh SEE ALSO
.Xr pmset 1 
.Sh LOCATION
.Pa /usr/bin/caffeinate
