MacOSX26.2.sdk/usr/share/man/man8/coreaudiod.8
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.\"See Also:
.\"man mdoc.samples for a complete listing of options
.\"man mdoc for the short list of editing options
.\"/usr/share/misc/mdoc.template
.Dd Mon Jul 19 2004               \" DATE 
.Dt coreaudiod 1      \" Program name and manual section number 
.Os Darwin
.Sh NAME                 \" Section Header - required - don't modify 
.Nm coreaudiod
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Sh DESCRIPTION          \" Section Header - required - don't modify
.Nm 
is a daemon used for Core Audio related purposes.
.Nm 
was introduced with OSX version 10.4.