MacOSX26.2.sdk/usr/share/man/man8/DataDetectorsSourceAccess.8
.\"Copyright (c) 2016 Apple Inc.  All Rights Reserved.
.\"
.\"To check for errors: /usr/bin/groff -I/usr/share/man -S -Wall -mtty-char -mandoc -Tascii DataDetectorsSourceAccess.8
.\"
.Dd 16 June 2016
.Dt DDSOURCEACCESS 8
.Os "macOS"
.Sh NAME
.Nm DataDetectorsSourceAccess
.Nd DataDetectors sources utility
.\"
.\" ============================================================================
.\" ========================== BEGIN SYNOPSIS SECTION ==========================
.Sh SYNOPSIS
.Nm
.\" =========================== END SYNOPSIS SECTION ===========================
.\" ============================================================================
.\"
.\" ============================================================================
.\" ======================== BEGIN DESCRIPTION SECTION =========================
.Sh DESCRIPTION
The
.Nm
command manages and controls access to the content of dynamic sources for the DataDetectors clients.
.Pp
This tool should not be run directly.
.\" ========================== END DESCRIPTION SECTION =========================
.\" ============================================================================
.\"
.\" ============================================================================
.\" ======================== BEGIN EXIT STATUS SECTION =========================
.Sh EXIT STATUS
.Nm
will exit on SIGTERM with status 0, or \&>0 if an error occurred.
.\" ========================= END EXIT STATUS SECTION ==========================
.\" ============================================================================
