MacOSX26.2.sdk/usr/share/man/man8/DataDetectorsLocalSources.8
.\"Copyright (c) 2016 Apple Inc.  All Rights Reserved.
.\"
.\"To check for errors: /usr/bin/groff -I/usr/share/man -S -Wall -mtty-char -mandoc -Tascii DataDetectorsLocalSources.8
.\"
.Dd 16 June 2016
.Dt DDLOCALSOURCES 8
.Os "macOS"
.Sh NAME
.Nm DataDetectorsLocalSources
.Nd DataDetectors user source content manager
.\"
.\" ============================================================================
.\" ========================== BEGIN SYNOPSIS SECTION ==========================
.Sh SYNOPSIS
.Nm
.\" =========================== END SYNOPSIS SECTION ===========================
.\" ============================================================================
.\"
.\" ============================================================================
.\" ======================== BEGIN DESCRIPTION SECTION =========================
.Sh DESCRIPTION
The
.Nm
command controls the content of the private user source of DataDetectors. Access to this source will be controlled by DataDetectorsSourceAccess.
.Pp
This tool should not be run directly.
.\" ========================== END DESCRIPTION SECTION =========================
.\" ============================================================================
.\"
.\" ============================================================================
.\" ======================== BEGIN EXIT STATUS SECTION =========================
.Sh EXIT STATUS
.Nm
will exit on SIGTERM with status 0, or \&>0 if an error occurred.
.\" ========================= END EXIT STATUS SECTION ==========================
.\" ============================================================================
.Sh SEE ALSO
.Xr DataDetectorsSourceAccess 8
