MacOSX26.2.sdk/usr/share/man/man8/dhcp6d.8
.\"
.\"
.\" Copyright (c) 2019 Apple Inc. All rights reserved.
.\"
.\" @APPLE_LICENSE_HEADER_START@
.\" 
.\" This file contains Original Code and/or Modifications of Original Code
.\" as defined in and that are subject to the Apple Public Source License
.\" Version 2.0 (the 'License'). You may not use this file except in
.\" compliance with the License. Please obtain a copy of the License at
.\" http://www.opensource.apple.com/apsl/ and read it before using this
.\" file.
.\" 
.\" The Original Code and all software distributed under the License are
.\" distributed on an 'AS IS' basis, WITHOUT WARRANTY OF ANY KIND, EITHER
.\" EXPRESS OR IMPLIED, AND APPLE HEREBY DISCLAIMS ALL SUCH WARRANTIES,
.\" INCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY,
.\" FITNESS FOR A PARTICULAR PURPOSE, QUIET ENJOYMENT OR NON-INFRINGEMENT.
.\" Please see the License for the specific language governing rights and
.\" limitations under the License.
.\" 
.\" @APPLE_LICENSE_HEADER_END@
.\"
.\"     @(#)dhcp6d.8
.\"
.Dd January 7, 2019
.Dt DHCP6D 8
.Os Darwin
.Sh NAME
.Nm dhcp6d
.Nd Stateless DHCPv6 server
.Sh SYNOPSIS
.Nm
\fI[ configuration-file ]\fR
.Sh DESCRIPTION
.Nm 
is a stateless DHCPv6 server used by the
.Xr InternetSharing 8
service.
.Sh "SEE ALSO"
.Lp
.Xr InternetSharing 8
