MacOSX26.2.sdk/usr/share/man/man8/dirhelper.8
.\"
.\" Copyright (c) 2006-2007 Apple Inc. All rights reserved.
.\"
.\" @APPLE_LICENSE_HEADER_START@
.\" 
.\" This file contains Original Code and/or Modifications of Original Code
.\" as defined in and that are subject to the Apple Public Source License
.\" Version 2.0 (the 'License'). You may not use this file except in
.\" compliance with the License. Please obtain a copy of the License at
.\" http://www.opensource.apple.com/apsl/ and read it before using this
.\" file.
.\" 
.\" The Original Code and all software distributed under the License are
.\" distributed on an 'AS IS' basis, WITHOUT WARRANTY OF ANY KIND, EITHER
.\" EXPRESS OR IMPLIED, AND APPLE HEREBY DISCLAIMS ALL SUCH WARRANTIES,
.\" INCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY,
.\" FITNESS FOR A PARTICULAR PURPOSE, QUIET ENJOYMENT OR NON-INFRINGEMENT.
.\" Please see the License for the specific language governing rights and
.\" limitations under the License.
.\" 
.\" @APPLE_LICENSE_HEADER_END@
.\"
.Dd November 1, 2006
.Dt dirhelper 8
.Os "Mac OS X"
.Sh NAME
.Nm dirhelper
.Nd helper for special directory creation
.Sh SYNOPSIS
.Nm dirhelper
.Sh DESCRIPTION
The
.Nm dirhelper
command is a launch-on-demand helper for special
directory creation.  It is launched in a privileged
context via
.Nm launchd
in order to create special directories where the user
would not otherwise have permission to do so.
.Pp
The
.Nm dirhelper
command should not be invoked directly.  It will exit
automatically after a period of inactivity.
.Sh FILES
.Bl -tag -width "/System/Library/LaunchDaemons/com.apple.bsd.dirhelper.plist" -compact
.It Pa /System/Library/LaunchDaemons/com.apple.bsd.dirhelper.plist
.El
.Sh SEE ALSO
.Xr launchd 8 ,
.Xr launchd.plist 5
