MacOSX26.2.sdk/usr/share/man/man8/dynamic_pager.8
.\" Copyright (c) 2003 Apple Computer, Inc.  All rights reserved.
.\"
.Dd July 8, 2003
.Dt DYNAMIC_PAGER 8
.Os "macOS"
.Sh NAME
.Nm dynamic_pager
.Nd swap configuration daemon
.Sh SYNOPSIS
.Nm dynamic_pager
.Op Fl F Ar filename
.Sh DESCRIPTION
The
.Nm dynamic_pager
daemon can be used to specify a base name for swapfile names using the "-F" command line option or by modifying the configuration plist file.
.Sh OPTIONS
.Bl -tag -width Ds
.\" ==========
.It Fl F
The base name of the
.Ar filename
to use for the swapfiles.
By default this is
.Pa /private/var/vm/swapfile .
.\" ==========
.El
.Sh FILES
.Bl -tag -width /System/Library/LaunchDaemons/com.apple.dynamic_pager.plist -compact
.It Pa /private/var/vm/swapfile*
Swapfiles.
.It Pa /System/Library/LaunchDaemons/com.apple.dynamic_pager.plist
Configuration file.
.El
