MacOSX26.2.sdk/usr/share/man/man8/fsck_msdos.8
.\"	$NetBSD: fsck_msdos.8,v 1.10 1999/03/07 11:02:06 mycroft Exp $
.\"
.\" Copyright (C) 1995 Wolfgang Solfrank
.\" Copyright (c) 1995 Martin Husemann
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by Martin Husemann
.\"	and Wolfgang Solfrank.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHORS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHORS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\"
.Dd August 13, 1995
.Dt FSCK_MSDOS 8
.Os NetBSD 1.1
.Sh NAME
.Nm fsck_msdos
.Nd DOS/Windows (FAT) file system consistency check
.Sh SYNOPSIS
.Nm fsck_msdos
.Fl q
.Ar special ...
.Nm fsck_msdos
.Fl p
.Op Fl f
.Ar special ...
.Nm fsck_msdos
.Op Fl fny
.Ar special ...
.Sh DESCRIPTION
.Pp
The
.Nm
utility verifies and repairs
.Tn FAT
file systems (more commonly known
as
.Tn DOS
file systems).
.Pp
The first form of
.Nm
quickly checks the specified file systems to determine whether
they were cleanly unmounted.
.Pp
The second form of
.Nm
preens the specified file systems.
It is normally started by
.Xr fsck 8
run from
.Pa /etc/rc.boot
during automatic reboot, when a FAT file system is detected.
When preening file systems,
.Nm
will fix common inconsistencies non-interactively.  If
more serious problems are found,
.Nm
does not try to fix them, indicates that it was not
successful, and exits.
.Pp
The third form of
.Nm
checks the specified file systems and tries to repair all
detected inconsistencies, requesting confirmation before
making any changes.  The default behavior is to always ask
for confirmation of each change.  Use the -n or -y options
to override this default behavior.
.Pp
The options are as follows:
.Bl -hang -offset indent
.It Fl q
Causes
.Nm
to quickly check whether the volume was unmounted cleanly.
If the volume was unmounted cleanly, then the exit status is 0.
If the volume was not unmounted cleanly, then the exit status
will be non-zero.  In either case, a message is printed to
standard output describing whether the volume was clean or dirty.
.It Fl f
This option is ignored by
.Nm
and is present only for compatibility with programs that
check other file system types for consistency.
.It Fl n
Causes
.Nm
to assume no as the answer to all operator
questions, except
.Dq CONTINUE? .
.It Fl p
Preen the specified file systems.
.It Fl y
Causes
.Nm
to assume yes as the answer to all operator questions.
.It Fl M
Limits the amount of memory used by
.Nm .
.It Fl S Ar directory
Causes
.Nm
to create a shadow file containing all metadata read from the device in the given directory.
This functionality is intended for inclusion with bug reports regarding excpetional problems.
One file is created for each checked device.
.Nm
may re-read metadata from disk at different phases of the repair process. If the repair
process has repaired the metadata, the shadow file will capture its state as last read
from disk. For optimal debug value, the shadow file should be captured in conjunction
with the -n option.
The shadow file's name will be shadow-diskXsY or shadow-fd<X>, depends on the information
given to
.Nm .
If this file already exists,
.Nm
will attempt to add a counter postfix to the name.
The resulting shadow file can be mounted by diskimagetool.
Failure to generate or write to the shadow file will not affect the behavior of
.Nm .

.El
.Sh EXIT VALUES
.Nm
exits with a value of 0 when the filesystem is clean (or has been repaired),
and 8 otherwise.
.Sh SEE ALSO
.Xr fsck 8
