MacOSX26.2.sdk/usr/share/man/man8/gamecontrollerd.8
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.\"See Also:
.\"man mdoc.samples for a complete listing of options
.\"man mdoc for the short list of editing options
.Dd Tue July 5 2022             \" DATE
.Dt gamecontrollerd 8      \" Program name and manual section number
.Os macOS
.Sh NAME                 \" Section Header - required - don't modify
.Nm gamecontrollerd
.\" The following lines are read in generating the apropos(man -k) database. Use only key
.\" words here as the database is built based on the words here and in the .ND line.
.\" Use .Nm macro to designate other names for the documented program.
.Nd game controller daemon
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Sh DESCRIPTION          \" Section Header - required - don't modify
.Nm
arbitrates access to hardware game controllers amongst apps using the GameController framework.
.Pp
There are no configuration options to
.Nm
\&. Users should not run
.Nm
manually.
.Sh FILES          \" Section Header - required - don't modify
.Bl -tag -width xx
.It Pa ~/Library/Preferences/com.apple.GameController.plist
User's game controller settings.  Do not edit this file directly.
.El
.Sh HISTORY
.Nm
was first introduced in Mac OS X version 10.9 (Mavericks).
.Sh SEE ALSO
.Xr GameControllerConfigService 8 
