MacOSX26.2.sdk/usr/share/man/man8/GameControllerConfigService.8
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.\"See Also:
.\"man mdoc.samples for a complete listing of options
.\"man mdoc for the short list of editing options
.Dd Tue July 5 2022             \" DATE
.Dt GameControllerConfigService 8      \" Program name and manual section number
.Os macOS
.Sh NAME                 \" Section Header - required - don't modify
.Nm GameControllerConfigService
.\" The following lines are read in generating the apropos(man -k) database. Use only key
.\" words here as the database is built based on the words here and in the .ND line.
.\" Use .Nm macro to designate other names for the documented program.
.Nd game controller configuration service
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Sh DESCRIPTION          \" Section Header - required - don't modify
.Nm
parses certain configuration files on behalf of
.Nm "gamecontrollerd."
It also manages background updates of game controller configuration data.
.Pp
There are no configuration options to
.Nm
\&. Users should not run
.Nm
manually.
.Sh HISTORY
.Nm
was first introduced in macOS version 13.0 (Ventura).
.Sh SEE ALSO
.Xr gamecontrollerd 8 

