MacOSX26.2.sdk/usr/share/man/man8/kdcsetup.8
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.\"See Also:
.\"man mdoc.samples for a complete listing of options
.\"man mdoc for the short list of editing options
.\"/usr/share/misc/mdoc.template
.\" test using groff -man kdcsetup.8 -T ascii | more
.Dd Tue Mar 11 2003               \" DATE 
.Dt kdcsetup 1      \" Program name and manual section number 
.Os Darwin
.Sh NAME                 \" Section Header - required - don't modify 
.Nm kdcsetup
.\" The following lines are read in generating the apropos(man -k) database. Use only key
.\" words here as the database is built based on the words here and in the .ND line. 
.\" Use .Nm macro to designate other names for the documented program.
.Nd Kerberos 
.Nd Open Directory Single Sign On 
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Op Fl v Ar debug_level
.Op Fl a Ar admin_name
.Op Fl p Ar password          
REALM                \" Arguments
.Sh DESCRIPTION          \" Section Header - required - don't modify
.Nm
is a tool for configuring an Apple Open Directory KDC. It creates
the needed Kerberos files and data for an Open Director master.
.Bl -tag -width "debug_levelxxx"
.It Fl v Ar debug_level
Controls the amount of output generated by kdcsetup.  0 prints errors
and very basic information.  1 prints generatal status information.
Higher levels may add progressively more detail.
.It Fl a Ar admin_name
Name of a directory administrator authorized to make changes in Open
Directory.  This admin will be used as the administrator in the KDC
database.  Required parameter.  Note: this is not a principal name.
.It Fl p Ar password
The password for the above admin.  Required parameter.
.It Ar REALM
The name of the realm that this KDC serves.  Required parameter.
.El                      \" Ends the list
.Pp
.Sh FILES                \" File used or created by the topic of the man page
.Bl -tag -width "/var/db/krb5kdc/principalname" -compact
.It Pa /var/db/krb5kdc/
directory where all the config & database files for the KDC are stored
.It Pa /var/log/krb5kdc/
directory where the log files from the KDC are written
.El
.Sh NOTES
.Nm
is automatically run when creating an Open Directory Master.  It
should NEVER be run manually and will likely be deprecated in the
future.
.Sh SEE ALSO 
.\" List links in ascending order by section, alphabetically within a section.
.\" Please do not reference files that do not exist without filing a bug report
.Xr kadmind 8 ,
.Xr kdc 8 ,
.Xr kerberos 8 ,
.Xr krbservicesetup 8 ,
.Xr opendirectoryd 8 ,
.Xr sso_util 8 
.\" .Sh BUGS              \" Document known, unremedied bugs 
.\" .Sh HISTORY           \" Document history if command behaves in a unique manner 
