MacOSX26.2.sdk/usr/share/man/man8/kuncd.8
.Dd May 23, 2004
.Os Darwin
.Dt kuncd 8
.Sh NAME
.Nm kuncd
.Nd The Kernel User Notification Center daemon.
.Sh DESCRIPTION
The Kernel User Notification Center daemon handles requests by software
executing in the kernel to display notices and alerts to the user.
The daemon also handles kernel reqeusts to execute user-space helper tools.
.Pp
The daemon is launched by
.Xr launchd 8
when a request has been received from the kernel and will exit 15 seconds
after the last request has been processed.
.Pp
The daemon cannot be used directly by the user.
.Sh SIGNALS
.Bl -tag -width SIGTERM 
.It Dv SIGTERM
This signal will result in the daemon unregistering itself from launchd
and exiting.  Once it is unregistered, it will not run again until it is
reregistered.
.El
.Sh SEE ALSO
.Xr launchd 8
.Sh HISTORY
The
.Nm
daemon was introduced in Mac OS X 10.3.
.Sh NOTES
This daemon and its current behavior may change without notice.  Do not
rely on its existence or its behavior.  Consider it an unsupported command.
