MacOSX26.2.sdk/usr/share/man/man8/localemanager.8
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.\"See Also:
.\"man mdoc.samples for a complete listing of options
.\"man mdoc for the short list of editing options
.\"/usr/share/misc/mdoc.template
.Dd 3/11/10               \" DATE 
.Dt localemanager 8      \" Program name and manual section number 
.Os Darwin
.Sh NAME                 \" Section Header - required - don't modify 
.Nm localemanager
.\" The following lines are read in generating the apropos(man -k) database. Use only key
.\" words here as the database is built based on the words here and in the .ND line. 
.\" Use .Nm macro to designate other names for the documented program.
.Nd Configure OpenDirectory Server Locales
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Ar operation
.Op Fl l Ar localename
.Op Fl subnet Ar 1.2.3.4/5
.Op Fl server Ar servername
.Op Fl i Ar IP address
.Sh DESCRIPTION          \" Section Header - required - don't modify
.Nm
creates, destroys, and edits OpenDirectory Server Locale information.
Locales are collections of OpenDirectory servers to
assist clients in locating the nearest OpenDirectory Server.
.Pp
To use OpenDirectory Server Locales, simply create a locale on an OD
server with the
.Ar createLocale 
operation.  Then add servers and subnets to the locale.  All
.Nm
operations are performed on the local OpenDirectory node.
.Pp
The first time a locale is created, a DefaultLocale will
automatically be created as well.  The DefaultLocale will be used for
any clients that don't match a subnet in any other locale.
.Pp
Before a locale can be configured, the server must already be an OpenDirectory
server.
.Pp
Locales can be defined on each of the OD servers or on a single OD
server in the group of OD master/replicas.  For the latter, the locale
information will get replicated to all of the other servers but
locales will need to be "enabled" on the other servers by running the
command 
.Nm
.Ar enableLocales .
.Pp
Commands:
.Bl -tag
.It Ar help
Displays the commands and options.
.It Ar createLocale
Creates a new locale on the local OD server.  This command requires the
.Ar -l
option.
.It Ar deleteLocale
Deletes a locale from the local OD server.  This command requires the
.Ar -l
option.
.It Ar showLocale
Displays the current locale(s).  The
.Ar -l
option can be used to display a specific locale.  If
.Ar -l
is not specified, all locales are displayed.
.It Ar enableLocales
Enables the use of locales on an OD server.  This command is
automatically run the first time any
.Nm
command is run on an OD server.
Therefore this command only needs to be run if no other
.Nm
commands have been (or will be) run on this server.
.It Ar addSubnet
Adds a new subnet to the specified locale.  This command requires the
.Ar -l -subnet
options.
.It Ar removeSubnet
Removes a subnet from the specified locale.  This command requires
.Ar -l -subnet
options.
.It Ar addServer
Adds a server to the specified locale. This command requires the
.Ar -l -server
options.  If the 
.Ar -i
option is specified, that IP address will be used by locale clients.
This may be useful for multi-homed servers to restrict locale clients
to a specific network interface.  If the
.Ar -i
option is not specified the IP address(es) will be looked up.
.It Ar removeServer
Removes a server from the specified locale.  This command requires
.Ar -l -server
options.  If the
.Ar -i
option is specified, only that IP address will be removed from the
locale.  If the 
.Ar -i
option is no specified, all of the server's IP addresses will be
removed from the locale.
.El
.Pp
Options:
.Bl -tag
.It Fl l Ar locale
Locale name.
.It Fl subnet Ar 192.168.0.0/16
Subnet specified in CIDR notation.
.It Fl server Ar server.example.com
Server fully-qualified domain name.
.It Fl i Ar 192.168.1.1
Use this IP address for the server.  Typically used to limit
locale clients to a specific interface on a multi-homed server.
.El
.Pp
.Sh FILES                \" File used or created by the topic of the man page
.Bl -tag -width "/Users/joeuser/Library/really_long_file_name" -compact
.It Pa /var/log/localemanager.log
.Nm
log file.
.El                      \" Ends the list
.Sh SEE ALSO 
.\" List links in ascending order by section, alphabetically within a section.
.\" Please do not reference files that do not exist without filing a bug report
.Xr slapconfig 8  
.\" .Sh BUGS              \" Document known, unremedied bugs 
.Sh HISTORY           \" Document history if command behaves in a unique manner
First introduced in Mac OS X 10.7
