MacOSX26.2.sdk/usr/share/man/man8/mddiagnose.8
.\"Copyright (c) 2007-2011 Apple Inc.  All Rights Reserved.
.\"
.\"To check for errors: /usr/bin/groff -I/usr/share/man -S -Wall -mtty-char -mandoc -Tascii mddiagnose.8 > /dev/null 

.Dd 15 March 2011
.Dt MDDIAGNOSE 8
.Os "Mac OS X"
.Sh NAME
.Nm mddiagnose
.Nd gather information to aid in diagnosing Spotlight issues
.\"
.\" ============================================================================
.\" ========================== BEGIN SYNOPSIS SECTION ==========================
.Sh SYNOPSIS
.Nm
.Fl h
.Nm
.Op Fl f Ar path
.Op Fl e Ar path
.Op Fl p Ar path
.Op Fl n
.\" =========================== END SYNOPSIS SECTION ===========================
.\" ============================================================================
.\"
.\" ============================================================================
.\" ======================== BEGIN DESCRIPTION SECTION =========================
.Sh DESCRIPTION
The
.Nm
tool gathers system and Spotlight information in order to assist Apple when investigating issues related to Spotlight. A great deal of information is harvested, spanning system state, system and Spotlight details.
.Pp
.\" ----------------------------------------------------------------------------
.\" ----------------------- BEGIN HARVEST MANIFEST -----------------------------
.Ss What Nm Sy Collects:
.Bl -bullet -offset indent -compact
.It
A spindump of the system
.It
Several seconds of top output
.It
Individual samples of mds and mdworker
.It
Paths for all files used by Spotlight to contain its database on every volume
.It
All system logs
.It
All spin and crash reports for the following processes:
.\" ----------------------------------------------------------------------------
.\" --------------------------- BEGIN PROCESS SUBLIST --------------------------
.Bl -item -offset 3n -compact
.It
mds
.It
mdworker
.El
.Pp
.\" ---------------------------- END PROCESS SUBLIST ---------------------------
.\" ----------------------------------------------------------------------------
.It
Recent spin and crash reports for the following processes, for all local users:
.\" ----------------------------------------------------------------------------
.\" --------------------------- BEGIN PROCESS SUBLIST --------------------------
.Bl -item -offset 3n -compact
.It
mds
.It
mdworker
.El
.\" ---------------------------- END PROCESS SUBLIST ---------------------------
.\" ----------------------------------------------------------------------------
.Pp
.It
The query text and result quality statistics for recent Spotlight searches.  The actual results of the searches are not gathered
.It
General information about disks and mounted network shares
.It
The path of the last file indexed by each mdworker process on behalf of Spotlight.  The path of the last file which resulted in a crash of an mdworker process.  In each case, only the path is gathered, not the contents of the file
.It
Spotlight configuration for each volume currently mounted on your system.  This includes the path and size of all files used internally by Spotlight as well as a listing of paths that are user excluded from indexing
.It
Comprehensive information about internal state of Spotlight
.El
.\" --------------------------- END HARVEST MANIFEST ---------------------------
.\" ----------------------------------------------------------------------------
.\" ----------------------------------------------------------------------------
.\" ----------------------- BEGIN UNHARVESTED INFORMATION ----------------------
.Ss What Nm Sy Doesn't Collect:
.Bl -bullet -offset indent -compact
.It
No user data is harvested from any volume
.It
No paths or files found by any search are returned
.It
No database storage or user files are returned
.It
No authentication credentials are harvested from the system
.El
.Pp
.\" ------------------------ END UNHARVESTED INFORMATION -----------------------
.\" ----------------------------------------------------------------------------
.\" ========================== END DESCRIPTION SECTION =========================
.\" ============================================================================
.\"
.\" ============================================================================
.\" =========================== BEGIN OPTIONS SECTION ==========================
.Sh OPTIONS
.Bl -hang -compact
.It Fl h
Print full usage.
.It Fl m
Gather a subset of the normal report.
.It Fl f Ar path
Write the diagnostic to the specified path.
.It Fl p Ar path
Gather Spotlight permissions and filter information.  Run as owner of that file.
.El
.\" =========================== END OPTIONS SECTION ============================
.\" ============================================================================
.\"
.\" ============================================================================
.\" ======================== BEGIN EXIT STATUS SECTION =========================
.Sh EXIT STATUS
.Nm
exits with status 0 if there were no internal errors encountered during the diagnostic, or >0 when an error unrelated to external state occurs or unusable input is provided by the user.
.\" ========================= END EXIT STATUS SECTION ==========================
.\" ============================================================================