MacOSX26.2.sdk/usr/share/man/man8/mkfile.8
.\" (c) 1997 Apple Computer, Inc.
.Dd September 1, 1997
.Dt MKFILE 8
.Os "macOS"
.Sh NAME
.Nm mkfile
.Nd create a file
.Sh SYNOPSIS
.Nm
.Op Fl nv
.Ar size\fR[\fP\fBb\fP\fR|\fP\fBk\fP\fR|\fP\fBm\fP\fR|\fP\fBg\fP\fR]\fP
.Ar
.Sh DESCRIPTION
.Nm
creates one or more files that are suitable for use as NFS-mounted swap areas.
The sticky bit is set, and the file is padded with zeroes by default.
Non-root users must set the sticky bit using
.Xr chmod 1 .
The default size unit is bytes, but the following suffixes
may be used to multiply by the given factor:
\fBb\fP (512),
\fBk\fP (1024),
\fBm\fP (1048576), and
\fBg\fP (1073741824).
.Sh OPTIONS
.Bl -tag -width ".Fl n"
.It Fl n
Create an empty
.Ar filename .
The size is noted, but disk blocks aren't allocated until data is
written to them.
.It Fl v
Verbose.
Report the names and sizes of created files.
.El
.Sh WARNING
If a client's swap file is removed and recreated, it must be
re-exported before the client will be able to access it.
This action may only be done when the client is not running.
.Sh "SEE ALSO"
.Xr chmod 2 ,
.Xr stat 2 ,
.Xr sticky 7
