MacOSX26.2.sdk/usr/share/man/man8/netbootdisk.8
.\"
.\" Copyright (c) 2017 Apple Inc. All rights reserved.
.\"
.\" This file contains Original Code and/or Modifications of Original Code
.\" as defined in and that are subject to the Apple Public Source License
.\" Version 2.0 (the 'License'). You may not use this file except in
.\" compliance with the License. Please obtain a copy of the License at
.\" http://www.opensource.apple.com/apsl/ and read it before using this
.\" file.
.\" 
.\" The Original Code and all software distributed under the License are
.\" distributed on an 'AS IS' basis, WITHOUT WARRANTY OF ANY KIND, EITHER
.\" EXPRESS OR IMPLIED, AND APPLE HEREBY DISCLAIMS ALL SUCH WARRANTIES,
.\" INCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY,
.\" FITNESS FOR A PARTICULAR PURPOSE, QUIET ENJOYMENT OR NON-INFRINGEMENT.
.\" Please see the License for the specific language governing rights and
.\" limitations under the License.
.\"
.Dd June 16, 2017
.Dt NETBOOTDISK 8
.Os Darwin
.Sh NAME
.Nm netbootdisk
.Nd find local drive to use with NetBoot
.Sh SYNOPSIS
.Nm
.Sh DESCRIPTION
This command finds a suitable local drive to use with network booting (NetBoot). The local drive is used to store
the shadow file and VM swap files. It is invoked from /etc/rc.netboot during the network boot process.
.Sh SEE ALSO
.Xr bootpd 8
