MacOSX26.2.sdk/usr/share/man/man8/newfs_fskit.8
.\" Copyright (c) 2025 Apple Inc. All rights reserved.
.\"
.\" The contents of this file constitute Original Code as defined in and
.\" are subject to the Apple Public Source License Version 1.1 (the
.\" "License").  You may not use this file except in compliance with the
.\" License.  Please obtain a copy of the License at
.\" http://www.apple.com/publicsource and read it before using this file.
.\"
.\" This Original Code and all software distributed under the License are
.\" distributed on an "AS IS" basis, WITHOUT WARRANTY OF ANY KIND, EITHER
.\" EXPRESS OR IMPLIED, AND APPLE HEREBY DISCLAIMS ALL SUCH WARRANTIES,
.\" INCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY,
.\" FITNESS FOR A PARTICULAR PURPOSE OR NON-INFRINGEMENT.  Please see the
.\" License for the specific language governing rights and limitations
.\" under the License.
.\"
.\"     @(#)newfs_fskit.8
.Dd April 14, 2025
.Dt NEWFS_FSKIT 8
.Os macOS 15
.Sh NAME
.Nm newfs_fskit
.Nd construct a new file system using FSKit
.Sh SYNOPSYS
.Nm
.Op Fl -progress
.Fl t Ar fstype
.Op Ar module_options
.Ar resource
.Sh DESCRIPTION
The
.Nm
utility creates FSKit file systems.
.Pp
The options are as follows:
.Bl -hang -width filexxxxxx
.It Fl -progress
causes
.Nm
to display a progres bar during the creation operation.
.It Fl t Ar fstype
Use the FSKit Module named
.Ar fstype
to perform the creation operation.
.It Ar module_options
Any options supplied as
.Ar module_options
are passed to the file system module as part of the operation.
The valid syntax for these options is set by the specified module.
.El
.Pp
If the selected module's syntax supports a
.Fl t
option, it is possible for a command invocation to have multiple
.Fl t
instances. The first instance must follow the syntax here and
include the
.Ar fstype .
The second may appear anywhere within the
.Ar module_options
and follow the syntax of the module.
.Sh RESOURCE
FSModules use different storage and connection technologies
as the basis for file systems. FSKit uses the term Resource to
cover this variety. FSKit recognizes three categories of resources:
.Bl -hang -width blockxdevice
.It Ar Block Device
This category covers traditional disk drives and partitions. An
example resource of this kind is:
.Ar /dev/disk2s1
or
.Ar /dev/rdisk2s1 .
FSKit does not differentiate between block and raw disk semantics.
.Xr diskarbitrationd 8
can automatically mount file systems which use these resources.
.It Ar Path URL
This category covers a file system using a pre-existing volume
as its data storage. Additionally, the
.Nm
command shares path access privileges with the FSModule.
An example resource of this kind is:
.Ar file:///private/tmp/workdir
.It Ar Generic URL
This category covers file systems using other connection
technologies. The structure of these resources is that they
are URLs following a scheme specific to the file system.
.El
.Sh SEE ALSO
.Xr diskarbitrationd 8 ,
.Xr fsck_fskit 8
