MacOSX26.2.sdk/usr/share/man/man8/pbs.8
.\""Copyright (c) 2021 Apple Computer, Inc. All Rights Reserved.
.Dd June 1, 2006
.Dt PBS 8  
.Os "macOS"       
.Sh NAME
.Nm pbs
.Nd general helper tool
.Sh SYNOPSIS
.Nm
.Op Fl debug
.Op Fl dump
.Op Fl read_bundle Ar PATH
.Op Fl flush
.Op Fl update
language1 language2 ...
.Sh DESCRIPTION
.Nm
is an agent for the Services menu.  It scans for and vends available Services, to populate the Services menu.
.Pp
.Nm
is NOT related to the pasteboard.  The pasteboard is managed by the pboard agent.
.Pp
.Nm
normally runs the first time Services are needed in any login session.  You may run it manually for debugging Services. If run without any options, pbs will scan for changed Services, cache them along with their English localization, and immediately update the Services menu in all running apps. It will also log about any invalid Services declarations in Info.plist. This is useful when developing or testing Services, because it immediately applies any changes.
.Pp
ServicesMenu.strings files for a localization are loaded only when an app running under that localization shows the Services menu.  You may pass pbs language codes (e.g. "fr") to cause it to load that localization immediately.
.Pp
.Nm
has additional options that are useful for debugging, in particular the -dump and -read_bundle options. The complete list of options is:
.Bl -tag -width "-e"
.It Fl debug
Output debugging information regarding what pbs is doing.
.It Fl dump
Prints the userdef cache of Services information.  pbs caches Services information in its userdefs to avoid scanning the entire system every boot.  Changed apps are still detected via FSEvents, so there is no need to flush the userdef cache when installing a new Service.
.It Fl read_bundle Ar PATH
Prints the Services information for the given application or service bundle. Does not update the cache.
.It Fl flush
Erases the userdef cache, entirely resetting pbs. The next time Services information is needed, pbs will do a complete rescan for apps vending Services, and read their plist.  Note: this rescan may be very expensive!
.It Fl update
Updates the userdef cache. pbs will do a complete rescan for apps vending Services, and read their plist.
.El
.Sh HISTORY
First appeared in NextStep.  pbs has historically had responsibilities that ranged from pasteboard management to Unicode glyph generation, but now it only does Services.
