MacOSX26.2.sdk/usr/share/man/man8/quitreally.8
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.\"See Also:
.\"man mdoc.samples for a complete listing of options
.\"man mdoc for the short list of editing options
.\"/usr/share/misc/mdoc.template
.Dd 8/4/10               \" DATE
.Dt quitreally 1      \" Program name and manual section number
.Os Darwin
.Sh NAME                 \" Section Header - required - don't modify
.Nm quitreally
.\" The following lines are read in generating the apropos(man -k) database. Use only key
.\" words here as the database is built based on the words here and in the .ND line.
.Nd diagnostic support for this feature
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Op Fl h              \" [-abcd]
.Op Fl -help
.Op Fl v
.Op Fl -verbose
.Op Fl -status
.Op Fl -inspect Ar APP
.Op Fl -visible Ar APP
.Sh DESCRIPTION          \" Section Header - required - don't modify
.Nm
Query various bits of infomation about the quit really feature.
.Pp                      \" Inserts a space
.Sh Commands
.Bl -tag -width -indent
.It Fl --status
Returns information about the applications which have exited and left behind running non-visible children applications, processes, or loaded jobs.
.It Fl -inspect Ar APP
Returns information about the application specified by Ar APP
.It Fl -visible Ar APP
Returns whether the given application is visible or not.
.El
.Sh Specifying an application
Applications are specified either by
.Bl -tag -width -indent  \" Begins a tagged list
.It name
the name of the application
.It bundleIdentifier
the bundle identifier of the application
.It ASN
the ASN of a running application, specified as 0xAAAAAAAA-0xBBBBBBBB, where A and B are hex digits
.It PID
the pid of a running application
.It bundle path
the bundle path of a running application
.It all
all applications
.It exited
all applications which have exited but left behind
.El                      \" Ends the list
.Pp
.\" .Sh ENVIRONMENT      \" May not be needed
.\" .Bl -tag -width "ENV_VAR_1" -indent \" ENV_VAR_1 is width of the string ENV_VAR_1
.\" .It Ev ENV_VAR_1
.\" Description of ENV_VAR_1
.\" .It Ev ENV_VAR_2
.\" Description of ENV_VAR_2
.\" .El
.\" .Sh DIAGNOSTICS       \" May not be needed
.\" .Bl -diag
.\" .It Diagnostic Tag
.\" Diagnostic informtion here.
.\" .It Diagnostic Tag
.\" Diagnostic informtion here.
.\" .El
.\" .Sh BUGS              \" Document known, unremedied bugs
.\" .Sh HISTORY           \" Document history if command behaves in a unique manner
