MacOSX26.2.sdk/usr/share/man/man8/security_authtrampoline.8
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.\"See Also:
.\"man mdoc.samples for a complete listing of options
.\"man mdoc for the short list of editing options
.\"/usr/share/misc/mdoc.template
.Dd 9/22/04               \" DATE 
.Dt security_authtrampoline 8      \" Program name and manual section number 
.Os Darwin
.Sh NAME                 \" Section Header - required - don't modify 
.Nm security_authtrampoline
.\" The following lines are read in generating the apropos(man -k) database. Use only key
.\" words here as the database is built based on the words here and in the .ND line. 
.\" Use .Nm macro to designate other names for the documented program.
.Nd Trampoline used by AuthorizationExecuteWithPrivileges from Security.framework.
.Sh SYNOPSIS             \" Section Header - required - don't modify
.Nm
.Sh DESCRIPTION          \" Section Header - required - don't modify
.Nm
is used when programs use AuthorizationExecuteWithPrivileges from
Security.framework to run another program with root privileges.  
The
.Nm 
command uses the authorization infrastructure to determine whether
it should proceed.
You should not run it by itself.
Execution of other programs is logged with
.Xr syslog 3
to channel LOG_AUTH at LOG_NOTICE level.
.\" .Sh SEE ALSO 
.\" List links in ascending order by section, alphabetically within a section.
.\" Please do not reference files that do not exist without filing a bug report
.\" .Xr authorization 5
.\" .Sh BUGS              \" Document known, unremedied bugs 
.\" .Sh HISTORY           \" Document history if command behaves in a unique manner 
