MacOSX26.2.sdk/usr/share/man/man8/smbdiagnose.8
.\"Copyright (c) 2016 Apple Inc.  All Rights Reserved.
.\"
.\"To check for errors: /usr/bin/groff -I/usr/share/man -S -Wall -mtty-char -mandoc -Tascii tmdiagnose.8 > /dev/null 

.Dd 15 July 2016
.Dt SMBDIAGNOSE 8
.Os "macOS"
.Sh NAME
.Nm smbdiagnose
.Nd gather information to aid in diagnosing SMB file sharing issues
.\"
.\" ============================================================================
.\" ========================== BEGIN SYNOPSIS SECTION ==========================
.Sh SYNOPSIS
.Nm
.Fl h
.Nm
.Op Fl f Ar path
.Op Fl s
.\" =========================== END SYNOPSIS SECTION ===========================
.\" ============================================================================
.\"
.\" ============================================================================
.\" ======================== BEGIN DESCRIPTION SECTION =========================
.Sh DESCRIPTION
The
.Nm
tool gathers system information and network traffic in order to assist Apple when investigating issues related to SMB file sharing.
A great deal of information is harvested, spanning system state, system configuration, and network traffic related to SMB file sharing.
.Pp
.\" ----------------------------------------------------------------------------
.\" ----------------------- BEGIN HARVEST MANIFEST -----------------------------
.Ss What Nm Sy Collects:
.Bl -bullet -offset indent -compact
.It
A network packet trace of SMB file sharing traffic that occurs during the time the tool is run.
This packet trace may include file names and file data.
It may also include the authentication exchange used to log into the SMB
server.
.It
Enhanced debug logs for the SMB server process.
.It
If the
.Fl s
option is specified, the default set of information collected by
.Xr sysdiagnose 1 .
.El
.\" --------------------------- END HARVEST MANIFEST ---------------------------
.\" ----------------------------------------------------------------------------
.\" ----------------------------------------------------------------------------
.\" ----------------------- BEGIN UNHARVESTED INFORMATION ----------------------
.Ss What Nm Sy Doesn't Collect:
.Bl -bullet -offset indent -compact
.It
No authentication credentials are harvested from the system
.El
.Pp
.\" ------------------------ END UNHARVESTED INFORMATION -----------------------
.\" ----------------------------------------------------------------------------
.\" ========================== END DESCRIPTION SECTION =========================
.\" ============================================================================
.\"
.\" ============================================================================
.\" =========================== BEGIN OPTIONS SECTION ==========================
.Sh OPTIONS
.Bl -hang -compact
.It Fl h
Print full usage.
.It Fl f Ar path
Write the diagnostic to the specified path.
The default is
.Dq ~/Desktop .
.It Fl s
Collect
.Xr sysdiagnose 1
information.
The default is not to collect
.Xr sysdiagnose 1
information.
.El
.\" =========================== END OPTIONS SECTION ============================
.\" ============================================================================
.\"
.\" ============================================================================
.\" ======================== BEGIN EXIT STATUS SECTION =========================
.Sh EXIT STATUS
.Nm
exits with status 0 if there were no internal errors encountered during the diagnostic, or >0 when an error unrelated to external state occurs or unusable input is provided by the user.
.\" ========================= END EXIT STATUS SECTION ==========================
.\" ============================================================================
