MacOSX26.2.sdk/usr/share/man/man8/sntpd.8
.Dd October 16, 2020
.Dt SNTPD 8
.Os Darwin
.Sh NAME
.Nm sntpd
.Nd very Simple Network Time Protocol server daemon
.Sh SYNOPSIS
launchctl enable system/com.apple.sntpd
.Pp
.Nm
.Op Fl L
.Op Fl z Ar state_file
.Sh DESCRIPTION
.Nm
is an SNTP server daemon, which can provide time synchronization services to clients such as
.Xr timed 8 .
.Pp
The following options are available:
.Bl -tag -width indent
.It Fl L
Overwrite any existing state with a header describing a stratum 1 uncalibrated local clock.
This is useful for starting a root (primary) server that doesn't use
.Xr sntp 1
to synchronize with a higher stratum server.
.It Fl z Ar state_file
Specify where to get the header data from.
.Pp
When unspecified, the default location is
.Pa state.bin
in the current working directory.
When managed by launchd, the default system location is
.Pa /var/sntpd/state.bin .
.Pp
If the file does not exist, it will be created and populated with a template indicating that the server is unsynchronized.
.El
.Sh FILES
.Bl -tag -width "/System/Library/LaunchDaemons/com.apple.sntpd.plist" -compact
.It Pa /var/sntpd/state.bin
SNTP header data
.It Pa /System/Library/LaunchDaemons/com.apple.sntpd.plist
launchd job
.El
.Sh SEE ALSO
.Xr launchctl 1 ,
.Xr sntp 1 ,
.Xr clock_gettime 3 ,
.Xr timed 8
.\" .Sh STANDARDS       \" Standards relating to command being described
.Sh HISTORY
.Nm
first appeared in macOS 11.1
