MacOSX26.2.sdk/usr/share/man/man8/sociallayerd.8
.Dd October 21, 2020
.Dt SOCIALLAYERD 8
.Os Darwin
.Sh NAME
.Nm sociallayerd
.Nd Vends privacy-sensitive social UI for display throughout the system.
.Sh SYNOPSIS
takes no arguments, and users should not launch it manually.
.Sh DESCRIPTION
When sensitive social UI elements (such as contact photos and names) are displayed in an application via SocialLayer.framework, that application should not have access to the contents of those elements. In order to protect users' private information, the actual layers for those elements are generated by sociallayerd, while keeping them out of the app's address space. CoreAnimation can then render the sensitive layers together with the application layers.
.Sh HISTORY
sociallayerd first appeared in macOS 12.0 and iOS 15.0
