MacOSX26.2.sdk/usr/share/man/man8/spindump.8
.Dd April 19, 2016
.Dt spindump 8
.Os Darwin
.Sh NAME
.Nm spindump 
.Nd Profile entire system during a time interval
.Sh SYNOPSIS
.Nm spindump
.Op pid | partial-name Op duration Op interval
.Op <options>
.Sh DESCRIPTION
.Nm spindump 
is used by various system components to create reports when an unresponsive application is force quit. Reports are stored at:
.Pp
/Library/Logs/DiagnosticReports/
.Pp
For normal application force quits spindump will display a dialog to offer the choice to view more details and/or send a report to Apple.
.Pp
-------------------------------------
.Pp
When run manually, spindump samples user and kernel callstacks for every process in the system. Spindump supports two display formats for callstacks, heavy and timeline, and includes a binary representation of its data at the end of reports for re-reporting with different options (see
.Fl i
). Spindump can also parse reports in timeline format even without a binary representation to re-report them in heavy format.
.Pp
When displayed in
.Nm heavy
format, callstacks are sorted by count and each unique callstack is displayed once. In this snippet:
.Pp
84  __CFRunLoopRun + 1161 (CoreFoundation + 460665) [0x7fff8d662779]
.Pp
Address 0x7fff8d662779 was sampled 84 times in total, not necessarily consecutively. The address corresponds __CFRunLoopRun in CoreFoundation.
.Pp
When displayed in
.Nm timeline
format, callstacks are sorted so that the leaf frames in the call tree are presented in chronological order. Each frame includes a time range of consecutive callstacks in which the frame was seen, which can be compared with the range of other frames to determine concurrency. If multiple samples of the same callstack were not consecutive, the callstack will be displayed multiple times. In this snippet:
.Pp
23  __CFRunLoopRun + 1161 (CoreFoundation + 460665) [0x7fff8d662779] 50-72
.Pp
Address 0x7fff8d662779 was sampled 23 times consecutively from the 50th to 72nd sample.
.Pp
In timeline format, spindump notes state changes for threads, e.g.:
.Pp
<darwinbg, timers coalesced>
.Pp
which indicates the change in state for the samples that follow. Any state not mentioned is unchanged from previous samples. The state information spindump reports includes thread QoS, darwinbg, importance inheritance boost, suppression for App Nap, latency QoS (timers), I/O throttling tier, and cpu priority.
.Pp
Leaf frames will indicate whether the thread was running/runnable or suspended.
.Pp
A leading star (*) indicates a kernel frame or library.
.Sh ARGUMENTS
.Nm pid
or
.Nm partial-name
the process to be sorted topmost in the report. "-notarget" may be used to avoid providing a target process when specifying a duration and interval.
.Pp
.Nm duration
the duration of the sampling in seconds. If not specified, the default of 10 seconds is used.
.Tp
.Nm interval
the number of miliseconds between samples. If not specified, the default of 10 miliseconds is used.
.Pp
.Fl i Ar path
Read in the file located at
.Ar path
rather than sampling the live system. Supported file formats are:
.Pp
    * Spindump text files containing a spindump binary format
    * Spindump text files without a spindump binaty format written in timeline mode (with limited options, and only callstacks will be updated; summary information will not change)
    * Tailspin files
    * Concatenated kcdata stackshots
    * Concatenated microstackshots
.Pp
.Fl o Ar path
Specifies where the report should be written. If
.Ar path
is a file, it will be overwritten. If
.Ar path
is a directory, a file will be created inside that directory with the name following the format <appname>_<pid>.spindump.txt. If a file by that name already exists, spindump will add a unique number to the filename. If not specified, spindump will output reports to files inside /tmp.
.Pp
.Fl indexRange Ar s-e
Only include samples in the given range
.Pp
.Fl startIndex Ar s
Omit frames before sample number
.Ar s
.Pp
.Fl endIndex Ar e
Omit frames after sample number
.Ar e
.Pp
.Fl heavy
Sort callstacks by count (default)
.Pp
.Fl timeline
Sort callstacks chronologically
.Pp
.Fl wait
Wait for the process to exist before sampling. If the process already exists, spindump will begin sampling immediately.
.Pp
.Fl onlyRunnable
Only display runnable callstacks
.Pp
.Fl onlyBlocked
Only display non-runnable callstacks
.Pp
.Fl onlyTarget
Only sample the target process (allows faster sampling rates)
.Pp
.Fl proc
.Ar proc
If
.Fl onlyTarget
is provided, sample
.Ar proc
as well. This option may be specified multiple times
.Pp
.Fl sampleWithoutTarget
Keep sampling for the entire sampling duration even if the target process exits
.Pp
.Fl timelimit Ar t
Exit after
.Ar t
seconds even if the report hasn't been saved
.Pp
.Fl stdout
Print the report to stdout (in addition to writing to a file)
.Pp
.Fl noFile
Do not output to a file. Implies -stdout and will include the binary format in the stdout output
.Pp
.Fl noBinary
Do not include the spindump binary format at the bottom of the report (the file will not be able to be re-parsed)
.Pp
.Fl noText
Do not include the textual report, only include the binary format
.Pp
.Fl open Ar appname
Specifies an app in which to open the resulting report
.Pp
.Fl reveal
Reveal the resulting report in Finder
.Pp
.Fl siginfo
After sampling, wait for SIGINFO before generating the report
.Pp
.Fl delayonsignal Ar d
Stop sampling
.Ar d
seconds after receiving a signal to stop sampling instead of stopping immediately
.Pp
.Fl threadprioritythreshold Ar t
Filter out any threads that have a priority below the given threshold. Pass a negative number to filter out threads that have a priority above the given threshold's absolute value
.Pp
.Fl nothrottle
Do not throttle sampling rate on excessive memory growth
.Pp
.Fl noProcessingWhileSampling
Do not parse stackshots until done sampling
.Pp
.Fl displayIdleWorkQueueThreads
Display idle work queue threads in the textual report (by default they are omitted)
.Pp
.Fl aggregateCallTreesByThread
Group call trees by thread ID rather than by dispatch queue
.Pp
.Fl aggregateCallTreesByProcess
Each process gets one call tree for all threads
.Pp
.Fl omitFramesBelowSampleCount Ar c
Omit frames with count below
.Ar c
.Pp

.Sh MICROSTACKSHOTS
.Pp
Microstackshots are gathered by the kernel to provide extremely lightweight sampling of single threads at a time. They can be viewed in spindump via the microstackshot command line options:
.Pp
.Fl microstackshots
Report on interrupt microstackshots, which provide a sampling of where cpu time is spent. This is the default mode if
.Fl microstackshots_io
is not provided
.Pp
.Fl microstackshots_io
Report on I/O microstackshots, which provide a sampling of where file backed memory is dirtied
.Pp
.Fl microstackshots_datastore Ar path
When reporting microstackshots, read from this location rather than using the live system's microstackshots. When saving with
.Fl microstackshots_save,
write to this location
.Pp
.Fl microstackshots_save
Save microstackshot from the live system to the path specified by
.Fl microstackshots_datastore
instead of generating a textual report
.Pp
.Fl microstackshots_starttime Ar date
Only report microstackshots after this time. The date can be a string like "11/14/12 12:00am" or a single number representing a unix timestamp in seconds
.Pp
.Fl microstackshots_endtime Ar date
Only report microstackshots before this time. The date can be a string like "11/14/12 12:00am" or a single number representing a unix timestamp in seconds
.Pp
.Fl microstackshots_pid Ar pid
Only report microstackshots for the given process id
.Pp
.Fl microstackshots_threadid Ar thread_id
Only report microstackshots for the given thread id
.Pp
.Fl microstackshots_dsc_path Ar path
Path to a directory containing dyld shared cache layout files. If not specified, spindump uses the historical information for the current machine
.Pp
.Fl batteryonly
Only include microstackshots taken while the machine was running on battery power
.Pp
.Fl aconly
Only include microstackshots taken while the machine was running on AC power
.Pp
.Fl useridleonly
Only include microstackshots taken while the user was idle
.Pp
.Fl useractiveonly
Only include microstackshots taken while the user was active
.Sh SEE ALSO
.Xr SubmitDiagInfo 8 ,
.Xr sample 1 
