MacOSX26.2.sdk/usr/share/man/man8/talagent.8
.\""Copyright (c) 2010-2024 Apple Computer, Inc. All Rights Reserved.
.Dd September 1, 2010
.Dt TALAGENT 8  
.Os "macOS"       
.Sh NAME
.Nm talagent
.Nd interact with persistent state and the application lifecycle.
.Sh SYNOPSIS
.Nm
.Op Ar command Op Ar arguments
.Sh DESCRIPTION
.Nm allows you to output information about persistent state and interact with application lifecycle features.
.Pp
The options are as follows:
.Bl -tag -width "-e"
.It Fl help
Outputs usage information.
.It Fl dump Ar \&bundle_id_fragment
Outputs the persistent state of an application whose bundle ID contains the given fragment, case insensitive ("textedit" for example).  You may also pass a path directly to the app's persistent state directory, usually in ~/Library/Saved Application State.
.El
.Bl -tag -width "-e"
.It Fl launch Ar \&bundle_id
This launches an app (in this case, TextEdit) in a manner approximating how apps get launched at login. You can pass either a bundle ID fragment or a path to an app.  The app is maintained stopped until you hit return in the launching window (or until it receives SIGCONT). This is the easiest way to test the login scenario without needing to log in.
.El
.Bl -tag -width "-e"
.It Xo Fl casinfo
.Op ASN
.Xc
With no arguments, outputs summary information about all apps. With one argument (an ASN), outputs the CAS record for that app.
.El
.Bl -tag -width "-e"
.It Fl memory_pressure
Simulates memory pressure, which may cause apps that support automatic termination to exit. This does not actually allocate any memory.
.El
.Bl -tag -width "-e"
.It Fl vacuum
Rotates the bitmap encryption key, and attempts to cross-encrypt all existing window bitmaps under the new key. This is done periodically by talagent.
.El
.Sh HISTORY
First appeared in Mac OS X 10.7
