MacOSX26.2.sdk/usr/share/man/man8/taskgated.8
.\"Modified from man(1) of FreeBSD, the NetBSD mdoc.template, and mdoc.samples.
.Dd 2/27/07               \" DATE 
.Dt taskgated 8      \" Program name and manual section number 
.Os Darwin
.Sh NAME                 \" Section Header - required - don't modify 
.Nm taskgated
.\" The following lines are read in generating the apropos(man -k) database. Use only key
.\" words here as the database is built based on the words here and in the .ND line. 
.Nd task_for_pid access control daemon
..Sh DESCRIPTION          \" Section Header - required - don't modify
.Nm
is a system daemon that implements a policy for the task_for_pid system service.
When the kernel is asked for the task port of a process, and preliminary access control
checks pass, it invokes this daemon (via launchd) to make the decision.
.Pp
.\" .Sh ENVIRONMENT      \" May not be needed
.\" .Bl -tag -width "ENV_VAR_1" -indent \" ENV_VAR_1 is width of the string ENV_VAR_1
.\" .It Ev ENV_VAR_1
.\" Description of ENV_VAR_1
.\" .It Ev ENV_VAR_2
.\" Description of ENV_VAR_2
.\" .El 
.Sh AUTHORIZATION RIGHTS
.Bl -tag -width system.privilege.taskport.debug -compact
.It Pa system.privilege.taskport
Authorization right used to check access of processes with the \fBcom.apple.security.cs.debugger\fR entitlement.
.It Pa system.privilege.taskport.safe
Authorization right used to check access of processes with the \fBcom.apple.private.cs.debugger.safe\fR entitlement.
.It Pa system.privilege.taskport.debug
Authorization right used to check access of processes with the \fBcom.apple.private.cs.debugger\fR entitlement.
.El
.Sh INFO KEYS
.Bl -tag -width SecTaskAccess
.It Pa SecTaskAccess
(\fBDEPRECATED as of macOS 10.14\fR, use the com.apple.security.cs.debugger entitlement instead) A value of "allowed" can be set for any program that wants
access to task ports.
.El
.Sh FILES                \" File used or created by the topic of the man page
.Bl -tag -width "/etc/authorization" -compact
.It Pa /etc/authorization
to configure the authorization used.
.It Pa /System/Library/LaunchDaemons/com.apple.taskgated
startup configuration file for
.Nm
.
.El                      \" Ends the list
.\" .Sh DIAGNOSTICS       \" May not be needed
.\" .Bl -diag
.\" .It Diagnostic Tag
.\" Diagnostic informtion here.
.\" .It Diagnostic Tag
.\" Diagnostic informtion here.
.\" .El
.Sh SEE ALSO 
.Xr security 1 , 
.Xr launchd 8
