MacOSX26.2.sdk/usr/share/man/man8/transparencyd.8
.\" Copyright (c) 2018-2025 Apple Inc. All rights reserved.
.Dd 7 Jan, 2025
.Dt transparencyd 8
.Os Darwin
.Sh NAME
.Nm transparencyd
.Nd The transparency daemon.
.Sh DESCRIPTION
.Nm
is a system daemon that verifies transparency information for
.Nm identityservicesd
and it's clients, like
.Nm Messages.app .
.Pp
The
.Dq transparency
part of the name comes from the fact that there is a publicly auditable,
verifiable, log-backed map data structure to ensure consistency of IDS/iMessage public keys.
the daemon performs automatic verification as part of the key transparency feature
.Pp
.Nm transparencyd
is not intended to be invoked directly, but launchd though
.Nm launchd .
.Sh SEE ALSO
.Xr swtransparencyd 8
.Xr launchd 8
.Xr launchd.conf 5
