MacOSX26.2.sdk/usr/share/man/man8/vsdbutil.8
.Dd December 19, 2001
.Dt VSDBUTIL 8
.Os Darwin
.Sh NAME
.Nm vsdbutil
.Nd manipulates the volume status DB.
.Sh SYNOPSIS
.Nm
.Op Fl a Ar path
.Pp
.Nm
.Op Fl c Ar path
.Op Fl d Ar path
.Op Fl i
.Pp
.Nm
.Op Fl h
.Sh DESCRIPTION
.Nm
manipulates the volume status DB.
The following options are available:
.Bl -tag -width -indent
.It Fl a
adopts (activates) on-disk ownership on the specified path
.It Fl c
checks the status of the ownership usage on the specified path
.It Fl d
disowns (deactivates) the on-disk ownership on the specified path
.It Fl i
initializes the ownership database to include all mounted HFS+ and APFS volumes
.It Fl x
clears the entry associated with the specified path from the database
.It Fl h
prints out a simple help message
.El
.Pp
The
.Nm
command is deprecated; using a volume UUID in
.Xr fstab 5
is preferred.
.Sh FILES
.Bl -tag -width "/Users/joeuser/Library/really_long_file_name" -compact
.It Pa /var/db/volinfo.database
Database of volumes managed via
.Nm .
.El
.Sh SEE ALSO
.Xr diskutil 8 ,
.Xr mount 8 ,
.Xr fstab 5
