MacOSX26.2.sdk/usr/share/man/man8/weakpass_edit.8
.\"     $Id: weakpass_edit.8,v 1.1 2004/07/27 23:02:29 snsimon Exp $
.\"
.\" Copyright (c) 2002 Apple Computer, Inc., all rights reserved.
.\" Distributed only as part of Mac OS X Server
.Dd 21 February 2002
.Dt weakpass_edit 8
.Os "Mac OS X Server"
.Sh NAME
.Nm weakpass_edit
.Nd Mac OS X Server Password Server weak password dictionary insertion tool
.Sh SYNOPSIS
.Pp
.Nm add
.Oo
.Op Fl p Ar passphrase
|
.Op Fl f Ar file
.Oc
.Nm delete
.Oo
.Op Fl p Ar passphrase
|
.Op Fl f Ar file
.Oc
.Sh DESCRIPTION
.Nm
Adds weak or undesirable passwords to a dictionary of passwords to be rejected by the password server.
.Pp
.Nm
must be run as root; it will exit otherwise.
.Pp
This tool's purpose is to manage the weak password dictionary. 
.Pp
.Sh OPTIONS
The following options are available:
.Bl -tag -width flag
.It Fl p
add or delete a passphrase, provided as a command-line argument, to the weak password database.
.It Fl f
add or delete all passphrases contained in a file.
.El
.Sh USAGE
.Sh FILES & FOLDERS
.nf
/var/db/authserver - the password server database repository. The weak password files are here.
/var/db/authserver/weakpasswords.[n] - an alphabetized list of weak passwords to reject.
.fi
.Sh SEE ALSO
.Xr PasswordService 8
.Xr mkpassdb 8