MacOSX26.2.sdk/usr/share/man/man8/wspd.8
.Dd April 28, 2019
.Os Darwin
.Dt WSPD 8
.Sh NAME
.Nm wspd
.Nd search in smb share according to MS-WSP protocol
.Sh SYNOPSIS
.Nm /usr/libexec/wspd
.Op Fl sd
.Sh DESCRIPTION
The
.Nm wspd
program
searches in a smb share, specified by MS-WSP specification.
.Pp
To activate the search it is needed to connect to the socket specified to the wspd and send a valid MS-WSP packet.
When reading back the response from the wspd socket, first DWROD (32bits) read is the size of the WSP response packet to recieve.
.Pp
The options are as follows:
.Bl -tag -width indent
.It Fl -s
The UNIX socket wspd listens to.
.It Fl -d
The delay between last connection was disconnected and the time wspd will close if no new connection arrived.
.El
